Repository: MapServer/MapServer-documentation
Catalog: translated/*/download.po
Languages: fr

source: Download
fr: Téléchargement

source: Current Release(s)
fr: Version(s) actuelle(s)

source: **2013-04-19** `mapserver-6.2.1.tar.gz`_ :ref:`Changelog <changelog-6-2-1>`
fr: **19-04-2013** `mapserver-6.2.1.tar.gz`_ :ref:`Changelog <changelog-6-2-1>`

source: **2012-11-14** `mapserver-6.2.0.tar.gz`_ :ref:`Announcement <announce-6-2>`
fr: **14-11-2012** `mapserver-6.2.0.tar.gz`_ :ref:`Announcement <announce-6-2>`

source: **2012-11-14** `mapcache-1.0.0.tar.gz`_ :ref:`Announcement <announce-6-2>`
fr: **14-11-2012** `mapcache-1.0.0.tar.gz`_ :ref:`Announcement <announce-6-2>`

source: **2012-11-14** `tinyows-1.1.0.tar.bz2`_ :ref:`Announcement <announce-6-2>`
fr: **14-11-2012** `tinyows-1.1.0.tar.bz2`_ :ref:`Announcement <announce-6-2>`

source: **2012-11-14** `mapserver-suite-12.11.tar.gz`_ :ref:`Announcement <announce-6-2>`
fr: **14-11-2012** `mapserver-suite-12.11.tar.gz`_ :ref:`Announcement <announce-6-2>`

source: Development Releases
fr: Versions de développement

source: **2012-10-10** `mapserver-6.2.0-rc1.tar.gz`_ :ref:`Changelog <changelog-6-2-0-rc1>`
fr: **10-10-2012** `mapserver-6.2.0-rc1.tar.gz`_ :ref:`Changelog <changelog-6-2-0-rc1>`

source: **2012-09-27** `mapserver-6.2.0-beta4.tar.gz`_ :ref:`Changelog <changelog-6-2-0-beta4>`
fr: **27-09-2012** `mapserver-6.2.0-beta4.tar.gz`_ :ref:`Changelog <changelog-6-2-0-beta4>`

source: **2012-09-06** `mapserver-6.2.0-beta3.tar.gz`_ :ref:`Changelog <changelog-6-2-0-beta3>`
fr: **06-09-2012** `mapserver-6.2.0-beta3.tar.gz`_ :ref:`Changelog <changelog-6-2-0-beta3>`

source: **2012-08-01** `mapserver-6.2.0-beta2.tar.gz`_ :ref:`Changelog <changelog-6-2-0-beta2>`
fr: **01-08-2012** `mapserver-6.2.0-beta2.tar.gz`_ :ref:`Changelog <changelog-6-2-0-beta2>`

source: **2012-06-29** `mapserver-6.2.0-beta1.tar.gz`_ `Changelog <https://github.com/mapserver/mapserver/blob/rel-6-2-0-beta1/HISTORY.TXT>`__
fr: **29-06-2012** `mapserver-6.2.0-beta1.tar.gz`_ `Changelog <https://github.com/mapserver/mapserver/blob/rel-6-2-0-beta1/HISTORY.TXT>`__

source: Past Releases
fr: Anciennes versions

source: **2012-05-18** `mapserver-6.0.3.tar.gz`_ `Changelog <https://github.com/mapserver/mapserver/blob/rel-6-0-3-0/HISTORY.TXT>`__
fr: **18-05-2012** `mapserver-6.0.3.tar.gz`_ `Changelog <https://github.com/mapserver/mapserver/blob/rel-6-0-3-0/HISTORY.TXT>`__

source: **2012-02-08** `mapserver-6.0.2.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-6-0-2/mapserver/HISTORY.TXT>`__
fr: **08-02-2012** `mapserver-6.0.2.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-6-0-2/mapserver/HISTORY.TXT>`__

source: **2011-07-12** `mapserver-6.0.1.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-6-0-1/mapserver/HISTORY.TXT>`__
fr: **12-07-2011** `mapserver-6.0.1.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-6-0-1/mapserver/HISTORY.TXT>`__

source: **2011-07-12** `mapserver-5.6.7.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-5-6-7/mapserver/HISTORY.TXT>`__
fr: **12-07-2011** `mapserver-5.6.7.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-5-6-7/mapserver/HISTORY.TXT>`__

source: **2009-07-23** `mapserver-5.4.2.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-5-4-2/mapserver/HISTORY.TXT>`__
fr: **23-07-2009** `mapserver-5.4.2.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-5-4-2/mapserver/HISTORY.TXT>`__

source: **2009-07-23** `mapserver-5.2.3.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-5-2-3/mapserver/HISTORY.TXT>`__
fr: **23-07-2009** `mapserver-5.2.3.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-5-2-3/mapserver/HISTORY.TXT>`__

source: **2011-07-12** `mapserver-4.10.7.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-4-10-7/mapserver/HISTORY.TXT>`__
fr: **12-07-2011** `mapserver-4.10.7.tar.gz`_ `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-4-10-7/mapserver/HISTORY.TXT>`__

source: Development Source
fr: Source de la version de développement

source: Git Repository: https://github.com/mapserver/mapserver
fr: Dépôt Git: https://github.com/mapserver/mapserver

source: Latest Release Branch: branch-6-2
fr: Dernière branche de version: branch-6-2

source: More information about MapServer development can be found at :ref:`development`
fr: Des informations supplémentaires sur le développement de MapServer peuvent être trouvées sur :ref:`development`

source: If you plan on upgrading to the MapServer 6.0 release, be sure to review the :ref:`MapServer Migration Guide <migration>`.
fr: Si vous prévoyez de faire une mise à jour vers la version MapServer 6.0, assurez-vous d'avoir lu le :ref:`guide de migration MapServer <migration>`.

source: The entire documentation is available as a single PDF document.
fr: La documentation complète est disponible en un seul fichier PDF.

source: Current Release
fr: Version actuelle

source: `MapServer-Documentation.pdf <./MapServer.pdf>`__ |image|
fr: `Documentation MapServer <./MapServer.pdf>`__ |image|

source: Previous Releases
fr: Versions précédentes

source: `MapServer-6.0-Documentation.pdf <./MapServer-60.pdf>`__ |image|
fr: `Documentattion MapServer 6.0 <./MapServer-60.pdf>`__ |image|

source: `MapServer-5.6-Documentation.pdf <./MapServer-56.pdf>`__ |image|
fr: `Documentation MapServer 5.6 <./MapServer-56.pdf>`__ |image|

source: `MapServer-5.4-Documentation.pdf <./MapServer-54.pdf>`__ |image|
fr: `Documentation MapServer 5.4 <./MapServer-54.pdf>`__ |image|

source: Binaries
fr: Binaires

source: MapServer for Windows from MapTools.org. If you are a beginner looking for a complete MapServer solution on the Windows platform, or an advanced user looking to avoid compiling your own, this is what you're looking for. MS4W is a complete Web Server/MapServer/MapScript package. MS4W includes several flavors of MapScript (PHP, C#, Python, Java), and additional dlls for SDE and Oracle support. Several popular Web applications are also available for download, which are pre-configured for MS4W.
fr: MapServer pour Windows sur MapTools.org. Si vous êtes un débutant recherchant d'une solution complète MapServer sur les plateformes Windows ou un utilisateur avancé qui veut éviter de compiler sa propre version, c'est ce que vous cherchez. MS4W est un paquet Serveur web/MapServer/MapScript complet. MS4W inclue plusieurs extensions de MapScript (PHP, C#, Python, Java), et dlls supplémentaires pour la gestion de SDE et Oracle. Plusieurs applications web populaires, également disponibles en téléchargement, sont pré-configurés pour MS4W.

source: OSGeo4W is a binary distribution of a broad set of Open Source geospatial software for Win32 environments (Windows XP, Vista, etc). OSGeo4W includes GDAL/OGR, GRASS, MapServer, OpenEV, uDig, as well as many other packages (about 70 as of summer 2008).
fr: OSGeo4W est une distribution de binaire d'un large spectre de logiciels Open Source geospatiales pour les environnements Win32 (Windows XP, Vista, etc). OSGeo4W inclue GDAL/OGR, GRASS, MapServer, OpenEV, uDig, ainsi que plusieurs autres paquets (à peu près 70 à l'automme 2008)

source: A collection of Open Source GIS tools provided by Frank Warmerdam. This goes beyond your basic web mapping tools and include many useful utilities for creating, manipulating, and serving geo-spatial data. New versions will probably not appear.
fr: Une collection d'outils Open Source SIG fournit par Frank Warmerdam. Cela va au delà de vos outils de cartographie web basique et inclue plusieurs utilitaires pour créer, manipuler et diffuser des données géospatiales.

source: A collection of binary packages that are compiled daily based on the MapServer and GDAL SVN (development and stable branches).
fr: Une collection de paquest binaires compilés tous les jours, basée sur Mapserver et GDAL SVN (version de développement et stable)

source: DebianGIS provides a number of packages including MapServer, PostGIS, GDAL, QGIS, and GEOS. It sometimes lags a little bit behind the absolute latest release, but DebianGIS provides a solid integration environment for a giant slug of Open Source GIS software.
fr: DebianGIS fournit un certain nombre de paquets incluant MapServer, PostGIS, GDAL, QGIS, et GEOS. Il n'est parfois pas à jour des toutes dernières versions mais DebianGIS propose un environnement d'intégration solide de logiciels SIG Open Source.

source: The Enterprise Linux GIS (ELGIS) repository provides up to date packages of MapServer and related OSGeo tools for Enterprise Linux and derivatives, that is Red Hat Enterprise Linux (RHEL), CentOS and Scientific Linux.
fr: Le dépôt Enterprise Linux GIS (ELGIS) fournit des paquets mis à jour de Mapserver et d'autres outils liés à l'OSGEO pour Enterprise Linux et ses dérivés, que sont Red Hat Enterprise Linux (RHEL), CentOS et Scientific Linux.

source: The FGS Linux Installer is a self-extracting file that will install MapServer with PHP/MapScript and all of their dependencies on your Linux system. It provides a stand-alone environment with all the required software (incl. Apache and PHP) to run PHP/MapScript webmapping applications. The bundled version of Apache can be configured to run on any port so it will not interfere with previous installations of Apache or other web servers on your system.
fr: L'installateur FGS de Linux est un fichier auto extractible qui installera MapServer avec PHP/MapScript et toutes ses dépendances sur votre système Linux. Il propose un environnement indépendant avec tous les logiciels nécessaires (incluant Apache et PHP) pour lancer des applications de cartographie en PHP/MapScript. La version incluse d'Apache peut être configurée pour fonctionner sur n'importe quel port pour ne pas interférer avec des installations précédentes d'Apache ou d'autres serveurs web sur votre système.

source: The OpenSUSE Application:Geo repository provides stable Packages for MapServer and other OSGeo tools. Development versions are also made available for testing in other OBS before being migrated to the stable repository.
fr: Le dépôt Application:Geo d'OpenSUSE fournit des paquets stables pour MapServer et les autres outils OSGeo. Les versions de développement sont aussi mises à disposition pour être testées dans d'autres OBS (Open Build Service) avant d'être migrées dans le dépôt stable.

source: UbuntuGIS provides up to date packages of MapServer and related OSGeo tools for the last three releases of Ubuntu.
fr: UbuntuGIS fournit des paquets à jour de Mapserver et d'autres outils liés à l'OSGEO pour les trois dernières versions d'Ubuntu.

source: William Kyngesburye provides excellent, up-to-date packages for Mac OS X. Most of the Open Source GIS stack is provided, including GEOS, GDAL, QGIS, and PostGIS.
fr: William Kyngesburye fournit d'excellents paquets à jour pour Mac OS X. La plupart de la pile SIG Open Source est fournie, incluant GEOS, GDAL, QGIS, et PostGIS.

source: Demo Application
fr: Application de démo

source: Download `Mapserver 5.4.x Demo`_
fr: Télécharger `la démo MapServer 5.4.x`_

source: Download and unzip this file into your computer. Follow the directions in ReadMe.txt. You will most likely need to move the demo directory tree to an appropriate location in your httpd server. You will also need to edit some of the mapfile and template file parameters to reflect the changes in your paths (directory locations).
fr: Téléchargez et décompressez ce fichier sur votre ordinateur. Suivez les explications du fichier ReadMe.txt. Vous devrez probablement déplacer l'arborescence des répertoires de démo dans un endroit approprié de votre serveur httpd. Vous avez également besoin d'éditer certain paramètres de fichiers mapfile et modèles pour refléter les modifications dans les chemins (localisation des répertoires).
