Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapcache.po
Languages: fr

source: With a working mod_fcgid Apache instance, the full httpd.conf snippet to activate MapCache could be:
fr: Avec une instance Apache fonctionnant avec mod_fcgid, la partie à ajouter à httpd.conf pour activer mapcache pourrait être :

source: The MapCache service would then be accessible at http://myserver/map.fcgi[/demo]
fr: Le service MapCache sera alors accessible à l'URL http://myserver/map.fcgi[/demo]

source: Customizing the Build, Or If Something Went Wrong
fr: Personnaliser la compilation, ou s'il y a eu un problème

source: Depending on which packages are available in the default locations of your system, the "cmake .." step will most probably have failed with messages indicating missing dependencies (by default, MapCache has *some* of those). The error message that CMake prints out should give you a rather good idea of what steps you should take next, depending on whether the failed dependency is a feature you require in your build.
fr: Selon les paquetages disponibles dans les emplacement par défaut de votre système, l'étape "cmake .." se sera probablement interrompue avec des messages indiquant des dépendances manquantes (par défaut, MapCache en a plusieurs). Le message d'erreur indiqué par MapCache devrait vous donner de bons indices quant à ce qu'il vous reste à faire, selon que la dépendance manquante vous est nécessaire ou pas.

source: mod_mapcache requires Apache, libcurl, libjpeg and libpng development headers. The CMake script will try to locate them in default system locations, but these locations can be overridden or specified with -D switches. For example, if you get a message such as 'Could NOT find APR ', you can use a command such as (assuming that APR is at /usr/local/apr) :
fr: mod_mapcache nécessite les en-têtes de développement Apache, libcurl, libjpeg et libpng. Le script CMake tentera de les localiser dans les emplacements par défaut du système, qui peut être outrepassé avec des commutateurs -D. Par exemple, si vous avez un message tel que 'Could not find APR', vous pouvez utiliser une commande telle que (en supposant que apr est dans /usr/local/apr):

source: If you don't want e.g. fcgi, you can disable the dependency by re-running CMake with -DWITH_DEPENDENCY=0, e.g.
fr: De même si vous ne voulez pas de fCGI, vous pouvez désactiver la dépendance en relançant le cmake avec -DWITH_DEPENDENCY=0, e.g.

source: Options Supported By the MapCache CMake Builder
fr: Options supportées par le compilateur cmake MapCache

source: Here is a list of supported options that can be enabled/disabled at build.
fr: Voici une liste des options supportées qui peuvent être activées/désactivées à la compilation.

source: **Pixman** (*recommended*, from 0.5 onwards)
fr: **Pixman** (*recommandé*, à partir de la version 0.5)

source: Pixman is a pixel manipulation library used to assemble image tiles when responding to non-tiled WMS requests. Pixman support is recommended as it is highly optimized and will take advantage of recent processor extensions (MMX, SSE2, etc.) to speed up blending and resampling operations. If the Pixman library is not found, MapCache will fall back to internal pixel operations that are slower.
fr: Pixman est une bibliothèque de manipulation de pixel utilisée pour assembler les tuiles lors des réponses à des requêtes WMS non tuilées. Le recours à Pixman est recommandé dans la mesure où il est parfaitement optimisé et tirera parti des récentes extensions des microprocesseurs (MMX, SSE...) pour accélérer les opérations de remplissage et de ré-échantillonnage. Si la bibliothèque Pixman n'est pas trouvée, MapCache utilisera son mécanisme interne qui est plus lent.

source: **SQLite** (*optional*, from 0.5 onwards)
fr: **SQLite** (*optionnel*, à partir de la version 0.5)

source: SQLite is used to enable the SQLite and MBTiles cache backend. Version 3.5.0 or newer is required.
fr: SQLite est utilisé pour permettre d'avoir les caches backend de type SQLite et MBTiles. La version 3.5.0 ou plus récente est requise.

source: **GDAL** (*optional*, from 0.4 onwards, also requires geos)
fr: **GDAL** (*optionnel*, à partir de la version 0.4, nécessite aussi la bibliothèque geos)

source: GDAL (actually OGR) is used by the seeding utility to allow the seeding of tiles only intersecting a given polygon, e.g. to preseed all the tiles of a given country.
fr: GDAL (ou plutôt OGR) est utilisé par le pré-générateur de cache pour permettre la génération de tuiles intersectant un polygone donné, pour par exemple pré-générer les tuiles sur un pays particulier.

source: **GEOS** (*optional*, from 0.5 onwards)
fr: **GEOS** (*optionnel*, à partir de la version 0.5)

source: Along with GDAL/OGR, GEOS is needed by the seeder to test for the intersection of tiles with geographical features. A sufficiently recent version of GEOS (with support for prepared geometries) is required (but not enforced by the configure script, so you'll end up with compilation errors if a too old GEOS version is used).
fr: Parallèlement à GDAL/OGR, GEOS est requis par le pré-générateur pour tester les intersection des tuiles avec des entités géographiques. Une version suffisamment récente de GEOS (avec la prise en charge des géométries préparées) est nécessaire (mais pas vérifié par le script de configuration, vous pouvez donc avoir des erreurs à la compilation avec une version trop ancienne de GEOS)

source: **PCRE** (*optional*)
fr: **PCRE** (*optionnel*)

source: PCRE (Perl Compatible Regular Expressions) can be used instead of POSIX regular expressions for validating WMS dimensions. They are more powerful than POSIX REs (and might be slower). You don't need this if you aren't planning on using WMS dimension support with regex validation, or if your validation needs are covered by posix REs.
fr: Les PCRE (perl compatible regular expressions) peuvent être utilisées en remplacement des expressions régulières POSIX pour valider les dimensions WMS. Elles sont plus puissantes que les expressions régulières POSIX (et peuvent être plus lentes). Vous n'avez pas besoin de ce composant si vous n'avez pas l'intention d'utiliser les dimensions WMS avec un validateur d'expression régulière, ou si vos besoins sont couverts par POSIX.

source: **FastCGI Support** (*optional*)
fr: **Support FastCGI** (*optionnel*)

source: MapCache can run as a FastCGI executable. Note that the overhead of FastCGI is non-negligible with respect to the throughput you may obtain with a native Apache module. The FastCGI build is less tested, and may lag behind the Apache module version on some minor details. YMMV.
fr: MapCache peut fonctionner comme un exécutable FastCGI. Notez bien que la charge induite par FastCGI n'est pas négligeable comparativement aux résultats que vous pourriez obtenir avec un module Apache natif. La version FastCGI est moins testée et peut être à la traîne de la version module Apache sur quelques détails mineurs.

source: **TIFF read/write Cache Support** (*optional*)
fr: **Support du cache TIFF en lecture/écriture ** (*optionnel*)

source: Use TIFFs as a cache backend (READONLY) :
fr: Utiliser des fichiers TIFFs comme système de stockage du cache (LECTURE SEULE)

source: TIFF write support (for creating new TIFF files and adding tiles to existing TIFF files) is still experimental and disabled by default. There is a risk of ending up with corrupt TIFF files if they are placed on a filesystem that does not honor file locking, as in that case multiple processes might end up writing to the same file. File locking across concurrent threads is also problematic, although MapCache tries to detect this situation and apply sufficient locking workarounds. To stay on the safe side, write support should for now only be enabled on local filesystems, with a prefork MPM or FastCGI MapCache install.
fr: Le support du TIFF en écriture (pour créer de nouveaux fichiers TIFF et ajouter des tuiles à des fichiers TIFF existants) est toujours expérimental et désactivé par défaut. Il y a un risque à obtenir des fichiers TIFF corrompus s'ils ne sont pas placés sur un système de fichiers qui ne permet pas le verrouillage de fichier, car dans ce cas de multiples processus pourraient venir écrire dans le même fichier. Le blocage de fichier entre des processus concurrents est également problématique, bien que MapCache essaie de détecter cette situation en amont et de l'éviter. Pour rester prudent, le mode écriture ne devrait être activé que sur des systèmes de fichiers locaux, avec un Apache prefork ou une installation de MapCache en fastCGI.

source: When writing TIFF files, MapCache can also optionally add georeferencing information if compiled with libtiff support. GeoTiff writing does not produce the full tags needed for defining which preojection the grid is in, but will only produce those defining the pixel scale and the tiepoints (i.e. the equivalent information found in the accompanying .tfw files).
fr: Lors de l'écriture de fichiers TIFF, MapCache peut également ajouter des informations de géoréférencement s'il a été compulé avec le support libtiff. L'écriture de GeoTIFF ne génère pas les informations nécessaires au référencement de la projection de la grille, mais seulement l'échelle du pixel et les points de calage (comme on le retrouve dans les fichiers .tfw)

source: **Memcached Cache Support** (*optional*)
fr: **Support du cache de type Memcached ** (*optionnel*)

source: The memcached cache backend is disabled by default. You can optionally enable it as it does not depend on other external libraries (support is obtained through apr-util).
fr: Le système de cache memcached est désactivé par défaut. Vous pouvez optionnellement l'activer car il ne dépend pas de bibliothèques extérieures (c'est apr-util qui le fournit).

source: **Apache Module Options**
fr: **Options de module Apache**

source: You can disable the Apache module building if you only plan on using the FastCGI executable or the seeder.
fr: Vous pouvez désactiver la compilation du module Apache si vous prévoyez uniquement d'utiliser l'exécutable FastCGI ou le pré-générateur.

source: MapCache adds itself to the version string reported by the Apache server. This can be disabled with:
fr: MapCache se rajoute à l'information de version rapportée par le serveur Apache. Ceci peut être désactivé avec

source: **Native MapServer Mode** (*experimental options*)
fr: **Mode MapServer natif** (*options expérimentales*)

source: MapCache is by default not linked to MapServer in any way, and communicates through the WMS protocol only. For improved performance, it is possible to directly use the MapServer C library and avoid an HTTP request and an image compression/decompression. This integration is still experimental and should be used cautiously.
fr: Pas défaut MapCache n'est pas lié à MapServer en aucune sorte, et communique uniquement via le protocole WMS. Pour des raisons de performances, il y a la possibilité d'utiliser directement la bibliothèque C de MapServer et éviter ainsi une requête HTTP et une compression/décompression d'image. Cette intégration est néanmoins expérimentale et doit être utilisée avec précaution.

source: This will use the libmapserver.so from MapServer's install directory. MapServer itself should be compiled with thread-safety enabled, unless you plan to use the prefork MPM or FastCGI, **and** you do not plan to use the seeder. For thread safety on the MapServer side, you might want to have a look at tickets #4041 and #4044.
fr: Ceci utilisera le libmapserver.so du répertoire d'installation de MapServer. MapServer lui-même devra avoir été compilé avec l'option thread_safety activée, à moins que vous n'utilisiez qu'apache en mode prefork ou FastCGI, **et** que vous n'envisagiez pas l'utilisation du pré-générateur. Pour le thread-safety côté MapServer, voyez les tickets #4041 et #4044.

source: **Debug Mode** (*work in progress*)
fr: **Mode Debug** (*travail en cours*)

source: Since the CMake migration, this has to be done.
fr: Depuis la migration vers CMake, cela doit être fait.

source: It enables some extra tests inside the code, and prints out many more debugging messages to the server logs. you should probably not enable this unless you want to track down a problem happening inside MapCache.
fr: Ceci active quelques tests complémentaires dans le code et génère beaucoup plus de messages de debug dans le log serveur. Vous ne devriez probablement pas l'activer à moins de vouloir traquer un problème au sein de MapCache.

source: Windows Instructions
fr: Instructions Windows

source: The following instructions are outdated. Windows builds are now handled identically to the Unix ones with CMake.
fr: Les instructions suivantes sont périmées, les compilations Windows sont maintenant traitées de manière identique à celle sous Unix avec cmake.

source: These instructions target a Windows 7 setup with an Apache httpd compiled from source. The Apache MapCache module has been successfully built with with Microsoft Visual Studio C++ versions 2003, 2008 and 2010.
fr: Ces instructions s'adressent à une configuration Windows 7 avec un Apache httpd compilé à partir des sources. Le module Apache MapCache a été compilé avec succès avec Microsoft Visual Studio C++ versions 2003, 2008 and 2010.

source: Dependencies
fr: Dépendances

source: Required:
fr: Requis:

source: **Apache / APR / APR-UTIL**: included with Apache httpd installation
fr: **Apache / APR / APR-UTIL**: inclus avec l'installation httpd Apache

source: These can be installed manually, or using the appropriate Windows SDK from: http://www.gisinternals.com/sdk/
fr: Celles-ci peuvent être installées manuellement ou en utilisant le SDK Windows prévu à cet effet depuis http://vbkto.dyndns.org/sdk/

source: Recommended:
fr: Recommandé:

source: Optional:
fr: Optionnel:

source: **FCGI**: Needed to build a FastCGI program if you don't want to run MapCache as an Apache module
fr: **FCGI**: Nécessaire à la compilation du programme FastCGI si vous ne voulez par faire tourner MapCache en tant que module Apache.

source: **GDAL / GEOS**: Needed to enable advanced seeding options (for only seeding tiles that intersect a given geographical feature)
fr: **GDAL / GEOS**:: nécessaires à l'activation des options avancées du pré-générateur (pour ne générer que les tuiles intersectant une entité géographique quelconque)

source: **SQLITE**: For enabling the SQLite backend storages
fr: **SQLITE**: Pour activer le stockage dans SQLite

source: **TIFF**: For enabling the TIFF backend storages
fr: **TIFF**: Pour activer le stockage dans des fichiers TIFF

source: Configure Your Makefile
fr: Configurer votre Makefile

source: Open nmake.opt and modify the paths to point to the various libraries.
fr: Ouvrez nmake.opt et modifiez les chemins vers les diverses bibliothèques.

source: If successful, the resulting libraries and executables will be generated in their associated directories:
fr: En cas de succès, les biliothèques et exécutables auront été générés dans leurs répertoires respectifs:

source: Apache module (mod_mapcache.dll)
fr: Module Apache (mod_mapcache.dll)

source: FastCGI MapCache executable (mapcache.exe)
fr: Exécutable MapCache FastCGI (mapcache.exe)

source: MapCache utilities (mapcache_seed.exe)
fr: Utilitaires MapCache (mapcache_seed.exe)

source: Move the Module Into the Apache Directory
fr: Déplacer le module dans le répertoire Apache

source: Copy the *mod_mapcache.dll* file into one of your Apache subdirectories.
fr: Copiez le fichier *mod_mapcache.dll* dans un de vos sous-répertoires Apache.

source: Although other modules are installed into */Apache/modules/*, you should place mod_mapcache.dll wherever its required dll files (libcurl.dll, zlib.dll, etc.) live, to avoid any loading issues later on.
fr: Bien que les autres modules soient installés dans */Apache/modules/*, vous devriez placer mod_mapcache.dll là où sont ses fichiers dll associés (libcurl.dll, zlib.dll, etc.) afin d'éviter tout problème ultérieur de chargement.

source: Configure Your Installed Apache
fr: Configurer votre Apache installé

source: Modify your *httpd.conf* file to load the module:
fr: Modifier votre fichier *httpd.conf* pour charger le module:

source: Next, configure your MapCache directory with the following snippet:
fr: Ensuite, configurez votre répertoire MapCache avec le contenu suivant

source: Configure your *mapcache.xml* file (see the :ref:`Configuration <mapcache_config>` section for help).
fr: Configurez votre fichier *mapcache.xml* (voir la section :ref:`Configuration <mapcache_config>`)

source: If you receive an error such as "cache disk: host system does not support file symbolic linking" you should comment out the line "<symlink_blank/>" in your mapcache.xml file, such as the following:
fr: Si vous obtenez une erreur telle que "cache disk: host system does not support file symbolic linking", vous devriez commenter la ligne "<symlink_blank/>" dans votre fichier mapcache.xml, ainsi :

source: Finally, restart your Apache. You should see a message in Apache's error.log with a message similar to:
fr: Enfin, redémarrer votre Apache. Vous devriez voir un message dans l'error.log d'Apache similaire à:

source: Test Your MapCache Module
fr: Tester votre module MapCache

source: In your web browser, visit the local MapCache demo page: http://127.0.0.1/mapcache/demo/. You should see a clickable list of demo links:
fr: Dans votre navigateur web, allez à la page locale de démonstration MapCache http://127.0.0.1/mapcache/demo/. Vous devriez vois apparaître une liste cliquable de lien de démonstration:

source: Click on one of the demos (such as http://127.0.0.1/mapcache/demo/wmts). A map viewer should load, similar to the image below.
fr: Cliquez sur l'une des démonstration (http://127.0.0.1/mapcache/demo/wmts par exemple), un visualiseur cartographique devrait apparaître, similaire à l'image ci-dessous:

source: Zoom in a few times. Your configured cache location should be generating tiles (in this case inside D:/ms4w/tmp/ms_tmp/cache/).
fr: Zoomez plusieurs fois, et votre emplacement de cache devrait générer des tuiles (dans notre cas dans :/ms4w/tmp/ms_tmp/cache/).

source: Proxying Unsupported Requests
fr: Proxyfier les requêtes non prise en charge

source: This page is a work in progress.
fr: Cette page est un travail en cours

source: MapCache has the ability to forward any incoming request that it cannot natively respond to (either by returning a tile directly, by :ref:`merging <mapcache_tile_assembling>` multiple tiles, etc.).
fr: MapCache a la possibilité de transférer une requête entrante à laquelle il ne peut pas répondre nativement (en renvoyant une tuile ou en en :ref:`fusionnant <mapcache_tile_assembling>` plusieurs)

source: This setup allows MapCache to be placed transparently in front of an existing OGC-service supplying server to accelerate tiled or GetMap requests for a selected number of :ref:`grids <mapcache_grids>`, while maintaining service compatibility for, e.g., unsupported grids, WFS requests, ...
fr: Cette configuration permet à MapCache d'être positionné de manière transparente devant un serveur OGC pré-existant afin d'accélérer les requêtes tuilées ou non pour un nombre choisi de :ref:`grilles <mapcache_grids>`, tout en maintenant la compatibilité du service pour d'autre types de requêtes (WFS, SRS non pris en charge...)

source: The proxying of requests is configured inside the :ref:`WMS <mapcache_wms>` MapCache service, which is semantically awkward.
fr: La proxyfication des requêtes se configure au sein du service :ref:`WMS <mapcache_wms>` MapCache, ce qui peut sembler sémantiquement étrange.

source: The configuration for this behavior is activated by a succession of entries inside the <forwarding_rule> element of the wms <service>. Rules are tested for in the order in which they appear in the mapcache.xml configuration file, and the first one that matches is used. If no rules are defined, or if no rule matches the incoming request, an error is returned to the user.
fr: La configuration de ce comportement s'active par une succession d'instructions au sein de l'élément <forwarding_rule> du <service> wms. Les règles sont testées dans l'ordre d'apparition dans le fichier mapcache.xml, et la première qui correspond est utilisée. Si aucune règle n'est indiquée, ou si aucune règle ne correspond à la requête entrante, une erreur est renvoyée à l'utilisateur.

source: A <forwarding_rule> consists of a set of matching rules and an <http> block defining where the request should be forwarded to.
fr: Une règle de redirection (<forwarding_rule>) est faite d'un ensemble de règles de vérification et d'un bloc <http> indiquant vers où la requête doit être redirigée.

source: Parameter Filtering
fr: Filtrage selon des paramètres

source: The rules apply to the key-value pair parameters received in the incoming request, and are added with the <param> keyword:
fr: Les règles s'appliquent aux paramètres clé-valeur qui sont transmis dans la requête entrante, et sont ajoutés avec le mot-clé <param>:

source: The "type" attribute is the same as what is allowed for :ref:`dimensions <mapcache_dimensions>`, i.e. allowed values are "values", "regex", and "intervals". In the previous example, the rule would match any incoming request having ...&SERVICE=WFS&... or ...&SERVICE=WCS&... in its request parameters.
fr: L'attribut "type" est le même que ce qui est autorisé pour :ref:`dimensions <mapcache_dimensions>`, c'est-à-dire que les valeurs autorisées sont "values", "regex" et "intervals". Dans l'exemple précédent, la règle correspondrait à n'importe quelle requête ayant ..&SERVICE=WFS&... ou ...&SERVICE=WCS&... dans ses paramètres.

source: Multiple rules can be used if the filtering has to be done on multiple parameters. In the previous example, the rule would match a WFS or WCS request that concerns the "somelayername" layer only.
fr: Des règles multiples peuvent être utilisées si le filtrage a été fait sur de multiples paramètres. Dans l'exemple précédent, la règle correspondrait à des requêtes WFS ou WCS sur la couche "somelayername" uniquement.

source: A <forwarding_rule> that has no <param> child will match any incoming request that could not be serviced by MapCache directly from its cache, and can be used to forward all unsupported request to a full OGC- compliant server so that an un-cached response can be returned to the client.
fr: Une règle de redirection qui n'a pas de <param> correspondra à n'importe qu'elle requête qui ne peut être traitée directement par MapCache à partir de son cache, et peut être utilisée pour transférer toutes les requêtes non prises en charge vers un serveur OGC complet qui fournira la réponse ad hoc.

source: Proxy Destination
fr: Destination de la redirection

source: Once a <forwarding_rule> matches, its <http> child will be used to proxy the request to another server.
fr: Une fois qu'une <forwarding_rule> correspond, son élément <http> sera utilisé pour transférer la requête à la destination indiquée.

source: Seeder
fr: Alimentation du cache

source: configurable number of seeding threads, to speed up the rendering
fr: Nombre de process d'alimentation configurable, pour accélérer le rendu

source: ability to reseed tiles older than a certain timestamp
fr: capacité à régénérer certaines tuiles plus âgées qu'une date particulière

source: ability to seed tiles given a shapefile/OGR datasource
fr: capacité à générer les tuiles d'après une source de données shapefile/ogr

source: The seeding utility is named mapcache_seed, and is located under your install directory (default is /usr/local/bin).
fr: L'utilitaire d'alimentation du cache est nommé mapcache_seed et est situé sous le répertoire d'installation (/usr/local/bin par défaut).

source: Commandline Options
fr: Options de ligne de commande
