Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapcache.po
Languages: fr

source: **<units>**: The ground units used by the grid's projection. This entry is not used directly by MapCache aside from calculating scales for the WMTS capabilities document. Allowed values are:
fr: **<units>**: Les unités de mesure utilisées par la projection de la grille. Cette information n'est pas directement utilisée par MapCache si ce n'est pour calculer les échelles dans le document "GetCapabilities" produit en WMTS. Les valeurs autorisées sont:

source: **m** : meters
fr: **m**: mètres

source: **dd** : decimal degrees
fr: **dd**: degrés décimaux

source: **ft** : feet
fr: **ft**: pieds

source: **<resolutions>**: This is a list of resolutions for each of the zoom levels defined by the grid. This must be supplied as a list of positive floating point values, separated by spaces and ordered from largest to smallest. The largest value will correspond to the grid's zoom level 0. Resolutions are expressed in "units-per-pixel", depending on the unit used by the grid (e.g. resolutions are in meters per pixel for most grids used in webmapping).
fr: *<resolutions>**: Il s'agit d'une liste de résolutions pour chacun des niveaux de zoom définis pour la grille. Cela doit être renseigné sous la forme d'une liste de nombres décimaux, séparés par des espaces et classés du plus grand au plus petit. La valeur la plus grande correspond au niveau de zoom 0. Les résolutions sont exprimées en "unités par pixel", dépendant donc de l'unité utilisée par la grille (dans la plupart des cas les résolutions sont exprimées en mètres par pixel).

source: Optional Configuration Options
fr: Options de configuration optionnelles

source: **<srsalias>**: This tag can be specified multiple times, and allows the user to add multiple SRS entries for a given grid. This is especially useful if the EPSG id for a given projection has evolved over time, or to support catalogs other than the EPSG one (which is the only catalog supported by the WMS specification).
fr: **<srsalias>**: Cet élément peut être indiqué plusieurs fois, et permet à l'utilisateur d'ajouter plusieurs correspondances de srs pour une grille donnée. C'est particulièrement utile quand un code epsg a évolué dans le temps, ou pour utiliser d'autres catalogues que celui de l'EPSG (qui est le seul admis par les spécifications WMS).

source: **<title>**: The name of the grid, in human readable form. Appears in the capabilities documents.
fr: **<title>**: Le nom de la grille, dans une forme lisible par les humains. Apparaît dans les document de capacités.

source: **<WellKnownScaleSet>**: See the WMTS keyword. This will add a WellKnownScaleSet entry to the WMTS capabilities document. It is up to the user to make sure that the supplied resolutions for the grid actually match the pre-defined WellKnownScaleSet.
fr: **<WellKnownScaleSet>**: voir les options WMTS. Ceci ajoutera un élément WellKnownScaleSet au document de capacités WMTS. Il appartient à l'utilisateur de vérifier que les résolutions définies pour la grille correspondent bien à celle prédéfinies dans le WellKnownScaleSet

source: Preconfigured Grids
fr: Grilles préconfigurées

source: There are three predefined grids you can use without defining them in the mapcache.xml file:
fr: Il y a trois grilles prédéfinies que vous pouvez utiliser sans les définir dans le fichier mapcache.xml:

source: The "WGS84" grid corresponds to a grid where the whole world is rendered on two 256x256-pixel tiles at level 0 (i.e. the (-180,-90,180,90) extent fits on a 512x256 image). It goes down to zoom level 17.
fr: La grille "WGS84" correspond à une grille en plate-carrée où le monde entier est rendu en deux tuiles de 256x256 pixels au niveau 0 (c'est-à-dire que l'étendue (-180,-90,180,90) tient sur une image de 512x256 pixels). La grille descend ensuite jusqu'au niveau 17.

source: The "g" grid may be used to overlay tiles on top of GoogleMaps, and is the default tiling scheme used in webmapping applications. This grid goes down to zoom level 18. Level 0 is a single 256x256 tile. This grid's default SRS is EPSG:900913, which is non-standard but in wider use than than its official EPSG:3857 entry.
fr: la grille "g" correspond au cas de figure où vous souhaitez superposer vos tuiles à GoogleMaps. Il s'agit du modèle de tuilage par défault dans les applications de webmapping. Cette grille descend au niveau 18. Le niveau 0 est une unique tuile de 256x256. Le srs par défaut de la grille est le EPSG:900913 qui n'est pas standard mais est plus répandu que l'officiel EPSG:3857.

source: The "GoogleMapsCompatible" grid is nearly identical to the "g" grid, except that its default SRS is EPSG:3857 instead of EPSG:900913.
fr: La grille GoogleMapsCompatible" est presque identique à la grille "g" si ce n'est qu'elle utilise l'EPSG:3857 par défaut plutôt que EPSG:900913.

source: Tileset
fr: Jeu de tuiles

source: A tileset is the essential configuration item for mod-mapcache, and corresponds to a set of tiles coming from a *source*, stored in a *cache*, and returned to the client in a given *format*.
fr: Le jeu de tuiles (tileset) est l'élément essentiel de configuration pour mod-mapcache, et correspond à un ensemble de tuiles issues d'une *source*, stockées dans un *cache* et renvoyées au client selon un *format* donné.

source: Services are the type of request that mod-mapcache will respond to. You should, of course, enable at least one.
fr: Les services sont les types de requêtes auxquelles mod-mapcache répondra. Vous devez en activer au moins un.

source: Miscellaneous
fr: Divers

source: For specific information about locking, read :ref:`this <mapcache_locks>`.
fr: Pour des informations sur le verrouillage, voir: :ref:`<mapcache_locks>`."

source: Tileset Dimensions
fr: Dimensions d'un jeu de tuiles

source: WMS layers in MapServer can support dimensions, see :ref:`WMS Dimension <wms_dimension>` for details. MapCache also supports dimensions for tilesets.
fr: Les couches WMS dans MapServer peuvent supporter les dimensions, voir :ref:`WMS Dimension <wms_dimension>` pour les détails. MapCache supporte également les dimensions pour les jeux de tuiles.

source: Storing separate tile caches for different dimensions has several practical use cases such as creating caches for different spatial boundaries, elevations, or time periods. It also provides a mechanism for dynamically switching Mapfiles based on a dimension value.
fr: Stocker des caches de tuiles distincts pour différentes dimensions est utile dans un certain nombre de situations comme créer des caches pour différentes limites spatiales, altitudes ou périodes de temps. Cela fournit aussi un mécanisme pour changer de Mapfile selon une valeur de dimension donnée.

source: MapCache uses Dimensions to:
fr: MapCache utilise les dimensions pour:

source: create the directory structure of disk and SQLite caches, using the template structure with ``{dim}`` replacement entry, see *Template Structure* in :ref:`mapcache_cache_disk` and *Using Multiple SQLite Database Files* in :ref:`mapcache_cache_sqlite`.
fr: créer la structure de dossiers des caches disque et SQLite qui utilisent la variable de substitution ``{dim}`` dans le *template* de leur configuration, voir *Template Structure* dans :ref:`mapcache_cache_disk` et *Using Multiple SQLite Database Files* dans :ref:`mapcache_cache_sqlite`.

source: create the database structure of SQLite caches, using custom schema with ``:dim`` replacement entry, see *Custom Schema* in :ref:`mapcache_cache_sqlite`.
fr: créer le schéma de données des caches SQLite qui utilisent la variable de substitution ``:dim``, voir *Custom Schema* dans :ref:`mapcache_cache_sqlite`.

source: build requests to WMS sources: any dimensions specified for a tileset will be forwarded on to their WMS source whenever a cache miss occurs.
fr: construire les requêtes à destination des sources WMS: toute dimension spécifiée pour un jeu de tuile est transmise à sa source WMS lorsqu'un défaut de cache survient.

source: Enabling Dimension Support in MapCache
fr: Activation des dimensions dans MapCache

source: Dimensions are enabled in the configuration file at the :ref:`mapcache_config_tileset` level. Each tileset may define its own dimensions with a ``<dimensions>`` section which includes one or several ``<dimension>`` elements.
fr: Les dimensions sont activées dans le fichier de configuration au niveau du :ref:`mapcache_config_tileset`. Chaque jeu de tuile peut définir ses propres dimensions à l'aide d'une section ``<dimensions>`` qui inclut un ou plusieurs éléments ``<dimension>``.

source: Dimension Attributes
fr: Attributs de dimension

source: Several attributes are defined for the ``<dimension>`` element.
fr: Plusieurs attributs sont définis pour l'élément ``<dimension>``.

source: ``name`` (required): The name by which the dimension is refered to in a WMS request (minus the ``dim_`` prefix as specified in `WMS 1.1.1 Specification`_).
fr: ``name`` (requis): Le nom de la dimension dans une requête WMS (sans le préfixe ``dim_`` spécifié dans `WMS 1.1.1 Specification`_).

source: ``default`` (required): The default value for the dimension if none is explicitly provided in the WMS request.
fr: ``default`` (requis): La valeur par défaut de la dimension lorsqu'aucune valeur n'est fournie explicitement dans la requête WMS.

source: ``type`` (required): MapCache defines several ways for specifying a dimension: ``values``, ``regex``, ``sqlite`` and ``time``. They are described in the following sections.
fr: ``type`` (requis): MapCache définit plusieurs façons de spécifier une dimension: ``values``, ``regex``, ``sqlite`` et ``time``. Ces types de dimensions sont décrits dans la suite.

source: ``unit`` (optional): dimension unit. This information is used only in the GetCapabilities response.
fr: ``unit`` (optionnel): unité physique de la dimension. Cette information n'est utilisée que dans la réponse à une requête GetCapabilities.

source: Dimension Types
fr: Types de dimensions

source: Several types of dimensions are supported by MapCache: Values, Regex, SQLite and Time. They can be classified into two groups depending on how dimension values are defined:
fr: Plusieurs types de dimensions sont supportés par MapCache: ``values``, ``regex``, ``sqlite`` et ``time``. Ils peuvent être classés en deux groupes selon comment les valeurs de la dimension sont définies:

source: First level dimension types: Values and Regex. Dimensions values are statically specified in the configuration file.
fr: Dimensions de premier niveau: ``values`` et ``regex``. Les valeurs de la dimension sont spécifiées statiquement dans le fichier de configuration.

source: Second level dimensions types: SQLite and Time. Dimensions values are stored in a dynamic backend (a SQLite file) so that an update in the dimension values does not involve a server restart.
fr: Dimensions de deuxième niveau: ``sqlite`` et ``time``. Les valeurs de la dimension sont stockées via un mécanisme dynamique (un fichier SQLite) de sorte qu'une modification de ces valeurs ne nécessite pas de redémarrage du serveur MapCache.

source: First Level Dimensions
fr: Dimensions de premier niveau

source: First level dimensions define values in the configuration file.
fr: Les dimensions de premier niveau définissent leurs valeurs dans le fichier de configuration.

source: Values Dimensions
fr: Dimensions de type ``values``

source: A Values type dimension lists all possible dimension values. The name of the dimension is used as the key in a query string when accessing through a WMS or WMTS service, for example ``&DIM1=foobarbaz``.
fr: Une dimension de type ``values`` donne la liste de toutes ses valeurs possibles. Le nom de la dimension est utilisée comme clé dans une requête WMS ou WMTS, par exemple ``&DIM1=foobarbaz``.

source: If a client does not provide the dimension as a key value pair the default will be used (in this example ``foobar``).
fr: Lorsqu'un client ne fournit pas de valeur explicite pour la dimension, alors la valeur par défaut est prise en compte (c'est-à-dire ``foobar`` dans cet exemple).

source: Regex Dimensions
fr: Dimensions de type ``regex``

source: An alternative to the hard-coded list of values is to use regular expressions.
fr: Une alternative à une liste de valeurs en dur, est l'utilisation d'expressions régulières.

source: The following example creates a MAPFILE dimension, for using the same MapCache tileset with different MapServer Mapfiles. The name of the Mapfiles need not be known to MapCache, and can therefore be created even after MapCache has been started.
fr: L'exemple suivant crée une dimension MAPFILE, afin d'utiliser le même jeu de tuiles MapCache avec différents Mapfiles MapServer. MapCache n'a pas besoin de connaître les noms des Mapfiles, qui peuvent alors être créés après le démarrage de MapCache.

source: When a user passes a ``MAPFILE=/path/to/mapfile``, the string ``/path/to/mapfile`` is validated against the supplied (PCRE) regular expression. The one in this example allows a name composed of alphanumeric characters separated by slashes (/) and finishing with ".map" ( [a-zA-Z0-9\./]*\.map$ ) , but will fail if there are two consecutive dots (..) in the path, to prevent file-system traversal.
fr: Lorsqu'un utilisateur passe ``MAPFILE=/path/to/mapfile``, MapCache vérifie que la chaîne ``/path/to/mapfile`` répond à l'expression régulière (PCRE) définie dans le fichier de configuration. Dans cet exemple, l'expression régulière valide un nom composé de caractères alphanumériques séparés par des barres obliques (/) et se terminant par ".map" ( [a-zA-Z0-9\./]*\.map$ ), mais échoue en présence de deux points consécutifs (..) afin d'empêcher toute traversée du système de fichiers.

source: Second Level Dimensions
fr: Dimensions de deuxième niveau

source: Second level dimensions store values in a dynamic back-end, initially a SQLite file. This allows for adding new dimension values without modifying MapCache configuration file, which otherwise would need to restart the server.
fr: Les dimensions de deuxième niveau stockent leurs valeurs via un mécanisme dynamique externe, initialement un fichier SQLite. Cela permet d'ajouter de nouvelles valeurs pour la dimension sans modifier le fichier de configuration, ce qui sinon obligerait à redémarrer le serveur.

source: Time Dimensions
fr: Dimensions de type ``time``

source: MapCache supports WMTS and WMS requests that include a TIME parameter, for both timestamps and time intervals. See :ref:`MS RFC 96: Time Dimension Support in MapCache Tilesets <rfc96>` initial proposal for further details.
fr: MapCache supporte les requêtes WMTS et WMS qui incluent un paramètre TIME, aussi bien pour les dates que pour les intervalles de temps. Voir :ref:`MS RFC 96: Time Dimension Support in MapCache Tilesets <rfc96>` pour plus de détails.

source: Defining a Time dimension in MapCache involves a SQLite back-end. Two elements must be provided:
fr: La définition d'une dimension de type ``time`` met en œuvre un fichier SQLite. Deux éléments sont à spécifier:

source: ``<dbfile>``: Location of the SQLite file implementing the time dimension
fr: ``<dbfile>``: Emplacement du fichier SQLite qui sert de support à la dimension de type ``time``

source: ``<query>``: SQL query returning the list of available timestamp values within a given time interval. In that query, start time and end time are represented by the respective placeholders ``:start_timestamp`` and ``:end_time_stamp``. Returned values shall be in ``yyyy-mm-ddThh:mm:ssZ`` time format, as specified in `RFC 3339`_, but restricted to UTC.
fr: ``<query>``: Requête SQL qui renvoie la liste des valeurs de dates disponibles dans un intervalle de temps donné. Dans cette requête, la date de début et la date de fin sont représentées par les variables de substitution ``:start_timestamp`` et ``:end_time_stamp``. Les valeurs renvoyées doivent être au format de date ``yyyy-mm-ddThh:mm:ssZ``, tel que spécifié dans la `RFC 3339`_ mais restreint à l'UTC.

source: Time values in the SQLite back-end are expressed in Unix time, i.e. the number of seconds that have elapsed since January 1, 1970 (midnight UTC).
fr: Les valeurs temporelle dans le fichier SQLite sont exprimées en temps Unix, c'est-à-dire un nombre de secondes depuis le premier janvier 1970 à minuit UTC.

source: Querying the back-end with an interval may result in returning multiple timestamp values, each of which referencing distinct tiles. Assembling these tiles is described in `Tile Assembly Policies`_ section below.
fr: Une requête temporelle avec un intervalle peut renvoyer plusieurs valeurs de dates, chacune faisant référence à des tuiles distinctes. Assembler ces tuiles est décrit dans la section `Tile Assembly Policies`_ plus loin.

source: SQLite Dimensions
fr: Dimensions de type ``sqlite``

source: In a SQLite dimension, dimension values are stored in a SQLite file. Moreover, each value references a list of internal, or sub-dimension values which are used to query cache.
fr: Dans une dimension de type ``sqlite`` les valeurs de dimension sont stockées dans un fichier SQLite. De plus, chaque valeur référence une liste de valeurs internes, dites de sous-dimension, qui sont utilisées pour formuler les requêtes au cache.

source: For example, let's define a "sensor" dimension whose allowed values represent various Earth observation spacecrafts. A WMS request with that dimension may contain, e.g.: ``...&dim_sensor=spot&...`` In this example, each sensor references several data along an internal "product" sub-dimension. An example of the "sensor" dimension back-end contents is represented in the following table:
fr: Par exemple, soit une dimension "sensor" dont les valeurs possibles représentent divers satellites d'observation de la Terre. Une requête WMS avec cette dimension peut contenir: ``...&dim_sensor=spot&...`` Dans cet exemple, chaque capteur référence plusieurs types de données selon une sous-dimension interne nommée "product". Un exemple du contenu de la dimension "sensor" est représenté sur la table suivante:

source: Sensor dimension
fr: Dimension "sensor"

source: The WMS request occurs at the "sensor" dimension level. The cache query is performed at the "product" sub-dimension level. In case of a cache miss, the "product" sub-dimension values are used to query the data source.
fr: La requête WMS se passe au niveau de la dimension "sensor". La requête sur le cache a lieu au niveau de la sous-dimension "product". Dans le cas d'un défaut de cache, les valeurs de la sous-dimension "product" sont utilisées pour formuler une requête à la source de données.

source: Querying the back-end may then result in returning multiple sub-dimension values, each of which referencing distinct tiles. Assembling these tiles is described in `Tile Assembly Policies`_ section below.
fr: Une requête à une dimension de type ``sqlite`` peut alors renvoyer plusieurs valeurs de sous-dimensions, chacune faisant référence à des tuiles distinctes. Assembler ces tuiles est décrit dans la section `Tile Assembly Policies`_ plus loin.

source: Tile Assembly Policies
fr: Politiques d'assemblage des tuiles

source: When several time or sub-dimension values are returned from a dimension back-end query, the resulting tile is an assembly of all simple tiles matching each value. The way simple tiles are assembled is set with the ``<assembly_type>`` tag of the ``<dimensions>`` element. Currently only two values are implemented in MapCache:
fr: Lorque plusieurs valeurs de temps ou de sous-dimensions sont renvoyées suite à une requête à une dimension de deuxième niveau, la tuile résultante est un assemblage de toutes les tuiles simples associées à chaque valeur. La façon dont ces tuiles sont assemblées est définie avec l'élément ``<assembly_type>`` de la section ``<dimensions>``. Seulement deux valeurs sont prises en charge par MapCache:

source: ``none``: No assembly is performed, the resulting tile is the first retrieved simple tile. This is the default value.
fr: ``none``: Aucun assemblage n'est réalisé, la tuile résultante est la première tuile récupérée du cache. C'est la valeur par défaut.

source: ``stack``: Every pixel of the resulting tile is filled with the first opaque pixel found in all simple tiles in their retrieval order, e.g.:
fr: ``stack``: Chaque pixel de la tuile résultante est rempli avec le premier pixel opaque trouvé dans toutes les tuiles dans leur ordre de récupération, par exemple:

source: Assembly type: ``stack``
fr: Type d'assemblage: ``stack``

source: Product #1
fr: Produit 1

source: Product #2
fr: Produit 2

source: ``stack`` assembly of Products #1 & #2
fr: Assemblage ``stack`` des produits 1 et 2

source: The resulting tile may or may not be cached depending on the value of the ``<store_assemblies>`` tag of the ``<dimensions>`` element. The two possible values are ``true`` and ``false``. Default is ``true``.
fr: Il est possible de choisir si la tuile résultante doit être stockée dans le cache ou non, via l'élément ``<store_assemblies>`` de la section ``<dimensions>``. Les deux valeurs possibles sont ``true`` et ``false``. La valeur par défaut est ``true``.

source: The ``<subdimensions_read_only>`` tag of the ``<dimensions>`` element indicates whether data source shall be queried in case of cache miss. The two possible values are ``true`` and ``false``. Default is ``false``.
fr: L'élément ``<subdimensions_read_only>`` de la section ``<dimensions>`` indique si la source de données doit être interrogée en cas de défaut de cache. Les deux valeurs possibles sont ``true`` et ``false``. La valeur par défaut est ``false``.

source: Storing Dimensions
fr: Stockage des dimensions

source: When using a disk based cache tiles will be stored in a folder structure similar to ``base/gridname/DIM1/value/xx/xx/xx/xx/xx/xx.png`` (where DIM1 is the dimension value).
fr: Dans un cache de type disque, les tuiles sont stockées dans une structure de dossier ressemblant à ``base/gridname/DIM1/value/xx/xx/xx/xx/xx/xx.png`` (où DIM1 est la valeur de dimension).

source: The order of the ``<dimension>`` tags inside the ``<dimensions>`` tag is important as it is used to create the directory structure for the disk cache. If you change the order of these values, any tiles that have been previously cached are invalidated (they will be unavailable to MapCache but not deleted).
fr: L'ordre des éléments ``<dimension>`` à l'intérieur de la section ``<dimensions>`` est important car il est utilisé pour créer la structure de répertoires pour le cache de type disque. Si l'ordre est modifié, toutes les tuiles qui ont été déjà stockées dans le cache sont invalidées (elles deviennent inaccessibles à MapCache mais ne sont pas détruites).

source: Templates can be used to change the folder structure for example:
fr: Les "templates" peuvent être utilisés pour adapter la structure des dossiers, par exemple:

source: Templates can also be used to change Sqlite database names e.g.
fr: Les "templates" peuvent aussi être utilisés pour adapter le nom d'un fichier SQLite, par exemple:

source: Accessing Tile Caches with Dimensions
fr: Accès à un cache de tuiles à l'aide des dimensions

source: To retrieve a tile with a specific dimension, add the dimension name and value to the request query string e.g. ``&DIM1=value``
fr: Pour obtenir une tuile avec une dimension spécifique, il suffit d'ajouter le nom de la dimension et sa valeur à la requête, par exemple: ``&DIM1=value``
