Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapcache.po
Languages: fr

source: Only WMS and WMTS clients support passing dimensions to MapCache. Other tile services such as gmaps (GoogleMaps), tms, and KML do not support dimensions. WMTS however does allow access using a x,y,z addressing scheme, so by using URL rewriting on the web server tile-based clients (for example an OpenLayers ``ol.source.XYZ`` layer) can load a dimension-based tileset.
fr: Seuls les clients WMS et WMTS supportent le passage des dimensions à MapCache. Les autres services de tuiles, tels que gmaps (GoogleMaps), tms et KML ne supportent pas les dimensions. Toutefois, WMTS permet l'accès à une tuile selon un schéma d'adressage x,y,z, ce qui ouvre la possibilité à des clients de tuiles (par exemple une couche OpenLayers ``ol.source.XYZ``) d'accéder à un jeu de tuiles avec dimensions grâce à une réécriture d'URL sur le serveur web.

source: Seeding Tile Caches with Dimensions
fr: Alimenter un cache de tuiles à l'aide des dimensions

source: The :ref:`MapCache seeding tool <mapcache_seed>` allows specific dimensions to be seeded with the following syntax:
fr: :ref:`L'outil d'alimentation de MapCache <mapcache_seed>` autorise d'alimenter des dimensions spécifiques avec la syntaxe suivante:

source: FeatureInfo Requests
fr: Requêtes FeatureInfo

source: Image Formats
fr: Formats d'image

source: MapCache allows you to configure how the image should be saved to a cache once it has been requested from a source. The JPEG format should mostly be used for raster imagery, whereas the PNG format is most useful for vector based imagery where there are large uniform areas.
fr: MapCache vous permet de configurer comment l'image doit être sauvegardée dans le cache une fois qu'elle a été demandée à une source. Le format JPEG doit le plus souvent être utilisé pour les images raster tandis que le format PNG est plutôt utile basée sur des sources vecteurs où il y a des zones uniformes larges.

source: JPEG Format
fr: Format JPEG

source: The JPEG format saves tiles to JPEG. You can configure the JPEG compression level (from 1 to 100) and the colorspace that should be used (RGB or YCbCr)
fr: Le format JPEG sauve les tuiles en jpeg. Vous pouvez configurer le niveau de compression JPEG (de 1 à 100) et l'espace de couleurs qui devrait être utilisée (RGB ou YCBCr)

source: *quality*: This is the typical JPEG quality setting. Values under 50 produce lighter images but with notable compression artifacts. 100 should be avoided as it produces very heavy images.
fr: *quality*: c'est la configuration de qualité jpeg typique. les valeurs sous 50 produisent des images plus légères avec des artefacts de compression notables. 100 devrait être utilisé comme il produit des images de tailles très élevées

source: *photometric*: By default the YCbCr colorspace is used as it produces images that tend to be 2 to 3 times lighter. Use RGB if you don't want the default.
fr: *photometric*: Par défaut, l'espace de couleur YCbCr est utilisé comme il produit des images qui tendent à être 2 à 3 fois plus légères. Utilisez rgb si vous ne voulez pas la valeur par défaut.

source: PNG Format
fr: Format PNG

source: The PNG format creates PNG images, with optional quantization (reduction of the number of colors to create an 8-bit palleted PNG).
fr: Le format PNG créé des images PNG, avec une quantization optionnelle (réduction du nombre de couleurs pour créer un PNG à palette 8bit)

source: *compression*: Choose which zlib compression to apply to the image data. Recognized values are "fast" and "best". Omit the key to use the default zlib compression.
fr: *compression*: choisir quelle compression zlib à appliquer aux données de l'image. Les valeurs reconnues sont "fast" et "best". Omettre la clé pour utiliser la compression zlib par défaut.

source: *colors*: Number of colors to use for quantization. Omit this key to produce 24 or 32 bit RGB/RGBA PNGs, or set to a value between 2 and 256 to create an 8-bit palleted PNG. The quantization step is destructive: There is no guarantee that pixels will not have a noticeable shift in color in the case when the tile contains many colors.
fr: *colors*: nombre de couleurs à utiliser pour la quantization. Omettre cette clé pour produire des pngs RGB/RGBA 24 ou 32 bit, ou définir une valeur entre 2 et 256 pour créer un png à palette 8-bit. L'étape de quantization est destructrice, il n'y a pas de garantie que les pixels ne subissent pas un changement notable de couleurs dans le cas où la tuile contient de nombreuses couleurs.

source: Mixed Format
fr: Format mixte

source: There is a third special format which mixes JPEG and PNG compression depending on the contents of the image. This format allows creation of caches for raster imagery using JPEG compression (which is more efficient) on zones with imagery data, and PNG compression (which supports trasnparency) on zones with no imagery or on a boundary between imagery and emptiness.
fr: Il y a un troisème type de format spécial qui mélange les compressions JPEG et PNG en fonction du contenu de l'image. Ce format permet de créer des caches pour les images raster en utilisant la compression JPEG (qui est plus efficace) sur les zones avec données images, et la compression PNG (qui supporte la transparence) sur les zones avec aucune image ou sur une limite entre les images et un contenu vide.

source: *opaque*: The format to use when the image has only fully opaque pixels
fr: *opaque*: le format à utiliser quand l'image a seulement des pixels totalement opaques

source: *transparent*: The format to use when the image has some transparent or semi-opaque pixels.
fr: *transparent*: le format à utiliser quand l'image a quelques pixels transparents ou semi-opaques.

source: MapCache is a server that implements tile caching to speed up access to WMS layers. The primary objectives are to be fast and easily deployable, while offering the essential features (and more!) expected from a tile caching solution.
fr: MapCache est un serveur qui implémente la mise en cache de tuiles pour accélérer l'accès aux couches WMS. Les premiers objectifs sont d'être rapide et facilement déployable, tout en offrant les fonctionnalités essentielles (et plus encore!) attendues d'une solution de mise en cache de tuiles.

source: `MapCache presentation slides at FOSS4G2011 <http://www.slideshare.net/tbonfort/modgeocache-mapcache-a-fast-tiling-solution-for-the-apache-web-server>`__
fr: `Présentation de MapCache au FOSS4G2011 <http://www.slideshare.net/tbonfort/modgeocache-mapcache-a-fast-tiling-solution-for-the-apache-web-server>`__

source: Features
fr: Fonctionnalités

source: services WMS, WMTS, TMS, VirtualEarth/Bing and Google Maps requests: :ref:`mapcache_services`
fr: Requêtes vers des services WMS, WMTS, TMS, VirtualEarth/Bing et Google Maps: :ref:`mapcache_services`

source: ability to respond to untiled WMS requests by merging tiles from the cache or forwarding them to the WMS source: :ref:`mapcache_tile_assembling`
fr: capacité à répondre à des requêtes WMS quelconques par fusion des tuiles du cache ou transfert des requêtes à la source WMS: :ref:`mapcache_tile_assembling`

source: responds to WMS/WMTS :ref:`GetFeatureInfo <mapcache_featureinfo>` requests (forwarded to source service)
fr: répond à des requêtes :ref:`GetFeatureInfo <mapcache_featureinfo>` WMS/WMTS (transmis au service source)

source: :ref:`KML <mapcache_kml>` superoverlay generation
fr: génération de :ref:`KML <mapcache_kml>` superoverlay

source: data provided by WMS backends (GDAL supported sources planned)
fr: données fournies par des services WMS (formats gérés par GDAL prévus)

source: cache types:
fr: types de cache:

source: :ref:`Disk <mapcache_cache_disk>`
fr: :ref:`disque <mapcache_cache_disk>`

source: :ref:`Tiled TIFFs <mapcache_cache_tiff>`
fr: :ref:`TIFFs tuilés <mapcache_cache_tiff>`

source: configurable metatiling
fr: Metatiling configurable

source: on-the-fly tile merging for combining multiple tiles into a single image
fr: fusion de tuiles à la volée pour combiner plusieurs tuiles en une image unique

source: image post-processing (recompression and quantization) when arriving from a backend
fr: post-traitement de l'image (recompression et quantization) quand elle est délivrée par un tiers

source: interprets and produces cache control headers: Last-Modified, If-Modified-Since, Expires
fr: interprète et produits les en-têtes de contrôle de la mise en cache : Last-Modified, If-Modified-Since, Expires

source: multithreaded :ref:`seeding utility <mapcache_seed>` that can seed specific zoom levels or specific areas (e.g. seed levels 0 to 12 of all tiles intersecting Colorado)
fr: :ref:`Utilitaire d'alimentation <mapcache_seed>` multithread, qui peut remplir des niveaux de zoom ou des zones géographiques spécifiques (par exemples les niveaux de zoom 0 à 12 pour toutes les tuiles qui intersectent le Colorado)

source: ability to add a custom watermark on stored tiles
fr: capacité à ajouter un watermark personnalisé aux tuiles stockées

source: produces a CGI/FastCGI executable for use with webservers other than Apache
fr: génère un exécutable CGI/fastCGI pour un usage avec un serveur web autre qu'apache

source: configurable symbolic linking of blank tiles to save disk space
fr: liens symboliques configurables pour les tuiles vierges afin de préserver l'espace disque

source: configurable error reporting: plain HTTP error code, textual message, or empty (blank) image
fr: rapport d'erreur configurable: code HTTP brut, message textuel ou image vide

source: ability to specify vendor parameters or dimensions to be forwarded to the WMS backend (and to build a cache that takes these parameters into account): :ref:`mapcache_dimensions`
fr: capacité à spécifier des paramètres particuliers ou des dimensions devant être transmises au service WMS (et construction d'un cache qui prend ces paramètres en compte): :ref:`mapcache_dimensions`

source: Table of Contents
fr: Table des matières

source: Getting the Source
fr: Obtenir les sources

source: The MapCache project is located at https://github.com/mapserver/mapcache, and can be checked out with either:
fr: Le projet MapCache est situé sur https://github.com/mapserver/mapcache, et peut être récupéré avec soit:

source: Linux Instructions
fr: Instructions Linux

source: These instructions target a Debian/Ubuntu setup, but should apply with few modifications to any Linux installation.
fr: Ces instructions ciblent un mise en place sous Debian/Ubuntu, mais devraient s'appliquer avec quelques modifications à n'importe quelle installation Linux.

source: MapCache requires a number of library headers in order to compile correctly:
fr: MapCache nécessite un certain nombre d'en-têtes de bibliothèques pour pouvoir être compilé correctement:

source: **apache / apr / apr-util / apx2**: these are included in the *apache2-prefork-dev* or *apache2-threaded-dev* packages, depending on which Apache MPM you are running. This package will pull in the necessary APR headers that you would have to manually install if you are not buidling an Apache module (*libaprutil1-dev* and *libapr1-dev*)
fr: **apache / apr / apr-util / apx2**: ceux-ci sont inclus dans les paquets *apache2-prefork-dev* ou *apache2-threaded-dev*, en fonction du MPM (Multi-Processing Module) Apache que vous faites tourner. Ce paquet récupérera les en-têtes APR nécessaires, que vous auriez normalement installé manuellement si vous n'aviez pas compilé un module Apache (*libaprutil1-dev* et *libapr1-dev*)

source: The following libraries are not required, but recommended:
fr: Les bibliothèques suivantes ne sont pas requises mais sont néanmoins recommandées:

source: **pcre**: *libpcre3-dev*. This will give you more powerful regular expression syntax when creating validation expressions for dimensions
fr: **pcre**: *libpcre3-dev*. Ceci vous offrira une syntaxe d'expression régulière plus puissante lors de la création de motifs de validation pour les dimensions

source: **pixman**: *libpixman-1-dev*. The pixel manipulation library is used for scaling and alpha-compositing images. MapCache ships with some code to perform these tasks, but Pixman is generally faster as it includes code optimized for modern CPUs (SSE2, MMX, etc...)
fr: **pixman**: *libpixman-1-dev*. La bibliothèque de manipulation de pixel est utilisée pour la mise à l'échelle et la composition alpha des images. MapCache intègre des portions de code pour réaliser ces tâches, mais Pixman est généralement plus rapide car il possède un code optimisé pour les microprocesseurs modernes (SSE2, MMX etc.)

source: The following libraries are not required, but needed to enable additional functionalities:
fr: Les librairies suivantes ne sont pas indispensables, mais nécessaires pour activer des fonctionnalités additionnelles:

source: **fcgi**: *libfcgi-dev*. Needed to build a FastCGI program if you don't want to run MapCache as an Apache module
fr: **fcgi**: *libfcgi-dev*. Utilisé pour compiler une version FastCGI si vous ne voulez pas utiliser MapCache en module Apache.

source: **gdal / geos**: *libgdal1-dev* *libgeos-dev*. Needed to enable advanced seeding options (for only seeding tiles that intersect a given geographical feature)
fr: **gdal / geos**: *libgdal1-dev* *libgeos-dev*. Nécessaires pour activer les options avancées de génération de cache (pour ne générer que les tuiles qui intersecte un objet géographique donné)

source: **sqlite**: *libsqlite3-dev*. For enabling the SQLite backend storages
fr: **sqlite**: *libsqlite3-dev*. Pour permettre l'utilisation de SQLite pour le stockage des tuiles.

source: **tiff**: *libtiff4-dev*. For enabling the TIFF backend storages
fr: **tiff**: *libtiff4-dev*. Pour permettre l'utilisation de fichiers TIFF pour le stockage des tuiles.

source: **berkeley db** *libdb4.8-dev* : For enabling the Berkeley DB backend storages
fr: **berkeley db** *libdb4.8-dev* : Pour permettre l'utilisation de Berkeley DB pour le stockage des tuiles.

source: MapCache now builds with CMake.
fr: MapCache se compile désormais avec CMake.

source: For Unix users installing all packages to the default locations, the compilation process should continue with:
fr: Pour les utilisateurs UNIX dont tous les paquetages sont dans les emplacements par défaut, la compilation devrait se résumer à:

source: Apache Module Specific Instructions
fr: Instructions spécifiques au module Apache

source: The make install above installs the Apache module, but if you specifically need to install only the Apache module you can do the following:
fr: Le make install ci-dessus installe le module Apache, mais si vous devez spécifiquement n'installer que le module Apache, vous pouvez faire ce qui suit

source: The installation script takes care of putting the built module in the Apache module directory. The process for activating a module is usually distro specific, but can be resumed by the following snippet that should be present in the Apache configuration file ( e.g. /usr/local/httpd/conf/httpd.conf or /etc/apache2/sites-available/default ):
fr: Le script d'installation fait en sorte de déposer le module compilé dans le répertoire apache des modules. Les modalités d'activation des modules sont généralement spécifiques aux distributions utilisées, mais peut se résumer à l'extrait suivant qui devrait être présent dans la configuration Apache ( e.g. /usr/local/httpd/conf/httpd.conf ou /etc/apache2/sites-available/default ):

source: Next, a MapCache configuration is mapped to the server URL with the following snippet:
fr: Ensuite, une configuration mapcache est associée à l'URL du serveur par l'extrait suivant

source: For Apache < 2.4:
fr: Pour Apache < 2.4:

source: For Apache >= 2.4:
fr: Pour Apache >= 2.4:

source: Before you restart, copy the example mapcache.xml file to the location specified in your Apache configuration:
fr: Avant de redémarrer, copiez le fichier d'exemple mapcache.xml à l'emplacement spécifié dans votre configuration Apache:

source: Finally, restart Apache to take the modified configuration into account
fr: Enfin, redémarrer Apache pour activer la nouvelle configuration

source: If you have not disabled the demo service, you should now have access to it on http://myserver/mapcache/demo
fr: Si vous n'avez pas désactivé le service de démonstration, vous devriez pouvoir y accéder à l'adresse http://myserver/mapcache/demo

source: nginx Specific Instructions
fr: Instructions spécifiques Nginx

source: Working with nginx is still somewhat experimental. The following workflow has only been tested on the development version, i.e. nginx-1.1.x
fr: Travailler avec nginx est toujours en quelque sorte expérimental. Le processus suivant a uniquement été testé sur la version de développement, soit nginx-1.1.x

source: For nginx support you need to build MapCache's nginx module against the nginx source. Download the nginx source code:
fr: Pour le support nginx vous devez compiler mapcache avec les sources de nginx. Télécharger le code source de Nginx:

source: Run the configure command with the flag ``--add-module``. This flag must point to MapCache's nginx child directory. Assuming that MapServer source was cloned or un tarred into to ``/usr/local/src``, an example configure command for nginx would look like this:
fr: Lancez la commande de configure avec l'option ``--add-module``. Cette option doit pointer vers le répertoire nginx de mapcache. En partant du principe que les sources de MapServer on été clonées ou décompressées dans ``/usr/local/src``, un exemple d'instruction configure pour nginx ressemblerait à ceci:

source: Then build nginx:
fr: Ensuite compiler nginx:

source: Due to nginx's non-blocking architecture, the MapCache nginx module does not perform any operations that may lead to a worker process being blocked by a long computation (i.e.: requesting a (meta)tile to be rendered if not in the cache, proxying a request to an upstream WMS server, or waiting for a tile to be rendered by another worker): It will instead issue a 404 error. This behavior is essential so as not to occupy all nginx worker threads, thereby preventing it from responding to all other incoming requests. While this isn't an issue for completely seeded tilesets, it implies that these kinds of requests need to be proxied to another MapCache instance that does not suffer from these starvation issues (i.e. either a FastCGI MapCache, or an internal proxied Apache server). In this scenario, both the nginx MapCache instance and the Apache/FastCGI MapCache instance should be running with the same ``mapcache.xml`` configuration file.
fr: Du fait de l'architecture non-bloquante de Nginx, le module nginx de MapCache ne réalise aucune opération qui pourrait déboucher sur un blocage du process en cours par un calcul trop long (i.e : requêter une (meta)tuile absente du cache, proxyfier une requête vers un serveur WMS distant ou attendre qu'une tuile soit rendue par un autre process). Il génère alors une erreur 404. Ce comportement est essentiel pour que tous les process nginx ne soient occupés et ne l'empêchent de répondre à d'autres requêtes. Alors que cela ne pose pas de problème pour les jeux de tuiles complètement générés, ceci implique que ce genre de requêtes doivent être proxyfiées vers une autre instance de MapCache ne souffrant pas de ces problèmes d'alimentation (i.e. soit un MapCache cgi, soit un serveur apache proxyfié). Dans ce scénario, les deux instances nginx et apache/fastcgi de MapCache doivent partager le même fichier de configuration ``mapcache.xml``.

source: MapCache supplies an ``nginx.conf`` in its nginx child directory. The conf contains an example configuration to load MapCache. The most relevant part of the configuration is the location directive that points the ``^/mapcache`` URI to the ``mapcache.xml`` path. You will need to change this path to point to your own ``mapcache.xml`` in the MapCache source.
fr: MapCache fournit un ficheir ``nginx.conf`` dans son sous-répertoire nginx. Ce fichier contient un exemple de configuration pour charger MapCache. La partie la plus importante de la configuration est la directive location qui associe l'URI ``^/mapcache`` au chemin vers ``mapcache.xml``. Vous devrez adapter cette directive afin qu'elle désigne votre propre fichier ``mapcache.xml``

source: The basic configuration without any proxying (which will return 404 errors on unseeded tile requests) is:
fr: La configuration de base sans aucun mandataire (qui renverra des erreurs 404 sur les tuiles inexistantes) est :

source: If proxying unseeded tile requests to a MapCache instance running on an Apache server, we will proxy all 404 MapCache errors to a ``mapcache.apache.tld`` server listening on port 8080, configured to respond to MapCache requests on the ``/mapcache`` location.
fr: Lors de la proxyfication des requêtes sur les tuiles inexistantes vers une instance de MapCache tournant sur un serveur Apache, nous renverrons toutes les erreurs 404 de MapCache vers un serveur ``mapcache.apache.tld`` associé au port 8080, configuré pour répondre aux requêtes sur l'emplacement ``/mapcache``.

source: If using FastCGI instances of MapCache, spawned with e.g. spawn-fcgi or supervisord on port 9001 (make sure to enable FastCGI when building MapCache, and to set the MAPCACHE_CONFIG_FILE environment variable before spawning):
fr: Si vous utilisez des instances FastCGI de MapCache, générées par par exemple spawn-fcgi ou supervisord sur le port 9001 (prenez soin d'activer le support FastCGI lors de la compilation de MapCache et de régler la variable d'environnement MAPCACHE_CONFIG_FILE avant la génération) :

source: Copy the relevant sections of ``nginx.conf`` from MapCache's ``nginx`` directory into nginx's conf file (in this case ``/usr/local/nginx/conf/nginx.conf``). You should now have access to the demo at http://myserver/mapcache/demo
fr: Copier les sections correspondantes de ``nginx.conf`` du répertoire ``nginx`` de MapCache dans le fichier de configuration de Nginx (dans notre cas ``/usr/local/nginx/conf/nginx.conf``). Vous devriez alors avoir accès à la demo à l'URL http://myserver/mapcache/demo

source: CGI/FastCGI Specific Instructions
fr: Instructions spécifiques CGI/FastCGI

source: A binary CGI/FastCGI is located in the mapcache/ subfolder, and is named "mapcache". Activating FastCGI for the MapCache program on your web server is not part of these instructions; more details may be found on the :ref:`FastCGI <fastcgi>` page or on more general pages across the web.
fr: Un binaire cgi/FastCGI est situé dans le sous-répertoire MapCache, et est nommé "mapcache". L'activation du FastCGI pour le programme MapCache sur votre serveur web ne fait pas partie de ces instructions. Plus de détails peuvent être trouvés à la page :ref:`FastCGI <fastcgi>`ou dans ces pages web plus générale sur Internet.

source: The MapCache FastCGI program looks for its configuration file in the environment variable called MAPCACHE_CONFIG_FILE, which must be set by the web server before spawning the MapCache processes.
fr: La programme MapCache FastCGI recherche son fichier de configuration dans la variable d'environnement MAPCACHE_CONFIG_FILE, qui doit donc être paramétrée par le serveur web avant qu'il ne génère des process MapCache.

source: For Apache with mod_cgi:
fr: Pour Apache avec mod_cgi:

source: For Apache with mod_fcgid:
fr: Pour Apache avec mod_fcgid:

source: If you have not disabled the demo service, you should now have access to it on http://myserver/fcgi-bin/mapcache/demo, assuming your fcgi processes are accessed under the fcgi-bin alias.
fr: Si vous n'avez pas désactivé le service de démonstration, vous devriez maintenant pouvoir y accéder à l'URL http://myserver/fcgi-bin/mapcache/demo pour peu que vos process fcgi soient accessibles par l'alias fcgi-bin.
