Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapcache.po
Languages: fr

source: As a single TIFF file may contain many tiles, there is a drastic reduction in the number of files that have to be stored on the filesystem, which solves the major shortcomings of the disk cache. Another advantage is that the same TIFF files can be used by programs or WMS servers that only understand regular GIS raster formats, and be served up with high performance for tile access.
fr: Comme un fichier TIFF unique peut contenir beaucoup de tuiles, il y a une réduction drastique du nombre de fichiers qui doivent être stockés sur le système de fichiers, ce qui résoud les principaux défauts des caches disques. Un autre avantage est que les mêmes fichiers TIFF peuvent être utilisés par des logiciels ou des serveurs WMS qui n'accèdent qu'à des formats SIG raster courants tout en étant utilisés pour un accès tuilé hautes performances.

source: The TIFF cache should be considered read-only for the time being. Write access is already possible but should be considered experimental as there might be some file corruption issues, notably on network filesystems. Note that until all the tiles in a given TIFF file have been seeded/created, the TIFF file is said to be "sparse" in the sense that it is missing a number of JPEG tiles. As such, most non-GDAL based programs will have problems opening these incomplete files.
fr: Le cache TIFF doit être considéré comme étant en lecture-seule pour le moment. L'accès en écriture est déjà possible mais doit être considéré comme expérimental en cela qu'il peut y avoir des problèmes de corruption de fichier, surtout dans le contexte de montages réseaux du système de fichiers. Veuillez noter que jusqu'à ce que toutes les tuiles d'un fichier TIFF donné aient été générées, le fichier TIFF est réputé "clairsemé" au sens qu'il manque des tuiles. La plupart des logiciels autres que GDAL auront des difficultés à ouvrir ces fichiers incomplets.

source: Note that the TIFF tile structure must exactly match the structure of the grid used by the tileset, and the TIFF file names must follow strict naming rules.
fr: Veuillez noter que la structure des tuiles TIFF doit respecter exactement la structure de la grille devant être utilisée par le jeu de tuile, et les noms des fichiers TIFF doivent respecter de strictes conventions de nommage.

source: Defining the TIFF File Sizes
fr: Définition des tailles de fichiers TIFF

source: The number of tiles stored in each of the horizontal and vertical directions must be defined:
fr: Le nombre de tuiles stockées dans chacune des directions horizontales et verticales doit être défini:

source: <xcount> the number of tiles stored along the x (horizontal) direction of the TIFF file
fr: <xcount> le nombre de tuiles stocké le long de la direction x (horizontal) du fichier TIFF

source: <ycount> the number of tiles stored along the y (vertical) direction of the TIFF file
fr: <ycount> le nombre de tuiles stocké le long de la direction y (horizontal) du fichier TIFF

source: Setting Up the File Naming Convention
fr: Configuration de la convention de nommage des fichiers

source: The <template> tag sets the template to use when looking up a TIFF file name given the x,y,z of the requested tile
fr: Le tag <template> détermine le modèle à utiliser lors de la recherche d'un fichier TIFF en fonction des x,y,z de la tuile demandée

source: {x} is replaced by the x value of the leftmost tile inside the TIFF file containing the requested tile.
fr: {x} est remplacé par la valeur x de la tuile la plus à gauche dans le fichier TIFF contenant la tuile demandée.

source: {inv_x} is replaced by the x value of the rightmost tile.
fr: {inv_x} est remplacé par la valeur x de la tuile la plus à droite

source: {y} is replaced by the y value of the bottommost tile.
fr: {y} est remplacé par la valeur y de la tuile la plus en bas

source: {inv_y} is replaced by the y value of the topmost tile.
fr: {inv_y} est remplacé par la valeur y de la tuile la plus en haut

source: {div_x} is replaced by the index of the TIFF file starting from the left of the grid (i.e. {div_x} = {x}/<xcount>).
fr: {div_x} est remplacé par l'index du fichier TIFF commençant à gauche de la grille (i.e. {div_x} = {x}/<xcount>)

source: {inv_div_x} same as {div_x} but starting from the right.
fr: {inv_div_x} comme {div_x} mais en commençant à droite.

source: {div_y} is replaced by the index of the TIFF file starting from the bottom of the grid (i.e. {div_y} = {y}/<ycount>).
fr: {div_y} est remplacé par l'index du fichier TIFF commençant au bas de la grille (i.e. {div_y} = {y}/<ycount>)

source: {inv_div_y} same as {div_y} but starting from the top.
fr: {inv_div_y} est similaire {div_y} mais en commençant par le haut.

source: {inv_x} and {inv_div_x} will probably be rarely used, whereas {inv_y} and {inv_div_y} will find some usage by people who prefer to index their TIFF files from top to bottom rather than bottom to top.
fr: {inv_x} et {inv_div_x} seront probablement rarement utilisés, tandis que {inv_y} et {inv_div_y} trouveront un usage approprié pour les personnes préférant indexer leurs fichiers TIFF de haut en bas plutôt que de bas en haut.

source: Customizing the Template Keys
fr: Personnalisation des clés du "template"

source: In some cases, it may be desirable to have a precise hand on the filename to use for a given x,y,z tile lookup, e.g. to look for a file named "Z03-R00003-C000009.tif" instead of just "Z3-R3-C9.tif". The <template> entry supports formatting attributes, following the Unix printf syntax ( c.f.: http://linux.die.net/man/3/printf ), by suffixing each template key with "_fmt", e.g.:
fr: Dans certains cas, il peut être souhaitable d'avoir un contrôle précis sur le nom du fichier à utiliser pour une tuile x,y,z particulière, par exemple pour retrouver un fichier nommé "Z03-R00003-C000009.tif" plutôt que "Z3-R3-C9.tif". Le paramètre <template> permet d'utiliser des éléments de formatage pour peu qu'ils suivent la syntaxe unix printf ( c.f.: http://linux.die.net/man/3/printf ), en suffixant chacun des éléments <template> avec "_fmt" comme par exemple :

source: Setting JPEG Compression Options
fr: Définition des options de compression JPEG

source: An additional optional parameter defines which JPEG compression should be applied to the tiles when saved into the TIFF file:
fr: Un paramètre optionnel complémentaire définit la compression JPEG à appliquer aux tuiles quand elles sont enregistrées dans le fichier TIFF:

source: <format> the name of the (JPEG) format to use
fr: <format> le nom du format (JPEG) à utiliser

source: In this example, assuming a grid using 256x256 tiles, the files that are read to load the tiles are tiled TIFFs with JPEG compression, whose size are 16384x16384. The number of files to store on disk is thus reduced 4096 times compared to the basic disk cache.
fr: Dans cet exemple, en utilisant une grille de 256x256 tuiles, les fichiers qui sont lus pour charger les tuiles sont des TIFFs tuilés avec une compression JPEG, dont la taille est de 16384x16384. Le nombre de fichiers à stocker sur le disque est ainsi réduit 4096 fois comparativement à un cache disque standard.

source: Using a Specific Locker
fr: Utilisation d'un verrou spécifique

source: MapCache needs to create a :ref:`lock <mapcache_locks>` when writing inside a TIFF file to ensure that no two instances are updating the same file concurrently. By default the global MapCache locker will be used; you can, however, configure a different locking mechanism or behavior by configuring it inside the TIFF cache itself.
fr: MapCache a besoin de créer un :ref:`verrou <mapcache_locks>` pour écrire dans un fichier TIFF afin d'éviter que deux instances ne modifient le même fichier simultanément. Par défaut le verrou global de MapCache est utilisé. Toutefois, il est possible de configurer un mécanisme ou un comportement de verrouillage différent en le configurant à l'intérieur du cache TIFF proprement dit.

source: GeoTIFF Support
fr: Support GeoTIFF

source: If compiled with GeoTIFF and write support, MapCache will add referencing information to the TIFF files it creates, so that the TIFF files can be used in any GeoTIFF-enabled software. Write support does not produce full GeoTIFFs with the definition of the projection used, but only the pixel scale and tie-points, i.e. what is usually found in .tfw files.
fr: S'il est compilé avec le support GeoTIFF en écriture, MapCache ajoutera les informations de référencement aux fichiers TIFF qu'il créé, de sorte que les fichiers TIFF puissent être utilisés par n'importe quel logiciel utilisant du GeoTIFF. Le support en écriture ne produit pas des GeoTIFFs complets avec la définition de la projection utilisée, mais uniquement l'échelle du pixel et les points de calage, ce qu'on trouve généralement dans les fichiers .tfw.

source: For reference, here is the gdalinfo output on a TIFF file created by MapCache when compiled with GeoTIFF support:
fr: Pour référence, voici la sortie produite par gdalinfo sur une fichier TIFF créé par MapCache quand il est compilé avec le support GeoTIFF:

source: REST Caches
fr: Caches REST

source: The following cache types store and retrieve tiles through standard HTTP GET and PUT operations, and can be used to store tiles in popular cloud storage providers.
fr: Les types de caches suivants stockent et récupèrent les tuiles via des opérations HTTP standard GET et PUT. Ils peuvent être utilisés pour stocker les tuiles chez des fournisseurs populaires de stockage "cloud".

source: Pure REST Cache
fr: Cache REST pur

source: This cache type can be used to store tiles to a WebDAV enabled server. You must provide a template URL that should be used when accessing a tile with a given x,y,z, etc...
fr: Ce type de cache peut être utilisé pour stocker des tuiles sur un serveur WebDAV. Il est nécessaire de fournir un schéma d'URL à utiliser pour accéder à une tuile selon ses paramètres x,y,z, etc.

source: Specifying HTTP Headers
fr: Spécification des en-têtes HTTP

source: You can customize which headers get added to the HTTP request, either globally for every HTTP request, or specifically for a given type of request (i.e. when getting, setting or deleting a tile):
fr: Il est possible de personnaliser les en-têtes HTTP à ajouter à une requête HTTP, soit de manière globale, soit spécifiquement pour chaque type de requête (envoyer, récupérer ou supprimer une tuile):

source: Amazon S3 REST Caches
fr: Caches REST Amazon S3

source: The REST cache has been specialized to enable access to Amazon S3, in order to add the layer of authentication/authorization needed for that platform.
fr: Le cache REST a été spécialisé pour permettre l'accès à Amazon S3, afin d'ajouter la couche d'authentification et autorisation nécessaire à cette plateforme.

source: The <id> <secret> and <region> tags are required and are obtained and configured through your Amazon management console. You should read the documentation as to what headers you want to be adding to your requests depending on your use case (the supplied example hosts tiles on cheaper storage, and allows them to be publicly accessible).
fr: Les éléments <id>, <secret> et <region> sont requis. Ils sont obtenus via votre console de gestion Amazon. Vous devez lire la documentation pour déterminer quels en-têtes sont nécessaires selon votre profil d'utilisation (l'exemple fourni héberge des tuiles dans un espace meilleur marché, et permet de les rendre publiquement accessibles).

source: Microsoft Azure REST Caches
fr: Caches REST Microsoft Azure

source: The REST cache has been specialized to enable access to Azure storage, in order to add the layer of authentication/authorization needed for that platform.
fr: Le cache REST a été spécialisé pour permettre l'accès à Azure, afin d'ajouter la couche d'authentification et autorisation nécessaire à cette plateforme.

source: The <id> <secret> and <container> tags are required and are obtained and configured through your management console. You should read the documentation as to what headers you want to be adding to your requests depending on your use case.
fr: Les éléments <id>, <secret> et <container> sont requis. Ils sont obtenus via votre console de gestion. Vous devez lire la documentation pour déterminer quels en-têtes sont nécessaires selon votre profil d'utilisation.

source: The REST cache has been specialized to enable access to Google Cloud Storage, in order to add the layer of authentication/authorization needed for that platform.
fr: Le cache REST a été spécialisé pour permettre l'accès à Google Cloud Storage, afin d'ajouter la couche d'authentification et autorisation nécessaire à cette plateforme.

source: The <access> and <secret> tags are required and are obtained and configured through your management console. You should read the documentation as to what headers you want to be adding to your requests depending on your use case. Note that support for Google Cloud Storage uses its Amazon compatibility layer.
fr: Les éléments <acces> et <secret> sont requis. Ils sont obtenus via votre console de gestion. Vous devez lire la documentation pour déterminer quels en-têtes sont nécessaires selon votre profil d'utilisation. Il est important de noter que le support de Google Cloud Storage passe par sa couche de compatibilité avec Amazon.

source: Meta Caches
fr: Méta-caches

source: These cache types do not store tiles themselves, but rather delegate the storage of a tile to a number of child caches based on a set of rules or behaviors. These caches are mostly useful for large MapCache deployments across multiple instances, with shared cache backends (i.e. dedicated memcache servers, and network mounted filer filesystems).
fr: Ces types de caches ne stockent pas de tuiles mais délèguent cette fonctionnalité à un certain nombre de caches sous-jacents selon un ensemble de règles ou de comportements. Ces caches sont principalement utiles pour des déploiements de MapCache impliquant de multiples instances, avec des back-ends de caches partagés (par exemple serveurs memcache dédiés et systèmes de fichiers en réseau).

source: Composite Caches
fr: Caches composites

source: This cache uses different child caches depending on the tile's zoom level, and can be used for example to store low zoom-level tiles to permanent storage, and higher zoom-level tiles to a temporary (i.e. memcache) cache.
fr: Ce cache utilise différents caches sous-jacents selon le niveau de zoom des tuiles, et peut par exemple être utilisé pour stocker les tuiles des faibles niveaux de zoom dans un stockage permanent et les tuiles des niveaux de zoom plus forts dans un cache temporaire (memcache).

source: For each tile, the caches are tested in the order in which they have been defined in the configuration file, and the first one to satisfy the min/max zoom and grids constraints is used. It's up to the user to make sure the succession of min/max zoom values and grids makes sense, e.g.:
fr: Pour chaque tuile, les caches sont examinés dans leur ordre de définition dans le fichier de configuration, et le premier à satisfaire les contraintes de zoom et de grille est utilisé. À charge pour l'utilisateur de s'assurer que la succession de valeurs de zoom et de grille est pertinente, par exemple:

source: Fallback Caches
fr: Caches de repli

source: These cache types will return tiles from the first configured subcache that does not return an error. They can be used when one of the caches is prone to error conditions (e.g. remote REST caches, memcache)
fr: Ces types de caches renvoient les tuiles depuis le premier sous-cache qui ne retourne pas une erreur. Ils peuvent être utilisés lorsqu'un des caches rencontre des conditions d'erreurs (par exemple des caches REST distants, un memcache).

source: When writing a tile to such a cache, it will be written to all the child caches.
fr: Une écriture dans un tel cache provoque une écriture dans l'ensemble des sous-caches.

source: Multitier Caches
fr: Caches à plusieurs niveaux

source: These cache types can be used to combine fast/expensive caches with slow/cheap ones.
fr: Ces types de caches peuvent être utilisés pour combiner des caches rapides mais coûteux avec des caches bon marché mais lents.

source: If a given tile isn't found in the first child cache, it will be read from the second child cache **and** copied into the first child cache for subsequent accesses. This cache type is meant to be used when the first cache does automatic pruning of the least recently used tiles (i.e. a memcache one).
fr: Si une tuile donnée est absente du premier sous-cache, elle sera lue depuis le deuxième sous-cache **et** copiée dans le premier pour les accès ultérieurs. Ce type de cache est prévu pour être utilisé lorsque le premier cache supprime automatiquement les tuiles les plus anciennes (par exemple un memcache).

source: When writing a tile to such a cache, it will be written to the last child.
fr: Une écriture dans un tel cache provoque une écriture dans le dernier sous-cache.

source: Cache Combinations
fr: Combinaisons de caches

source: All these meta caches can be combined together to fine tune the availability and performance depending on storage costs, time to recreate missing tiles, etc...
fr: Tous ces méta-caches peuvent être combinés pour régler finement la disponibilité et les performances selon les coûts de stockage, le temps de recréation des tuiles manquantes, etc.

source: In the previous example, all tiles are primarily accessed from a memcache instance, however the lower zoom level tiles are backed up to a permanent SQLite cache which will be used to populate the fast memcache cache e.g. on restarts.
fr: Dans l'exemple précédent, toutes les tuiles sont récupérées en premier lieu d'une instance memcache, néanmoins, les tuiles de niveaux de zoom inférieurs sont conservées dans un cache SQLite permanent qui est utilisé pour peupler le cache memcache rapide, par exemple lors d'un redémarrage.

source: Riak Caches
fr: Caches Riak

source: requires https://github.com/trifork/riack
fr: Nécéssite https://github.com/trifork/riack

source: Configuration File
fr: Fichier de configuration

source: The configuration file determines how mod-mapcache will serve incoming requests. It is an XML file comprising a list of entries, as outlined here:
fr: Le fichier de configuration détermine comment mod-mapcache va traiter les requêtes entrantes. C'est un fichier XML qui comprend un certain nombre d'éléments, comme indiqué ici :

source: A source is a service mod-mapcache can query to obtain image data. This is typically a WMS server accessible by a URL. (There are currently only WMS, WMTS and mapfile as sources, though others may be added later if the need arises, see :ref:`mapcache_sources`).
fr: Une source est un service que mod-mapcache peut requérir pour obtenir une image. Il s'agit généralement d'un serveur WMS accessible par une URL (actuellement les seuls types de source disponibles sont WMS, WMTS et mapfile. D'autres pourront être ajoutés ultérieurement en fonction des besoins, voir :ref:`mapcache_sources`).

source: The name and type attributes are straightforward: `type` is "wms", and `name` is the key by which this source will be referenced; `<url>` is the HTTP location where the service can be accessed; and `<wmsparams>` is a list of parameters that will be added to the WMS request. You should probably at the very least add the FORMAT and LAYERS parameters. By convention(?), WMS parameters are uppercase, and you should respect this convention in your configuration file.
fr: Les attributs de nom et de type sont simples: le type est "wms", et `name` est la clé par laquelle la source sera référencée. `<url>` est l'emplacement HTTP où le service peut être accédé. `<wmsparams>` est la liste des paramètres qui seront ajoutés à la requête WMS. Vous devriez probablement au minimum ajouter les paramètres FORMAT et LAYERS. Par convention(?), les paramètres WMS sont en majuscules et vous devriez respecter cette convention dans votre fichier de configuration.

source: This is where you can also override some default WMS parameters if needed. By default, the parameters that will be used are: `<REQUEST>GetMap</REQUEST>` `<SERVICE>WMS</SERVICE>` `<STYLES></STYLES>` `<VERSION>1.1.0</VERSION>`
fr: C'est où vous pouvez aussi écraser quelques paramètres WMS par défaut si nécessaire. Par défaut, les paramètres qui seront utilisés sont: `<REQUEST>GetMap</REQUEST>` `<SERVICE>WMS</SERVICE>` `<STYLES></STYLES>` `<VERSION>1.1.0</VERSION>`

source: A cache is a location where received tiles will be stored.
fr: Un cache est un emplacement où les tuiles reçues seront stockées.

source: A format is an image format that will be used to return tile data to clients, and to store tile data on disk.
fr: Un format est un format image qui sera utilisé pour renvoyer une tuile aux clients, et pour stocker cette tuile sur le disque.

source: Grid
fr: Grille

source: A grid is the matrix that maps tiles onto an area, and consists of a spatial reference, a geographic extent, resolutions, and tile sizes.
fr: Une grille est la matrice faisant correspondre les tuiles sur une zone. Elle consiste en un système de coordonnées, une étendue géographique, des résolutions et des tailles de tuiles.

source: Mandatory Configuration Options
fr: Options de configuration obligatoires

source: **<size>**: The width and height of an individual tile, in pixels. Must be specified as positive integers separated by a space character. The most common tile size is:
fr: **<size>**: la largeur et la hauteur d'une tuile individuelle, en pixels. Doit être indiquée en utilisant des entiers positifs séparés par un espace. La valeur la plus courante est :

source: **<extent>**: The geographical extent covered by the grid, in ground units (e.g. meters, degrees, feet, etc.). Must be specified as 4 floating point numbers separated by spaces, ordered as minx, miny, maxx, maxy.
fr: **<extent>**: L'étendue géographique couverte par la grille, en unités terrain (mètres, degrés, pieds...). Elle doit être spécifiée par 4 nombres décimaux séparés par des espaces, dans l'ordre minx, miny, maxx, maxy.

source: The (minx,miny) point defines the origin of the grid, i.e. the pixel at the bottom left of the bottom-left most tile is always placed on the (minx,miny) geographical point.
fr: Le point (minx, miny) définit l'origine de la grille, c'est-à-dire que le pixel le plus en bas à gauche de la tuile la plus en bas à gauche est toujours positionnée sur le point géographique correspondant à (minx,miny).

source: The (maxx,maxy) point is used to determine how many tiles there are for each zoom level.
fr: Le point (maxx,maxy) est utilisé pour calculer le nombre de tuile pour chaque niveau de zoom.

source: **<srs>**: The projection of the grid, usually given by it EPSG identifier. This value isn't used directly by MapCache to compute reprojections; it is only used to look up which grid to use when receiving WMS requests.
fr: **<srs>**: La projection de la grille, généralement désignée par son code EPSG. La valeur saisie ici n'est pas directement utilisée par MapCache pour calculer des reprojections. Elle sert uniquement à déterminer quelle grille utiliser lors de la réception de requêtes WMS.

source: This is the value that is passed on to the :ref:`source <mapcache_sources>` when requesting a tile that is not already cached for the current grid. You must make sure that the source that is queried is capable of returning image data for this SRS.
fr: C'est la valeur qui est transmise à la :ref:`source <mapcache_sources>` quand la tuile demandée n'est pas déjà présente dans le cache pour la grille correspondante. Vous devez vous assurer que la source indiquée est capable de renvoyer un résultat sous forme d'image pour le SRS utilisé par la grille.
