Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapcache.po
Languages: fr

source: **-c | --config [file]**: path to the mapcache.xml configuration file that contains the tilesets that need to be seeded.
fr: **-c | --config [file]** : chemin vers le fichier de configuration mapcache.xml qui contient les tilesets qui nécessitent d'être générés.

source: **-D | --dimension "DIMENSION=VALUE"**: used to specify which dimension to use if the tileset supports dimensions. Can be used multiple times to set multiple dimensions, e.g. -D "DIM1=VAL1" -D "DIM2=VAL2".
fr: **-D | --dimension "DIMENSION=VALEUR"**: utilisé pour définir quelle dimension utiliser si le tileset gère les dimensions. Peut être utilisé plusieurs fois pour définir plusieurs dimensions, e.g. -D "DIM1=VAL1" -D "DIM2=VAL2".

source: **-e | --extent minx,miny,maxx,maxy**: bounding box of the area to seed.
fr: **-e | --extent minx,miny,maxx,maxy**: boîte englobante de la surface à générer.

source: **-g | --grid [grid]**: name of the grid that must be seeded (the selected tileset must reference the given grid).
fr: **-g | --grid [grid]**: nom de la grille qui doit être remplie (le tileset sélectionné doit référencer la grille donnée).

source: **-i | --iteration-mode**: either "*drill-down*" or "*level-by-level*". Default is to use drill-down for g, WGS84 and GoogleMapsCompatible grids, and level-by-level for others. Use this flag to override.
fr: **-i | --iteration-mode**: soit "*drill-down*" ou "*level-by-level*". drill-down est la valeur par défaut pour les grilles g, WGS84 et GoogleMapsCompatible, et level-by-level pour les autres. Utilisez cette option pour imposer votre valeur.

source: **-q | --quiet**: don't print progress messages to the standard output.
fr: **-q | --quiet** : n'affiche pas les messages de progression vers la sortie standard.

source: **-t | --tileset [tileset]**: name of the tileset that must be seeded.
fr: **-t | --tileset [tileset]**: nom du tileset qui doit rempli.

source: **-v | --verbose**: print verbose debugging info (if compiled in).
fr: **-v | --verbose**: affiche des informations de débugage verbeux (si compilé).

source: **-z | --zoom minzoom,maxzoom**: start and end zoom levels that must be seeded.
fr: **-z | --zoom minzoom,maxzoom**: niveaux de zoom de départ et de fin qui doit être rempli.

source: At compile time, if OGR and GEOS are found on the system, the seeder tool will support additional options to seed only the tiles that cover an arbitrary geographical area. *Important:* Note that, for the time being, the OGR datasource should be in the same projection as the grid you are seeding, as there is no automatic reprojection from the datasource projection to the grid projection.
fr: Si au moment de la compilation OGR et GEOS ont été trouvés sur le système, l'outil d'alimentation autorise des options complémentaires pour ne générer que les tuiles qui recouvrent une aire géographique quelconque. *Important:* Remarquez bien que pour le moment, les sources de données OGR devraient être dans la même projection que la grille utilisée, car il n'y a pas de reprojection automatique de la projection de la source de données vers celle de la grille.

source: Important Note
fr: Note importante

source: The seeding utility must be run under the same user account as the user running the webserver. This is required so the permissions on the tiles created by the seeder are accessible by the webserver, and conversely so the seeder has the rights to write files to directories created by the webserver.
fr: L'utilitaire d'alimentation doit être lancé avec le même compte utilisateur que celui qui fait tourner le serveur web. Cela est nécessaire pour que les permissions sur les tuiles et répertoires créés lors de la pré-génération soit ensuite accessible par le serveur web, et que réciproquement l'utilitaire d'alimentation puisse écrire dans les répertoires créés initialement par le serveur web.

source: A sample seeding session goes like this:
fr: Un session de pré-génération peut ressembler à ceci

source: Examples
fr: Exemples

source: Seed the "osm" tileset with the "g" (Google / Web Mercator) grid: ::
fr: Génère le jeu de tuiles "osm" en utilisant la grille "g" (Google / Web Mercator): ::

source: Seed levels 0 through 12: ::
fr: Niveaux de pré-génération de 0 à 12: ::

source: Given a shapefile that contains the world country contours, seed only the areas that are covered by land (i.e. skip the oceans). Also, use 4 request threads in parallel: ::
fr: A partir d'un shapefile contenant les frontières des pays, ne générer que les zones couvertes par la terre (donc éviter les océans). Utiliser pour cela 4 threads en parallèle: ::

source: Same as beforehand, but only seed the USA (notice the quote usage, required to create valid SQL with a single-quoted 'US': ::
fr: Pareil que précédemment, mais générer uniquement les USA (remarquez l'utilisation des apostrophes, destinées à créer un SQL valide avec un 'US' en apostrophes simples: ::

source: Reseed levels 0 to 12 (this could also be done by deleting the cache for levels 0 to 12 and doing a classic seed, but doing so this way does not slow down access from web clients): ::
fr: Régénérer les niveaux 0 à 12 (cela pourrait aussi être fait en supprimant du cache les niveaux 0 à 12 puis en faisant une pré-génération classique, mais faire ainsi ne ralentit pas les accès faits par les clients web): ::

source: Supported Tile Services
fr: Services de tuilage supportés

source: MapCache has the ability to serve tiles using a variety of different request protocols and tile-naming conventions. This document describes these. The various services must be turned on in the mapcache.xml file for MapCache to respond to these specific requests.
fr: MapCache a la capacité de servir des tuiles en utilisant de nombreux protocoles de requête et de conventions de nommage pour les tuiles. Le but de ce document est de les décrire. Les divers services doivent être activés dans le fichier mapcache.xml afin que MapCache puisse répondre à leurs requêtes spécifiques.

source: All services are available on the demo interface, from which you are highly encouraged to copy/paste the JavaScript code to get started when creating your own pages accessing the MapCache tiles.
fr: Tous les services sont disponibles dans l'interface de démonstration, à partir duquel vous être encouragés à copier/coller le code JavaScript avant de vous lancer dans le codage de vos propres pages utilisant les tuiles MapCache.

source: The following notation is used on this page and refers to object names in the mapcache.xml configuration file.
fr: La notation suivante est utilisée sur cette page et fait référence aux noms des objets dans le fichier de configuration mapcache.xml.

source: <tileset_name> - name of a configured tileset
fr: <tileset_name> - nom d'un jeu de tuiles configuré

source: <grid_name> - name of explicitly or implicitly defined grid
fr: <grid_name> - nom de la grille définie explicitement ou implicitement

source: <quadkey> - specific to the Virtual Earth tile service
fr: <quadkey> - spécifique au service de tuilage Virtual Earth

source: <z> - zoom level in zxy naming scheme
fr: <z> - Niveau de zoom dans le schéma de nommage zxy

source: <y> - row number in zxy naming scheme
fr: <y> - numéro de ligne dans le schéma de nommage zxy

source: <x> - column number in zxy naming scheme
fr: <x> - numéro de colonne dans le schéma de nommage zxy

source: TMS Service
fr: Service TMS

source: The TMS service uses a z/x/y tile naming scheme where:
fr: Le service TMS service utilise un schéma de tuilage de type z/x/y où:

source: *z* is the zoom level
fr: *z* est le niveau de zoom

source: *x* is the column number
fr: *x* est le numéro de colonne

source: *y* is the row number
fr: *y* est le numéro de ligne

source: To activate the TMS service, add these lines to the mapcache.xml configuration file:
fr: Pour activer le service TMS, ajoutez ces lignes au fichier de configuration mapcache.xml:

source: A "capabilities" document can be fetched via:
fr: Un document de "capabilities" peut être récupéré via:

source: Tiles are requested using this scheme:
fr: Les tuiles sont demandées en utilisant le schéma:

source: For EPSG:3857, EPSG:900913, or GoogleMapsCompatible grids, with cell = [z/x/y]:
fr: Pour les grilles epsg:3857 ou epsg:900913 ou GoogleMapsCompatible, avec cellules = [z/x/y]:

source: For EPSG:4326 or WGS84 grids:
fr: Pour les grilles epsg:4326 ou WGS84:

source: The OGC WMTS specification rather absurdly requires the GoogleCRS84Quad WellKnownScaleset to have a level 0 whose extent is -180,-180,180,180. The default "WGS84" MapCache grid honors this, which may cause some incompatibilities with software that expects level 0 to be 2x1 tiles with extent -180,-90,180,90
fr: La spécification OGC WMTS impose de manière un peu absurde au WellKnownScaleset GoogleCRS84Quad d'avoir un niveau 0 dont l'étendue géographiques est -180,-180,180,180. La grille MapCache par défaut "WGS84" respecte cela, ce qui peut provoquer des incompatibilités avec les logiciels qui s'attendent à ce qu'au niveau 0 on ait 2 x 1 tuiles avec pour étendue -180,-90,180,90

source: KML Service
fr: Service KML

source: The KML service produces `Super-Overlays <http://code.google.com/apis/kml/documentation/kml_21tutorial.html#superoverlays>`__ for tilesets that are aligned to the WGS84 / EPSG:4326 grids. A Super-Overlay is a KML file that links to an image URL, and to a set of other KML URLs corresponding to neighboring resolutions. The KML service uses a z/x/y tile naming scheme where:
fr: Le service KML produit des '`Super-Overlays <http://code.google.com/apis/kml/documentation/kml_21tutorial.html#superoverlays>`__ pour les jeux de tuiles qui sont alignés sur les grilles WGS84 / epsg:4326. Un Super-Overlay est un fichier KML liée à l'URL d'une image du cache et à un ensemble d'autres URLs correspondant aux résolutions voisines. Le service KML utilise un modèle de nommage de tuiles z/x/y où:

source: For the KML service to be functional, the TMS service must also be activated, as the KML super-overlays link to images using this spec.
fr: Pour que le service KML soit opérationnel, le service TMS doit aussi être activé car le KML Super-Overlay fait un lien vers les images en utilisant cette spécification.

source: To activate the KML service, add these lines to the mapcache.xml configuration file:
fr: Pour activer le service KML, ajoutez ces lignes au fichier de configuration mapcache.xml:

source: OGC WMTS Service
fr: Service WMTS OGC

source: To activate the WMTS service, add these lines to the mapcache.xml configuration file:
fr: Pour activer le service WMTS, ajoutez ces lignes au fichier de configuration mapcache.xml:

source: This service follows the standard OGC WMTS requests and supports both the classical OGC-style key-value-pair encoded and REST-style requests.
fr: Ce service respecte les requêtes du standard OGC WMTS et accepte à la fois les requêtes classiques OGC en mode KVP et les requêtes de type REST.

source: The capabilities are obtained through:
fr: Les "capabilities" sont obtenues via:

source: OGC WMS Service
fr: Service WMS OGC

source: MapCache responds to WMS version 1.1.1 requests, and has limited support for version 1.3.0 ones.
fr: MapCache répond aux requêtes WMS version 1.1.1, et a un support limité pour celles en version 1.3.0.

source: Note that the WMS service is a little different than the other MapCache services, as it listens on the root of the configured instance instead of on an additional endpoint (i.e. the service replies on http://server/mapcache/? and not on http://server/mapcache/wms?). This behavior is required in order to enable :ref:`proxying of unsupported requests <mapcache_proxying>` while offering a single endpoint for all OGC services.
fr: Notez que le service WMS est un petit peu différent des autres services MapCache, car il écoute à la racine de l'instance configurée plutôt que sur un emplacement dédié (en fait le service répond sur http://server/mapcache/? et non sur http://server/mapcache/wms?). Ce comportement est rendu nécessaire pour permettre la :ref:`proxyfication des requêtes non prises en charge <mapcache_proxying>` tout en offrant un point d'entrée unique à tous les services OGC.

source: MapCache primarily supports version 1.1.1 WMS requests, but has limited support for the newer version 1.3.0 ones. For 1.3.0 requests, MapCache will determine which :ref:`grid <mapcache_grids>` to use by using the CRS= parameter instead of the SRS= one, and will correctly honor axis ordering for the EPSG reference systems that switch the usual x/y ordering of the BBOX parameter.
fr: MapCache supporte principalement les requêtes WMS 1.1.1 mais a un support limité de la récente version 1.3.0. Pour les requêtes 1.3.0, MapCache choisira la :ref:`grille <mapcache_grids>` à utiliser en lisant le paramètre CRS plutôt que SRS, et respectera l'ordre des axes de coordonnées pour les systèmes epsg qui inverse l'ordre x/y habituel du paramètre BBOX.

source: WMS requests follow the classical key-value-pair encoded style:
fr: Les requêtes WMS suivent le style d'encodage classique clé-valeur (Key Value Pair):

source: The capabilities document is returned by:
fr: Le document de "capabilities" est retourné par:

source: GoogleMaps XYZ Service
fr: Service XYZ GoogleMaps

source: Prerequisites: Your WMS should be capable of producing images in the EPSG:900913 or EPSG:3857 SRS, i.e. it should reference the "g" or "GoogleMapsCompatible" grid.
fr: Prérequis: votre WMS doit être capable de produire des images dans le SRS EPSG:900913 ou EPSG:3857 SRS, c'est à dire qu'il devrait référencer la grille "g" ou "GoogleMapsCompatible"

source: This is the minimal HTML page that should get you going. The important bits are in the urlTemplate (for V2) and getTileURL (for V3) variables:
fr: Voici la page HTML minimale qui devrait vous permettre d'avancer. Les parties importantes sont dans les variables urlTemplate (pour v2) et getTileURL (pour v3).

source: /mapcache is the Apache path where MapCache handles requests.
fr: /mapcache est le chemin apache où MapCache gère les requêtes

source: test@g is the tileset and grid name to use, joined by a '@' - the {Z}/{X}/{Y} should be left alone.
fr: test@g est le jeu de tuiles et la grille à utiliser, joints par un '@' - le {Z}/{X}/{Y} devrait être laissé de côté

source: The final extension should be changed to "jpg" if you are using a JPEG format with your tileset.
fr: l'extension finale devrait être changée en "jpg" si vous utilisez le format JPEG pour votre jeu de tuiles.

source: V2 API
fr: API V2

source: V3 API
fr: API V3

source: The previous JavaScript for the V2 example should be slightly changed to:
fr: Le JavaScript pour l'exemple précédent en V2 devrait être légèrement modifié ainsi:

source: Virtual Earth tile service
fr: Service de tuilage Virtual Earth

source: Tiles are organized in one of two different layouts depending on whether they are using a Spherical Mercator projection, like EPSG:3857 or EPSG:900913, or if they are using a geographical projection, like EPSG:4326.
fr: Les tuiles sont organisées en un ou deux modèles différents selon qu'elles utilisent un projet Mercator Sphérique, comme EPSG:3857 ou EPSG:900913, or si elles utilisent une projection géographiques comme EPSG:4326.

source: For EPSG:3857, EPSG:900913, or GoogleMapsCompatible grids, <quadkey> are arranged:
fr: Pour les grilles EPSG:3857 ou EPSG:900913 ou GoogleMapsCompatible, <quadkey> sont arrangés ainsi:

source: For EPSG:4326 or WGS84 grids, <quadkey> are arranged:
fr: Pour les grilles EPSG:4326 ou WGS84, <quadkey> sont arrangés ainsi:

source: Data Sources
fr: Sources de données

source: MapCache uses the concept of a "source" as a service that is able to return image data given a set of parameters (namely an extent, an image size, and a projection). Typically, a source is the third-party WMS server that you want to put a tile cache in front of.
fr: MapCache utilise le concept de "source" pour un service capable de renvoyer des données image à partir d'un jeu de paramètres (principalement une étendue géographique, une taille d'image et une projection). Une source est donc un serveur WMS distant que vous voulez mettre en cache.

source: WMS Sources
fr: Sources WMS

source: MapFile Sources
fr: Sources MapFile

source: Tile Assembling
fr: Assemblage de tuiles
