Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapcache.po
Languages: fr

source: Cache Types
fr: Types de cache

source: This document details the different cache backends that can be used to store tiles.
fr: Ce document détaille les différents backends pour le cache qui peuvent être utilisés pour stocker des tuiles.

source: Disk Caches
fr: Caches disque

source: The disk based cache is the simplest cache to configure, and the one with the the fastest access to existing tiles. It is ideal for small tile repositories, but will often cause trouble for sites hosting millions of tiles, as the number of files or directories may rapidly overcome the capabilities of the underlying filesystem. Additionally, the block size chosen for the filesystem must closely match the mean size of a stored tile: ideally, any given tile should just fit inside a filesystem block, so as not to waste storage space inside each block, and not have to use up multiple blocks per tile.
fr: Le cache basé sur le stockage disque est le plus simple à configurer parmi les types de cache, et celui avec l'accès le plus rapide aux tuiles existantes. Il est idéal pour les petits dépôts de tuiles, mais peut souvent causer des problèmes pour les sites qui hébergent des millions de tuiles, comme le nombre de fichiers ou répertoire est susceptible de dépasser les capacités du système de fichier sous-jacent. En plus, la taille des blocs de fichiers choisis pour le système de fichiers doit correspondre le plus possible à la taille moyenne d'une tuile stockée: idéalement, n'importe quelle tuile devrait juste contenir dans un bloc de système de fichiers, afin de ne pas gaspiller de l'espace de stockage dans chaque bloc et ne pas utiliser plusieurs blocs par tuile.

source: The location of the files/directories has to be readable and writable by the user running the tile server.
fr: L'emplacement des répertoires/fichiers doit être en lecture/écriture pour l'utilisateur qui fait fonctionner le serveur de tuiles.

source: Common Configuration
fr: Configuration commune

source: Disk caches are added via
fr: Les caches disques sont ajoutés via

source: All caches except the "template" one support the <symlink_blank/> option which (depending on platform availability) will detect tiles of uniform color and create a symbolic link to a single uniform color tile instead of storing the actual blank data in the tile's file.
fr: Tous les caches sauf le "template" supportent l'option <symlink_blank/> qui (selon sa disponibilité sur la plateforme) détecte les tuiles monochromes et crée un lien symbolique vers une tuile unique de la même couleur au lieu de stocker les données monochromes dans le fichier de tuile.

source: All caches support the <creation_retry> option, which specifies the number of times MapCache should retry if it failed to create a tile's file or symlink. The default is to fail immediately: You may want to set this to a positive value if using a network mounted filesystem where transient errors are common.
fr: Tous les caches supportent l'option <creation_retry>, qui spécifie combien de fois MapCache doit réessayer de créer un fichier de tuile ou un lien symbolique lorsque la première tentative échoue. Par défaut MapCache abandonne immédiatement: Une valeur supérieure à 0 peut être judicieuse lorsqu'un système de fichiers réseau est utilisé et que les erreurs temporaires sont fréquentes.

source: Default Structure
fr: Structure par défaut

source: The default disk cache stores tiles in a structure nearly identical to the file/directory hierarchy used by TileCache. The only change is that a top level directory structure corresponding to the name of the grid and the eventual value of the tileset's dimensions is added.
fr: Le système de stockage de tuiles par défaut stocke les tuiles dans une structure pratiquement identique à la hiérarchie de fichiers/répertoires utilisée par TileCache (une solution plus ancienne de mise en cache). Le seul changement est que la structure de répertoire de niveau le plus élevé correspondant au nom de la grille est ajouté (comme MapCache supporte de multiples grilles par jeux de tuiles)

source: This cache is capable of detecting blank (i.e. uniform color) tiles and using a symbolic link to a single blank tile to gain disk space.
fr: Ce cache est capable de détecter les tuiles "blanches" (c'est à dire avec une couleur uniforme) et d'utiliser un lien symbolique vers une seule tuile "blanche"pour gagner de l'espace disque.

source: The only two configuration keys are the root directory where the tiles will be stored, and a key to activate the symbolic linking of blank tiles.
fr: Les deux seules clés dans la configuration sont le répertoire racine où les tuiles seront stockées, et la clé pour activer la mise en lien symbolique des tuiles vides.

source: Arcgis Compatible Structure
fr: Structure compatible Arcgis

source: This layout creates a tile structure compatible with an arcgis exploded cache. Tiles will be stored in files that resemble `/tmp/{tileset}/{grid}/{dimension}/L{z}/R{y}/C{x}.{ext}`
fr: Cette disposition crée une structure de tuiles compatible avec un cache arcgis éclaté. Les tuiles sont stockées dans des fichiers dont le chemin suit le schéma `/tmp/{tileset}/{grid}/{dimension}/L{z}/R{y}/C{x}.{ext}`

source: Worldwind Compatible Structure
fr: Structure compatible Worldwind

source: This layout creates a tile structure compatible with a worldwind cache. Tiles will be stored in files that resemble `/tmp/{tileset}/{grid}/{dimension}/{z}/{y}/{y}_{x}.ext`
fr: Cette disposition crée une structure de tuiles compatible avec un cache Worldwind. Les tuiles sont stockées dans des fichiers dont le chemin suit le schéma `/tmp/{tileset}/{grid}/{dimension}/{z}/{y}/{y}_{x}.ext`

source: Template Structure
fr: Structure de "template"

source: The template based disk cache allows you to create (or reuse an existing) tile structure that you define in advance. The <template> parameter takes a string argument where various template entries will be replaced at runtime by the correct value for each tile to store.
fr: Le modèle basé sur le cache disque vous permet de créer (ou réutiliser) une structure de tuiles (existante) que vous avez défini à l'avance. Le paramètre <template> prend une chaîne en argument où les différentes entrées du modèle seront remplacées à l'exécution par la valeur correcte pour chacune des tuiles à stocker.

source: Berkeley DB Caches
fr: Caches Berkeley DB

source: The Berkeley DB cache backend stores tiles in a key-value flat-file database, and therefore does not have the disadvantages of disk caches with regards to the number of files stored on the filesystem. As the image blobs are stored contiguously, the block size chosen for the filesystem has no influence on the storage capacity of the volume.
fr: Le cache du backend Berkeley DB stocke les tuiles dans une base de données clé-valeur à plat et donc n'a pas les désavantages des caches disques au regard du nombre de fichiers de tuiles stockées sur le système de fichiers. Comme les "blobs" d'images sont stockés de manière contiguë, la taille du bloc choisi pour le système de fichiers n'a pas d'influence sur la capacité de stockage du volume.

source: Note that for a given bdb cache, only a single database file is created, which will store the tiles of its associated tilesets (i.e. there is not a database file created per tileset, grid, and/or dimension). If you need to store different tilesets to different files, then use multiple dbd cache entries. It is not possible to use multiple database files for tileset grids or dimensions.
fr: Notez que pour un cache Berkeley DB donné, seul un seul fichier de base de données est créé, qui stockera les tuiles des jeux de tuiles associés (c'est à dire qu'il n'y a pas de fichier de base de données créé par jeu de tuiles, grilles, et/ou dimensions). Si vous avez besoin de stocker différents jeux de donnés dans différents fichiers, alors utilisez de multiples entrées dans le cache Berkeley DB. Il n'est pas possible d'utiliser de multiples fichiers de base de données pour des grilles de jeux de tuiles ou des dimensions.

source: The Berkeley DB based caches are a bit faster than the disk based caches during reads, but may be a bit slower during concurrent writes if a high number of threads all try to insert new tiles concurrently.
fr: Les caches basés sur Berkeley DB sont un peu plus rapides que les caches basés sur le stockage disque mais sont un peu plus lents pour les écritures concurrentes si de nombreux threads essayent tous d'insérer des tuiles de manière concurrente.

source: SQLite Caches
fr: Caches SQLite

source: There are two different SQLite caches that vary by the database schema they create and query. SQLite caches have the advantage that they store tiles as blobs inside a single database file, and therefore do not have the disadvantages of disk caches with regards to the number of files stored. As the image blobs are stored contiguously, the block size chosen for the filesystem has no influence on the storage capacity of the volume.
fr: Il y a deux caches SQLite différents qui varient par le schéma de la base de données qu'ils créent et interrogent. Les caches SQLite ont l'avantage de stocker les tuiles dans des "blobs" dans un seul fichier de base de données et donc ils n'ont pas les désavantages des caches disques au regard du nombre de fichiers de tuiles stockées. Comme les "blobs" d'images sont stockés de manière contiguë, la taille du bloc choisi pour le système de fichiers n'a pas d'influence sur la capacité de stockage du volume.

source: The SQLite based caches are a bit slower than the disk based caches, and may have write-locking issues at seed time if a high number of threads all try to insert new tiles concurrently.
fr: Les caches SQLite sont un peu plus lents que les caches disques, et peuvent avoir des problèmes de blocage en écriture au moment du remplissage si un nombre élevé de threads essaient tous d'insérer de nouvelles tuiles en même temps.

source: Default Schema
fr: Schéma par défaut

source: Tiles are stored in the configured SQLite file created by MapCache with
fr: Les tuiles sont stockées dans le fichier SQLite configuré créé par MapCache avec

source: You may also add custom SQLite pragmas that will be executed when first connecting to a SQLite db, e.g. to override some compiled-in SQLite defaults
fr: Vous pouvez également ajouter des commandes pragmas SQLite personnalisées qui seront exécutées lors de la première connexion à la base de données, de façon à modifier les réglages SQlite par défaut

source: <pragma> entries will result in a call to
fr: Les entrées <pragma> résulteront en un appel à

source: Custom Schema
fr: Schéma personnalisé

source: This cache can use any database schema: It is up to you to supply the SQL that will be exectuted to select or insert a new tile.
fr: Ce cache peut utiliser n'importe quel schéma de base de données. C'est à vous de fournir le SQL qui sera utilisé pour sélectionner ou insérer une nouvelle tuile.

source: In order to use such functionality you should supply the SQL queries that will be used against your custom schema. It is up to you to make sure your queries are correct and will return the correct data for a given tileset, dimension, grid, x, y and z.
fr: Afin d'utiliser cette fonctinnalité, vous devez fournir les requêtes SQL que MapCache utilisera sur votre schéma personnalisé. Il est de votre responsabilité de vous assurer que les requêtes sont correctes et renvoient les bonnes données pour un jeu de tuiles, une dimension une grille et des coordonnées x, y et z donnés.

source: Note that for the <get> query that returns data for a given tile, the first returned argument is considered to be the image blob, and the second optional one a timestamp representing the creation timestamp for that tile.
fr: Il est important de noter que dans le cas de la requête <get> qui renvoie les données relatives à une tuile, le premier argument renvoyé est le "blob" d'image et le deuxième argument, optionnel, est la date de création de la tuile.

source: Blank Tile Detection
fr: Détection de tuile vide

source: MapCache's SQLite caches support the detection and storage of blank (i.e. uniform color) tiles, and will store a quadruplet of the rgba color component in the data blob instead of the compressed image data itself. That quadruplet will be transformed on-the-fly to a 1-bit palleted PNG before being returned to the client.
fr: Les caches SQLites de MapCache supportent la détection et le stockage des tuiles vides (c'est-à-dire monochromes), et stockent dans le "blob" d'image les quatre octets de la composante RGBA de la couleur. Sur requête d'un client, ces quatre octets sont alors convertis à la volée en une image d'un pixel au format PNG à couleurs indexées.

source: SQLite files created with this option will only be fully understood by MapCache as each tile blob may contain a #rgba quadruplet instead of the expected PNG or JPEG data.
fr: Les fichiers SQLite créés avec cette option ne pourront être pleinenemt exploités que par MapCache, puisque les "blobs" images des tuiles sont susceptibles de contenir un quadruplet #RGBA au lieu de données PNG ou JPEG.

source: Using Multiple SQLite Database Files
fr: Utilisation de fichiers SQLite multiples

source: You may want to split an SQLite cache into multiple files, for organisational purposes, or to keep the size of each file to a reasonable limit if caching large amounts of data.
fr: Il est possible de découper un cache SQLite en plusieurs fichiers, pour des besoins d'organisation ou pour conserver des fichiers de taille raisonnable lorsque de gros volumes de données sont à cacher.

source: In order to do so you may use a template to determine which file should be used for a given file:
fr: Pour ce faire, il est possible d'utiliser un schéma de nommage pour déterminer quel fichier utiliser pour une tuile donnée:

source: You may also limit the x and y number of tiles to be stored inside a single database file:
fr: Il est également possible de limiter le nombre de tuiles en x et en y à stocker dans un fichier SQLite:

source: In this case you **should** include the {x}, {y} and {z} replacements in the template determining the file to use. In the previous example, tile (z,x,y)=(15,3024,1534) would be stored in a file named /path/to/g/mytileset/15/3000-1000.sqlite3 and tile (5,2,8) would be stored in a file named /path/to/g/mytileset/5/0-0.sqlite3
fr: Dans ce cas, vous **devez** inclure les variables de remplacement {x}, {y} et {z} dans le schéma de nommage qui détermine le fichier à utiliser. Dans l'exemple précédent, la tuile (z,x,y)=(15,3024,1534) est stockée dans un fichier nommé /path/to/g/mytileset/15/3000-1000.sqlite3 et la tuile (5,2,8) est stockée dans un fichier nommé /path/to/g/mytileset/5/0-0.sqlite3

source: The following template keys are available for operating on the given tile's x,y, and z:
fr: Les paramètres suivants sont disponibles pour manipuler les x,y et z d'une tuile donnée:

source: `{z}` is replaced by the zoom level.
fr: `{z}` est remplacé par le niveau de zoom.

source: `{x}` is replaced by the x value of the leftmost tile inside the SQLite file containing the requested tile.
fr: `{x}` est remplacé par l'abscisse de la tuile la plus à gauche dans le fichier SQLite qui contient la tuile demandée.

source: `{inv_x}` is replaced by the x value of the rightmost tile.
fr: `{inv_x}` est remplacé par l'abscisse de la tuile la plus à droite.

source: `{y}` is replaced by the y value of the bottommost tile.
fr: `{y}` est remplacé par l'ordonnée de la tuile la plus en bas.

source: `{inv_y}` is replaced by the y value of the topmost tile.
fr: `{inv_y}` est remplacé par l'ordonnée de la tuile la plus en haut.

source: `{div_x}` is replaced by the index of the SQLite file starting from the left of the grid (i.e. `{div_x} = {x}/<xcount>`).
fr: `{div_x}` est remplacé par l'indice du fichier SQLite en partant de la gauche de la grille (càd. `{div_x} = {x}/<xcount>`).

source: `{inv_div_x}` same as {div_x} but starting from the right.
fr: `{inv_div_x}` est semblable à `{div_x}` mais en partant de la droite.

source: `{div_y}` is replaced by the index of the SQLite file starting from the bottom of the grid (i.e. `{div_y} = {y}/<ycount>`).
fr: `{div_y}` est remplacé par l'indice du fichier SQLite en partant du bas de la grille (càd. `{div_y} = {y}/<ycount>`).

source: `{inv_div_y}` same as `{div_y}` but starting from the top.
fr: `{inv_div_y}` est semblable à `{div_y}` mais en partant du haut.

source: {inv_x} and {inv_div_x} will probably be rarely used, whereas {inv_y} and {inv_div_y} will find some usage by people who prefer to index their dbfiles files from top to bottom rather than bottom to top.
fr: `{inv_x}` et `{inv_div_x}` seront probablement rarement utilisés, tandis que `{inv_y}` et `{inv_div_y}` peuvent trouver une utilité pour les personnes qui préfèrent numéroter leurs fichiers SQLite de haut en bas plutôt que de bas en haut.

source: In some cases, it may be desirable to have a precise hand on the filename to use for a given x,y,z tile lookup, e.g. to look for a file named `Z03-R00003-C000009.sqlite3` instead of just `Z3-R3-C9.sqlite3`. The <dbfile> entry supports formatting attributes, following the Unix printf syntax ( c.f.: http://linux.die.net/man/3/printf ), by suffixing each template key with "_fmt", e.g.:
fr: Dans certains cas il peut être souhaitable de maîtriser précisément le nom du fichier à utiliser pour une recherche d'une tuile x,y,z, par exemple un fichier nommé `Z03-R00003-C000009.sqlite3` plutôt que simplement `Z3-R3-C9.sqlite3`. l'élément <dbfile> supporte des attributs de format dont la syntaxe est calquée sur le ``printf()`` Unix (voir: http://linux.die.net/man/3/printf ). Ces attributs sont nommés d'après la variable de substitution correspondante en ajoutant le suffixe "_fmt", par exemple:

source: If not specified, the default behavior is to use "%d" for formatting.
fr: Sans indication, le fonctionnement par défaut utilise "%d" pour le formatage.

source: MBTiles Caches
fr: Caches MBTiles

source: This cache type is a shortcut to the previous custom schema SQLite cache, with pre-populated SQL queries that correspond to the MBTiles specification.
fr: Ce type de cache est un raccourci du schéma de cache SQLite personnalisée ci-dessus, avec des requêtes SQL pré-remplies correspondant aux spécifications MBTiles.

source: Although the default MBTiles schema is very simple, MapCache uses the same multi- table schema found in most downloadable MBTiles files, notably to enable storing blank (i.e. uniform) tiles without duplicating the encoded image data (in the same way the disk cache supports tile symlinking).
fr: Bien que le schéma MBTiles par défaut soit très simple, MapCache utilise le même schéma multi-tables que l'on retrouve dans la plupart des fichiers MBTiles téléchargeables, principalement afin de permettre le stockage des tuiles vides (monochromes) sans avoir à dupliquer les données (de la même manière que le cache disque utilise des liens symboliques vers un fichier unique).

source: The MBTiles schema is created with:
fr: Le schéma MBTiles est créé avec:

source: Contrarily to the standard SQLite MapCache schema, the MBTiles db file only supports a single tileset per cache. The behavior if multiple tilesets are associated to the same MBTiles cache is undefined, and will definitely produce incorrect results.
fr: Contrairement au schéma standard SQLite de MapCache, le fichier MBTiles n'accepte qu'un jeu de tuiles par cache. Le comportement si plusieurs jeux de tuiles sont associées au même cache n'est pas défini, et produira certainement des résultats incorrects.

source: When working with multiple processes (-p switch) and SQLite cache backends, some errors may appear under high concurrency when writing to the SQLite database (error: SQL logic error or missing database (1)). Upgrading to SQLite >= 3.7.15 seems to resolve this issue.
fr: Lorsqu'on travaille avec plusieurs processus (option -p) et caches SQLites, des erreurs sont susceptibles d'apparaître en situation de forte concurrence lors d'écritures dans la base SQLite (erreur: SQL logic error or missing database (1)). Une mise à niveau de SQLite en version supérieure ou égale à 3.7.15 semble résoudre le problème.

source: Memcache Caches
fr: Caches Memcache

source: This cache type stores tiles to an external memcached server running on the local machine or accessible on the network. This cache type has the advantage that memcached takes care of expiring tiles, so the size of the cache will never exceed what has been configured in the memcache instance.
fr: Ce type de cache stocke les tuiles au sein d'un serveur memcached externe, fonctionnant soit sur la machine elle-même soit accessible via le réseau. Ce type de cache a l'avantage de bien gérer l'expiration des tuiles, de sorte que la taille du cache ne dépassera jamais ce qui a été configuré dans l'instance memcache.

source: Memcache support requires a rather recent version of the apr-util library. Note that under very high loads (usually only attainable on synthetic benchmarks on localhost), the memcache implementation of apr-util may fail and start dropping connections for some intervals of time before coming back online afterwards.
fr: L'utilisation de Memcache nécessite une version plutôt récente de la librairie apr-util. Veuillez noter que sous de très fortes charges (généralement uniquement atteignable via des outils de benchmarking en localhost), l'implémentation memcache d'apr-util peut tomber et se mettre à abandonner les connexions pendant quelques intervalles de temps avant de revenir à la normale.

source: You can add multiple <server> entries.
fr: Vous pouvez ajouter de multiple entrées <server>.

source: Tiles stored in memcache backends are configured to expire in 1 day by default. This can be overridden at the tileset level with the <auto_expire> keyword.
fr: Les tuiles stockées au travers de memcache sont configurées pour expirer au bout d'une journée par défaut. Ce réglage peut être modifié au niveau du jeu de données en utilisant le mot-clé <auto_expire>.

source: To limit the memory used by blank tiles inside the memcache instance, you may enable blank tile detection, in which case a `#rgba` quadruplet will be stored to the cache instead of the actual image data. MapCache will convert that on-the-fly to a 1-bit palleted PNG image before returning it to the client.
fr: Afin de réduire la mémoire utilisée par les tuiles vide dans l'instance memcache, vous pouvez activer la détection des tuiles vides, auquel cas un quadruplet `#RGBA` est stocké dans le cache en lieu et place des véritables données d'image. Sur requête d'un client, ces quatre octets sont alors convertis à la volée en une image d'un pixel au format PNG à couleurs indexées.

source: (Geo)TIFF Caches
fr: Caches (Geo)TIFF

source: TIFF caches are the most recent addition to the family of caches, and use the internal tile structure of the TIFF specification to access tile data. Tiles can be stored in JPEG only (TIFF does not support PNG tiles).
fr: Les caches TIFF sont le plus récent ajout à la famille des caches. Ils utilisent la structure interne tuilée de la spécification TIFF pour accéder aux données tuilées. Les tuiles ne peuvent être stockées qu'en JPEG (TIFF n'implémente pas le format PNG).
