Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapfile.po
Languages: fr

source: Referencing an attribute is done by enclosing the attribute name in square brackets, like this: [ATTRIBUTENAME]. Then, every occurrence of "[ATTRIBUTENAME]" will be replaced by the actual value of the attribute "ATTRIBUTENAME".
fr: Référencer un attribut se fait en trourant le nom de l'attribut entre crochets, comme ceci : [ATTRIBUTENAME]. Ensuite, chaque occurrence de "[NOMATTRIBUT]" sera remplacée par la valeur actuelle de l'attribut "NOMATTRIBUT".

source: Example: The data set of our layer has the attribute "BUILDING_NAME". We want the value of this attribute to appear inside a string. This can be accomplished as follows (single or double qoutes):
fr: Exemple : le jeu de données de notre couche a l'attribut "BUILDING_NAME". Nous voulons que la valeur de cet attribut apparaisse dans une chaîne. Cela peut être réalisé comme suivant (guillemets simples ou doubles):

source: For the building which has its BUILDING_NAME attribute set to "Historical Museum", the resulting string is:
fr: Pour la bâtiment qui a son attribut BUILDING_NAME défini à "Historical Museum", la chaîne résultante est :

source: For :ref:`RASTER` layers special attributes have been defined that can be used for classification, for example:
fr: Pour les couches :ref:`RASTER`, des attributs spéciaux ont été définis pour être utiliser pour de la classification, par exemple :

source: [PIXEL] ... will become the pixel value as number
fr: [PIXEL] ... va devenir la valeur du pixel sous forme d'un nombre

source: [RED], [GREEN], [BLUE] ... will become the color value for the red, green and blue component in the pixel value, respectively.
fr: [RED], [GREEN], [BLUE] ... deviendront, respectivement, les valeur des couleurs pour la composante rouge (red), verte (green) et bleue (blue) de la valeur du pixel.

source: Character encoding
fr: Encodage des caractères

source: With Mapserver there is no way to specify the character encoding of the mapfile or the layer data sources, so Mapserver can't do the character encoding translation. If the character encoding of the data source is not the same as the character encoding of the map file, they could be converted to a common encoding.
fr: Avec Mapserver, il n'est pas possible de spécifier l'encodage de caractères du mapfile ou de la source de données de la couche, ainsi Mapserver ne peut pas faire une changement d'encodage. Si l'encodage des caractères de la source de données n'est pas le même que celui du mapfile, alors il peut être converti dans un encodage commun.

source: Expression Types
fr: Types d'expression

source: Expression are used to match attribute values with certain logical checks. There are three different types of expressions you can use with MapServer:
fr: Les expressions sont utilisées pour faire correspondre les valeurs d'attributs avec certaines vérifications logiques. Il y a troistypes différents d'expression que vous pouvez utiliser avec MapServer

source: String comparisons: A single attribute is compared with a string value.
fr: Comparaisons de chaînes: un attribut simple est comparé avec une valeur de chaîne.

source: Regular expressions: A single attribute is matched with a regular expression.
fr: Expressions régulières: un attribut seul est comparé via une expression régulière.

source: Logical "MapServer expressions": One or more attributes are compared using logical expressions.
fr: "Expressions MapServer" logiques : un ou plusieurs attributs sont comparés en utilisant des expressions logiques.

source: String comparison (equality)
fr: Comparaison de chaînes (égalité)

source: String comparison means, as the name suggests, that attribute values are checked if they are equal to some value. String comparisons are the simplest form of MapServer expressions and the fastest option.
fr: La comparaison de chaînes signifie que, comme le nom le suggère, que les valeurs d'attributs sont vérifiées si elles sont égales à une valeur donnée. Les comparaisons de chaînes sont la forme la plus simple des expressions MapServer et aussi l'option la plus rapide.

source: To use a string comparison for filtering a :ref:`LAYER`, both `FILTERITEM` and `FILTER` must be set. `FILTERITEM` is set to the attribute name. `FILTER` is set to the value for comparison. The same rule applies to :ref:`CLASSITEM <classitem>` in the :ref:`LAYER` object and `EXPRESSION` in the :ref:`CLASS` object.
fr: Pour utiliser une comparaison de chaînes pour filtrer une :ref:`LAYER`, `FILTERITEM` et `FILTER` doivent tous les deux être définis. Le `FILTERITEM` est défini au nom de l'attribut. Le `FILTER` est défini à la valeur pour la comparaison. La même règle s'applique au :ref:`CLASSITEM <classitem>` dans l'objet :ref:`LAYER` et à l'\`EXPRESSION` dans l'objet :ref:`CLASS`.

source: Example for a simple string comparison filter
fr: Exemple pour un filtre de comparaison de chaînes simple

source: would match all records that have the attribute "year" set to "2005". The rendered map would appear as if the dataset would only contain those items that have the "year" set to "2005".
fr: devrait correspondre tous les enregistrements qui ont l'attribut "year" défini à "2005". La carte générée apparaitra comme si le jeu de données contenait seulement les éléments qui ont leur "year" défini à "2005".

source: Similarly, a classification for the items matched above would be done by setting the `CLASSITEM` in the :ref:`LAYER` and the `EXPRESSION` in the :ref:`CLASS`:
fr: De manière similaire, une classification des éléments correspondants à ci-dessus serait faite en définisssant la `CLASSITEM` dans la :ref:`LAYER` et l'\`EXPRESSION` dans la :ref:`CLASS`:

source: For reasons explained later, the values for both `CLASSITEM` and `FILTERITEM` should start with neither a '/' nor a '(' character.
fr: Pour des raions que nous expliqueront plus tard, les valeurs pour à la fois `CLASSITEM` et `FILTERITEM` ne devront ni commencé avec un caractère '/' ni avec un caractère '('.

source: Regular expression comparison
fr: Comparaison d'expressions régulières

source: Regular expressions are a standard text pattern matching mechanism from the Unix world. The functionality of regular expression matching is provided by the operating system on UNIX systems and therefore slightly operating system dependent. However, their minimum set of features are those defined by the POSIX standard. The documentation of the particular regular expression library is usually in the "regex" manual page ("man regex") on Unix systems.
fr: Les expressions régulières sont un mécanisme de comparaison de motifs texte venant du monde Unix. La fonctionnalité de correspondance des expressions régulières est fournie par le système d'exploitation sous UNIX et donc est peu dépendante du système d'exploitation. Cependant, leurs fonctionnalités minimum sont celles définies par celles associées au standard POSIX. La documentation sur la bibliothèque d'expressions régulières est d'habitude dans la page de manuel "regex" ("man regex") sur les systèmes Unix.

source: Regular expression with MapServer work similarly to string comparison, but allow more complex operation. They are slower than pure string comparisons, but might be still faster than logical expression. As for string comparison, when using a regular expressions, `FILTERITEM` (:ref:`LAYER` `FILTER`) or `CLASSITEM` (:ref:`CLASS` `EXPRESSION`) has to be defined if the items are not included in the :ref:`LAYER` `FILTER` or :ref:`CLASS` `EXPRESSION`.
fr: Les expressions régulières avec MapServer fonctionnent de manière similaire à la comparaison de chaîne, mais permettent des opérations plus complexes. Elles sont plus lentes que les comparaisons de chaîne pures, mais restent plus rapides que des expressions logiques. Comme pour les comparaisons de chaîne, quand vous utilisez des expressions régulières, le `FILTERITEM` (`FILTER` de :ref:`LAYER`) ou le `CLASSITEM` (`EXPRESSION` de :ref:`CLASS`) doivent être défini si les éléments ne sont pas inclus dans le `FILTER` de la :ref:`LAYER` ou de l'\ `EXPRESSION` de :ref:`CLASS`.

source: A regular expression typically consists of characters with special meanings and characters that are interpreted as they are. Alphanumeric characters (A-Z, a-z and 0-9) are taken as they are. Characters with special meanings are:
fr: Une expression regulière consiste typiquement de caractères avec des significations spéciales et des caractères interprétés en tant que tels. Les caractères alphanumériques (A-Z, a-z et 0-9) sont pris tels quels. Les caractères avec une signification spéciale sont :

source: **.** will match a single character.
fr: **.** correspondra à un seul caractère.

source: **[** and **]** are used for grouping. For example *[A-Z]* would match the characters A,B,C,...,X,Y,Z.
fr: **[** et **]** sont utilisés pour le groupage. Par exemple *[A-Z]* correspondra aux caractères A,B,C,...,X,Y,Z.

source: **{**, **}**, and **\*** are used to specify how often something should match.
fr: **{**, **}**, et **\*** sont utilisés pour spécifier avec le nombre de fois la correspondance doit être testée.

source: **^** matches the beginning, **$** matches the end of the value.
fr: **^** fait la correspondance avec le début de la valeur, **$** le fait lui avec la fin de la valeur.

source: The backslash **\\** is used to take away the special meaning. For example *\\$* would match the dollar sign.
fr: L'antislash **\\** est utilisé pour échapper le comportement du caractère spécial. Par exemple *\\$* correspondra au signe dollar.

source: Mapserver supports two regex operators:
fr: Mapserver supporte deux opérateurs de regex :

source: **~** case insensitive regular expression
fr: **~** expression régulière insensible à la casse

source: **~\*** case sensitive regular expression
fr: **~\** expression régulière sensible à la casse

source: The following :ref:`LAYER` configuration would have all records rendered on the map that have "hotel" in the attribute named "placename"
fr: La configuration de la :ref:`LAYER` suivante aura tous les enregistrements rendus sur la carte qui ont "hotel" pour l'attribut nommé "placename"

source: For `FILTER`, the regular expression is case-sensitive, thus records having "Hotel" in them would not have matched.
fr: Pour le `FILTER`, l'expression régulière est sensible à la casse, par conséquent, les enregistrements ayant "Hotel" dans leur attribut ne correspondront pas.

source: Example: Match records that have a value from 2000 to 2010 in the attribute "year":
fr: Exemple: vérifie tous les enregistrements qui ont une valeur de 2000 à 2010 dans l'attribut "year" :

source: Example: Match all the records that are either purely numerical or empty
fr: Exemple: Vérifie tous les enregistrements qui sont purement numériques ou vides

source: Example: Match all the features where the *name* attribute ends with "by", "BY", "By" or "bY" (case insensitive matching):
fr: Exemple: vérifie tous les objets où l'attribut *name* finit par "by", "BY", "By" ou "bY" (vérification insensible à la casse):

source: Example: Match all the features where the *rdname* attribute starts with "Main".
fr: Exemple: vérifie tous les objets dont l'attribut *rdname* débute avec "Main".

source: If you experience frequently segmentation faults when working with MapServer and regular expressions, it might be that your current working environment is linked against more than one regular expression library. This can happen when MapServer is linked with components that bring their own copy, like the Apache httpd or PHP. In these cases the author has made best experiences with making all those components using the regular expression library of the operating system (i.e. the one in libc). That involved editing the build files of some of the components, however.
fr: Si vous expérimentez fréquemment des erreurs de segmentation quand vous travailler avec MapServer et les expressions régulières, cela peut être dû au fait que votre environnement de travail courant est associé à plus d'une seule bibliothèque d'expressions régulières. Cela peut avoir lieu quand MapServer est "linké" avec ces composants qui apportent leur propre copie, comme le serveur httpd Apache ou PHP. Dans ces cas, l'auteur a eu les meilleurs résultats en compilant tous ces composants en utilisant la bibliothèque d'expressions régulières du système d'exploitation (c'est à dire celui qui est dans libc). Cela implique d'éditer les fichiers de compilation de quelques composants cependant.

source: "MapServer expressions"
fr: "Expressions MapServer"

source: MapServer expressions are the most complex and depending how they are written can become quite slow. They can match any of the attributes and thus allow filtering and classification depending on more than one attribute. Besides pure logical operations there are also expressions that allow certain arithmetic, string and time operations.
fr: Les expressions MapServer sont les plus complexes et en fonction de comment elles sont écrites peuvent devenir plutôt lentes. Elles peuvent correspondre à n'importe quel attribut et en plus permettent un filtrage et une classification dépendante de plus d'un seul attribut. En plus des opérations logiques, il y a aussi des expressions qui permettent certaines opérations arithmétiques, de chaînes et de temps.

source: To be able to use a MapServer expression for a FILTER or EXPRESSION value, the expression has to finally become a logical value.
fr: Pour être capable d'utiliser une expression MapServer pour une valeur FILTER ou EXPRESSION, l'expression doit à la fin devenir une valeur logique.

source: Logical expressions
fr: Expressions logiques

source: Syntactically, a logical expression is everything encapsulated in round brackets. Logical expressions take logical values as their input and return logical values. A logical expression is either 'true' or 'false'.
fr: Syntactiquement, une expression logique est tout ce qui est encapsulé dans des parenthèses. Les expressions logiques prennent des valeurs logiques comme entrée et retourne des valeurs logiques. Une expression logique est soit 'true', soit 'false'.

source: returns true when both of the logical expressions (Expression1 and Expression2) are true.
fr: retourne vrai quand les deux expressions logiques (Expression1 ou Expression2) sont à vrai.

source: returns true when at least one of the logical expressions (Expression1 or Expression2) is true.
fr: retourne vrai quand au moins une des expressions logiques (Expression1 ou Expression2) est à vrai.

source: returns true when Expression1 is false.
fr: retourne vrai quand l'Expression1 est à faux

source: String expressions that return a logical value
fr: Expressions de chaîne qui retourne une valeur logique

source: Syntactically, a sting is something encapsulated in single or double quotes.
fr: Syntactiquement, une chaîne est quelque choses entourée de guillemets simples ou doubles.

source: ( "String1" eq "String2" )
fr: ( "Chaine1" eq "Chaine2" )

source: ( "String1" == "String2" ) - deprecated since 6.0
fr: ( "Chaine1" == "Chaine2" ) - déprécié depuis la version 6.0

source: ( "String1" = "String2" )
fr: ( "Chaine1" = "Chaine2" )

source: returns true when the strings are equal. Case sensitive.
fr: retourne vrai quand les chaînes sont égales. Sensible à la casse.

source: ( "String1" =\* "String2" )
fr: ( "Chaine1" =\* "Chaine2" )

source: returns true when the strings are equal. Case insensitive.
fr: retourne vrai quand les chaînes sont égales. Insensible à la casse.

source: ( "String1" != "String2" )
fr: ( "Chaine1" != "Chaine2" )

source: ( "String1" ne "String2" )
fr: ( "Chaine1" ne "Chaine2" )

source: returns true when the strings are not equal.
fr: retourne vrai quand les chaînes ne sont pas égales.

source: ( "String1" < "String2" )
fr: ( "Chaine1" < "Chaine2" )

source: ( "String1" lt "String2" )
fr: ( "Chaine1" lt "Chaine2" )

source: returns true when "String1" is lexicographically smaller than "String2"
fr: retourne vrai quand la "Chaine1" est lexicographiquement plus petite que la "Chaine2".

source: ( "String1" > "String2" )
fr: ( "Chaine1" > "Chaine2" )

source: ( "String1" gt "String2" )
fr: ( "Chaine1" gt "Chaine2" )

source: returns true when "String1" is lexicographically larger than "String2".
fr: retourne vrai quand la "Chaine1" est lexicographiquement plus grande que la "Chaine2".

source: ( "String1" <= "String2" )
fr: ( "Chaine1" <= "Chaine2" )

source: ( "String1" le "String2" )
fr: ( "Chaine1" le "Chaine2" )

source: returns true when "String1" is lexicographically smaller than or equal to "String2"
fr: retourne vrai quand la "Chaine1" est lexicographiquement plus petite ou égale à la "Chaine2".

source: ( "String1" >= "String2" )
fr: ( "Chaine1" >= "Chaine2" )

source: ( "String1" ge "String2" )
fr: ( "Chaine1" ge "Chaine2" )

source: returns true when "String1" is lexicographically larger than or equal to "String2".
fr: retourne vrai quand la "Chaine1" est lexicographiquement plus grande ou égale à la "Chaine2".

source: ( "String1" IN "token1,token2,...,tokenN" )
fr: ( "Chaine1" IN "token1,token2,...,tokenN" )

source: returns true when "String1" is equal to one of the given tokens.
fr: retourne vrai quand la "Chaine1" est égale à l'un des tokens passés.

source: The separator for the tokens is the comma. That means that there can not be unnecessary white space in the list and that tokens that have commas in them cannot be compared.
fr: Le séparateur pour les tokens est la virgule. Cela signifie qu'il ne peut pas y avoir d'espace blanc dans la liste et que les tokens qui contiennent des virgules ne peuvent pas être comparés.

source: ( "String1" ~ "regexp" )
fr: ( "Chaine1" ~ "regexp" )

source: returns true when "String1" matches the regular expression "regexp". This operation is identical to the regular expression matching described earlier.
fr: retourne vrai quand "Chaine1" correspond à l'expression régulière "regexp". Cette opération est identique à celle de correspondance d'expression régulière décrite plus tôt.

source: ( "String1" ~* "regexp" )
fr: ( "Chaine1" ~* "regexp" )

source: returns true when "String1" matches the regular expression "regexp" (case insensitive). This operation is identical to the regular expression matching described earlier.
fr: retourne vrai quand "Chaine1" correspond à l'expression régulière "regexp" (insensible à la casse). Cette opération est identique à celle de correspondance d'expression régulière décrite plus tôt.

source: Arithmetic expressions that return a logical value
fr: Expressions arithmétiques qui retourne une valeur logique

source: The basic element for arithmetic operations is the number. Arithmetic operations that return numbers will be covered in the next section.
fr: L'élément basique pour les opérations arithmétiques est le nombre. Les opérations arithmétiques qui renvoient des nombres seront abordées dans la section suivante.

source: ( n1 == n2 ) - deprecated since 6.0
fr: ( n1 == n2 ) - déprécié depuis la version 6.0

source: returns true when the numbers are equal.
fr: retourne vrai quand les nombres sont égaux

source: returns true when the numbers are not equal.
fr: retourne vrai quand les nombres ne sont pas égaux.

source: returns true when n1 is smaller than n2.
fr: retourne vrai quand n1 est plus petit que n2.

source: returns true when n1 is larger than n2.
fr: retourne vrai quand n1 est plus grand que n2.

source: returns true when n1 is smaller than or equal to n2.
fr: retourne vrai quand n1 est plus petit que ou égal à n2.

source: returns true when n1 is larger than or equal to n2.
fr: retourne vrai quand n1 est plus grand que ou égal à n2.

source: returns true when n1 is equal to one of the given numbers.
fr: retourne vrai quand n1 est égal à l'un des nombres donnés.

source: Spatial expressions that return a logical value (GEOS)
fr: Expressions spatiales qui retournent une valeur logique (GEOS)

source: ( shape1 eq shape2 )
fr: ( forme1 eq forme2 )

source: returns true if shape1 and shape2 are equal
fr: retourne vrai si la forme1 et la forme2 sont égales

source: ( shape1 intersects shape2 )
fr: ( forme1 intersects forme2 )

source: returns true if shape1 and shape2 intersect
fr: retourne vrai si la forme1 et la forme2 s'intersectent

source: ( shape1 disjoint shape2 )
fr: ( forme1 disjoint forme2 )

source: returns true if shape1 and shape2 are disjoint
fr: retourne vrai si la forme1 et la forme2 sont disjointes

source: ( shape1 touches shape2 )
fr: ( forme1 touches forme2 )

source: returns true if shape1 and shape2 touch
fr: retourne vrai si la forme1 et la forme2 se touchent

source: ( shape1 overlaps shape2 )
fr: ( forme1 overlaps forme2 )

source: returns true if shape1 and shape2 overlap
fr: retourne vrai si la forme1 et la forme2 se recouvrent

source: ( shape1 crosses shape2 )
fr: ( forme1 crosses forme2 )

source: returns true if shape1 and shape2 cross
fr: retourne vrai si la forme1 et la forme2 se croisent

source: ( shape1 within shape2 )
fr: ( forme1 within forme2 )

source: returns true if shape1 is within shape2
fr: retourne vrai si la forme1 est à l'intérieur de la forme2

source: ( shape1 contains shape2 )
fr: ( forme1 contains forme2 )

source: returns true if shape1 contains shape2
fr: retourne vrai si la forme1 contient la forme2

source: ( shape1 dwithin shape2 )
fr: ( forme1 dwithin forme2 )

source: returns true if the distance between shape1 and shape2 is equal to 0
fr: retourne vrai si la distance entre la forme1 et la forme2 est égale à 0

source: ( shape1 beyond shape2 )
fr: ( forme1 beyond forme2 )

source: returns true if the distance between shape1 and shape2 is greater than 0
fr: retourne vrai si la distance entre la forme1 et la forme2 est supérieure à 0

source: String operations that return a string
fr: Opérations sur les chaînes qui retournent un chaîne

source: "String1" + "String2'
fr: "Chaine1" + "Chaine2'

source: returns "String1String2", that is, the two strings concatenated to each other.
fr: retourne "Chaine1Chaine2", qui sont les deux chaînes concaténées l'une avec l'autre.

source: Functions that return a string
fr: Fonctions qui retournent une chaîne

source: uses "Format1" to format the number n1 (C style formatting - sprintf).
fr: utilise "Format1" pour formater le nombre n1 (formatage en style C - sprintf).

source: commify ( "String1" )
fr: commify ( "Chaine1" )

source: adds thousands separators (commas) to a long number to make it more readable
fr: ajoute le séparateur de milliers (virgule) à un nombre long pour le rendre plus lisible

source: String functions that return a number
fr: Fonctions de chaînes qui retournent un nombre

source: length ( "String1" )
fr: length ( "Chaine1" )

source: returns the number of characters of "String1"
fr: retourne le nombre de caractères de "Chaine1"

source: Arithmetic operations and functions that return a number
fr: Opérations arithmétiques et fonctions qui retournent un nombre

source: returns n1 rounded to a multiple of n2: n2 * round(n1/n2)
fr: retourne n1 arrondi à un multiple de n2: n2 * round(n1/n2)

source: returns the sum of n1 and n2
fr: retourne la somme de n1 et n2

source: returns n2 subtracted from n1
fr: retourne n2 soustrait de n1

source: returns n1 multiplicated with n2
fr: retourne n1 multiplié par n2

source: returns n1 divided by n2
fr: retourne n1 divisé par n2

source: returns n1 negated
fr: retourne l'opposé de n1

source: returns n1 to the power of n2
fr: retourne n1 à la puissance n2
