Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapfile.po
Languages: fr

source: They guide the presentation of results, either a query or a map, to the user. Templates are almost always HTML files although they can also be a URL (e.g.. http://www.somewhere.com/[ATTRIBUTE]/info.html). URL templates can only be used with simple QUERY or ITEMQUERY results so many substitutions defined below are not available for them. Simple pan/zoom interfaces use a single template file while complicated queries often require many templates. Templates often use JavaScript to enhance the basic interface.
fr: Ils guident la présentation des résultats, que ce soit une interrogation ou une carte, à l'utilisateur. Les modèles sont presque toujours des fichiers HTML malgré le fait qu'ils puissent aussi être une URL (c'est à dire http://www.somewhere.com/[ATTRIBUTE]/info.html). Les modèles d'URL peuvent seulement être utilisés avec les résultats d'une simple QUERY ou d'un ITEMQUERY, ainsi de nombreuses substitutions définies plus bas ne sont pas disponibles pour eux. Des interfaces de déplacement/zoom utilise un fichier de modèle seul tandis les requêtes compliquées nécessitent souvent plusieurs modèles. Les modèles utilise souvent du JavaScript pour améliorer l'interface basique.

source: Templates *must* contain the magic string 'mapserver template' in the first line of the template. Often this takes the form of an HTML, javascript or XML comment. This line is *not* written to the client. The magic string is not case sensitive.
fr: Les modèles *doivent* contenir la chaîne magique 'mapserver template' dans la première ligne du modèle. Souvent, cela prend la forme d'un commentaire HTML, javascript ou XML. Cette ligne *n'est* pas écrite dans le client. La chaîne magique n'est pas sensible à la casse.

source: All :ref:`CGI parameters <cgi>` can be referenced in template substitutions, MapServer specific parameters as well as user defined ones. In principle parameters are handed through by the MapServer 1:1. This feature is essential for implementing MapServer applications.
fr: Tous les :ref:`paramètres CGI <cgi>` peuvent être référencés dans des substitutions de modèles, les paramètres spéciques de MapServer aussi bien que ceux définis par l'utilisateur. En principe, les paramètres sont gérés par le MapServer 1:1. Cette fonctionnalité est essentielle pour implémenter les applications MapServer.

source: The reference below only lists special template substitution strings which are needed to obtain information modified by the MapServer, e.g. a new scale, query results, etc.
fr: La référence ci-dessous liste seulement les chaînes de substitutions de modèle spécial qui sont nécessaires pour obtenir une information modifiée par MapServer, c'est à dire une nouvelle échelle, des résultats d'interrogation, etc.

source: Template substitution strings are case sensitive.
fr: Les chaînes de substitution des modèles sont sensibles à la casse.

source: Attribute item substitutions must be the same case as the item names in the dbase file.
fr: Les substitutions des éléments attributaires doivent avoir la même casse que le nom des éléments dans le fichier dbase.

source: ArcView and ArcInfo generally produce dbase files with item names that are all uppercase. Appropriate URL encoding (i.e. ' ' to '+') is applied when templates are URLs.
fr: ArcView et ArcInfo produisent généralement des fichiers dbase avec des noms d'éléments qui sont tous en majuscules. L'encodage approprié des URL (c'est à dire ' ' à '+') est appliqué quand les templates sont des URL.

source: Some substitutions are also available in escaped form (i.e. URL encoded).
fr: Quelques substitutions sont aussi disponibles avec une forme échappée (c'est à dire une URL encodée).

source: As an example this is needed when generating links within a template. This might pass the current mapextent to a new MapServer call. *[mapext]* is substituted by a space delimited set of lower left and upper right coordinates. This would break the URL. *[mapext_esc]* is substituted by a proper encoded set.
fr: Comme un exemple, ceci est nécessaire quand on génère des liens à l'intérieur d'un template. Cela est susceptible de passer l'étendue de la carte courante "mapextent" à un nouvel appel MapServer. *[mapext]* est substitué par un jeu de coordonnées "coin bas gauche" et "haut droite" séparés par des espaces. Comme cela casserais l'URL, *[mapext_esc]* est substitué par un jeu qui est correctement encodé.

source: Templates are simply HTML files or URL strings that contains special characters that are replaced by :ref:`mapserv` each time the template is processed. The simple substitution allows information such as active layers or the spatial extent to be passed from the user to :ref:`mapserv` and back again. Most often the new values are dumped into form variables that will be passed on again. The list of special characters and form variables is given below. HTML templates can include just about anything including JavaScript and Java calls.
fr: Les modèles sont simplement des fichiers HTML simples ou des chaînes d'URL qui contiennent des caractères spéciaux qui sont remplacés par :ref:`mapserv` chaque fois que le modèle est lu. la substitution simple autorise des informations comme les couches actives ou l'étendue spatiale qui doit être passée de l'utilisateur de :ref:`mapserv` et inversement. Le plus souvent les nouvelles valeurs sont envoyées vers des variables de formulaire qui seront passées à nouveau. La liste des caractères spéciaux et des variables de formulaires est donnée ci-dessous. Les modèles HTML peuvent inclure à peu près n'importe quoi en incluant des appels JavaScript et Java.

source: In HTML files, the attribute values can be inside quotes(""). Writing attribute values inside quotes allows you to set special characters in value that you couldn't use normaly (ie: ],=," and space). To write a single quote in a attribute value, just use two quotes ("").
fr: Dans les fichiers HTML, les valeurs d'attributs peuvent être entre guillemets (""). L'écriture des valeurs d'attributs dans des guillemets vous permet de de définir des caractères spéciaux dans des valeurs qu'habituellement vous ne pourriez pas utiliser normalement (c'est à dire : ],=," et espace). Pour écrire un guillemet simple dans une valeur d'attribut, utilisez juste deux guillemets ("").

source: General
fr: Général

source: Outputs the date (as per the web server's clock). The default format is the same as is used by Apache's Common Log format, which looks like:
fr: Renvoie la date (d'après l'horloge du serveur web). Le format par défaut est le même que celui utilisé par les logs communs de Apache, qui ressemble à ceci :

source: Available arguments:
fr: Arguments disponibles :

source: A format string as supported by the standard C strftime() function. As an example, the default format is defined as:
fr: Une chaîne formattée comme supportée par la function standard C strftime(). comme exemple, le format par défaut est défini comme :

source: timezone to use for the date returned. Default is "local". Valid values are:
fr: Le fuseau horaire à utiliser pour la date retournée. Par défaut, c'est "local". Les valeurs valides sont :

source: Output date will be Greenwich time
fr: La date renvoyée sera en temps de Greenwich (GMT)

source: Output the time in the web server's local time zone.
fr: Renvoie le temps du serveur web pour son fuseau horaire local.

source: Additionally or alternatively, the %z and %Z strftime format strings allow the timezone offset or name to be output.
fr: En plus ou bien de manière alternative, les chaînes du format strftime %z et %Z permettent de renvoyer le décalage de temps du fuseau horaire ou son nom.

source: The MapServer version number.
fr: Numéro de version de Mapserver.

source: Unique session id. The id can be passed in via a form but is more commonly generated by the software. In that case the id is a concatenation of UNIX time (or NT equivalent) and the process id. Unless you're getting more requests in a second than the system has process ids the id can be considered unique. ;->
fr: Identifiant de session unique. l'identifiant peut être passé via un formulaire mais est plus généralement généré par le logiciel. Dans ce cas, l'identifiant est la concaténation du temps UNIX (ou équivalent NT) et de l'identifiant du processus. A moins que vous obteniez plus de requêtes en une seconde que le système a d'identifiants de processus, alors l'identifiant peut être considéré comme unique. ;->

source: Hostname of the web server.
fr: Nom d'hôte du serveur web.

source: Port the web server is listening to.
fr: Port que le serveur web écoute.

source: The contents of any variables passed to the MapServer, whether they were used or not, can be echoed this way. One use might be to have the user set a map title or north arrow style in an interactive map composer. The system doesn't care about the values, but they might be real important in creating the final output, e.g. if you specified a CGI parameter like myvalue=.... you can access this in the template file with [myvalue].
fr: Le contenu de n'importe quelle variable passée à MapServer, qu'elles soient ou non utilisées, peut être renvoyée de cette manière. Une utilisation peut être d'avoir un utilisateur qui définisse un titre de carte ou un style de flèche Nord dans composeur de carte interactif. Le système se moque des valeurs, mais elles peuvent être réellement importantes pour créer une sortie finale, c'est à dire que si vous spécifié un paramètre CGI comme mavaleur=...., vous pouvez accéder à celui-ci dans le fichier de template avec [mavaleur].

source: Also available as escaped version.
fr: Aussi disponible comme une version "échappée"

source: Web object meta data access (e.g [web_projection]
fr: Accès aux métadonnées de l'objet web (c'est à dire [web_projection])

source: Current error stack output. Various error messages are delimited by semi-colons.
fr: Sortie courante de la pile d'erreurs. Les différents messages d'erreurs sont délimités par des are delimited by semi-colons.

source: File Reference
fr: Référence de fichier

source: Path (relative to document root) of the new image, just the image name if IMAGE_URL is not set in the mapfile.
fr: Chemin (relatif à la racine du document) de la nouvelle image, juste le nom de l'image si le paramètre IMAGE_URL n'est pas défini dans le mapfile.

source: In a map interface template, [img] is substituted with the path to the map image. In a query results template, it is substituted with the path to the querymap image (if a :ref:`QUERYMAP` object is defined in the :ref:`mapfile`).
fr: Dans un modèle d'interface de carte, [img] est substitué avec le chemin de l'image carte. Dans un modèle de résultats d'interrogation, il est substitué avec le chemin vers l'image de la "querymap" (si un objet :ref:`QUERYMAP` est défini dans le :ref:`mapfile`).

source: Path (relative to document root) of the new reference image.
fr: Chemin (relatif à la racine du document) de la nouvelle image de la carte de référence.

source: Path (relative to document root) of new legend image rendered by the MapServer.
fr: Chemin (relatif à la racine du document) de la nouvelle image de légende générée par MapServer.

source: Since version 3.5.1 a new HTML Legend template is provided by MapServer. If a template is defined in the :ref:`mapfile` the [legend] string is replaced by the processed legend as. See the :ref:`html_legend` for details.
fr: Depuis la version 3.5.1, un nouveau modèle de légende HTML est fourni par MapServer. Si un modèle est défini dans le :ref:`mapfile`, la chaîne [legend] est remplacée par la légende traitée. Voir la référence :ref:`html_legend` pour les détails.

source: Path (relative to document root) of new scalebar image.
fr: Chemin (relatif à la racine du document) de la nouvelle image d'échelle.

source: Path to the query file (if savequery was set as a :ref:`CGI Parameter <cgi>`).
fr: Chemin vers le fichier de requête (si savemap a été défini comme un :ref:`paramètre CGI <cgi>`).

source: Path to the map file (if savemap was set as a :ref:`CGI Parameter <cgi>`).
fr: Chemin vers le fichier .map (si savemap a été défini comme un :ref:`paramètre CGI <cgi>`).

source: Image Geometry
fr: Géométrie de l'image

source: Computed image center in pixels. Useful for setting imgxy form variable when map sizes change.
fr: Centre calculé de l'image en pixels. Utile pour définir la variable de formulaire imgxy quand la taille de la carte change.

source: Computed image center X or Y coordinate in pixels.
fr: Coordonnées X ou Y du centre de l'image calculé en pixels.

source: Current image size in cols and rows (separated by spaces).
fr: Taille de l'image courante en colonne et en ligne (séparée par des espaces).

source: Current image width or height.
fr: Largeur ou hauteur de l'image courante.

source: Current image scale. The exact value is not appropriate for user information but essential for some applications. The value can be rounded e.g. using JavaScript or server side post processing.
fr: Echelle de l'image courante. La valeur exacte n'est pas appropriée pour les informations utilisateur mias essentielle pour certaines applications. La valeur peut être arrondie c'est à dire en utilisant du JavaScript ou un traitement côté serveur.

source: Since MapServer 5.0 the proper parameter to use is [scaledenom] instead. The deprecated [scale] is the current image scale. The exact value is not appropriate for user information but essential for some applications. The value can be rounded e.g. using JavaScript or server side post processing.
fr: Depuis la version de MapServer 5.0, le paramètre approprié à utiliser est [scaledenom] à la place. L'échelle [scale] dépréciée est l'échelle de l'image courante. La valeur exacte n'est pas appropriée pour les informations utilisateur mias essentielle pour certaines applications. La valeur peut être arrondie c'est à dire en utilisant du JavaScript ou un traitement côté serveur.

source: Size of an pixel in the current image in map units. Useful for distance measurement tools in user interfaces.
fr: Taille d'un pixel dans l'image courante en unité de carte. Utile pour les outils de mesure de distance dans les interfaces utilisateurs.

source: Map Geometry
fr: Géométrie de la carte

source: X and Y coordinate of mouse click.
fr: Coordonnées X et Y du clic de souris.

source: Full mapextent (separated by spaces).
fr: Etendue complète "mapextent" (séparée par des espaces).

source: Also available as escaped version. (mapext_esc is deprecated in MapServer 5.2. You should use the "escape=" argument instead)
fr: Aussi disponible comme une version échappée. (mapext_esc est dépréciée dans MapServer 5.2. Vous devriez utiliser l'argument "escape=" à la place)

source: The default template [mapext] returns coordinates in the format of: mixx miny maxx maxy
fr: Le modèle par défaut [mapext] retourne les coordonnées dans le format : mixx miny maxx maxy

source: Escape the coordinates returned. Default is "none". Valid values are:
fr: Echappe les coordonnées retournées. La valeur par défaut est "none". Les valeurs valides sont :

source: Use URL escape codes to encode the coordinates returned.
fr: Utilise les codes d'échappement d'URL pour encoder les coordonnées retournées.

source: Do not escape.
fr: Ne pas échapper

source: Expand the bounds of the extents by a specific value. Specified in map coordinates. For example, [mapext] might return:
fr: Aggrandit les bornes des étendues d'une valeur spécifique. Spécifié dans les coordonnées de carte. Par exemple, [mapext] pourrait retourner :

source: and [mapext expand=1000] would therefore return:
fr: et [mapext expand=1000] retournera par conséquent :

source: Format of the coordinates. Default is "$minx $miny $maxx $maxy". For example, to add commas to the coordinates you would use:
fr: Format des coordonnées. La valeur par défaut est "$minx $miny $maxx $maxy". Par exemple, pour ajouter des virgules aux coordonnées, vous devriez utiliser :

source: The number of decimal places to output for coordinates (default is 0).
fr: Le nombre de décimales pour la sortie des coordonnées (par défaut, la valeur est 0).

source: Minimum / maximum X or Y coordinate of new map extent.
fr: Coordonnées X ou Y minimum / maximum de la nouvelle étendue de carte.

source: The differences of minimum / maximum X or Y coordinate of new map extent.
fr: La différences des coordonnées X ou Y minimum / maximum de la nouvelle étendue de carte.

source: Useful for creating cachable extents (i.e. 0 0 dx dy) with legends and scalebars
fr: Utile pour créer des étendues "cachable" (c'est à dire 0 0 dx dy) avec les légendes ou les barres d'échelle

source: Raw mapextent, that is the extent before fitting to a window size (separated by spaces). In cases where input came from imgbox (via Java or whatever) rawext refers to imgbox coordinates transformed to map units. Useful for spatial query building.
fr: Etendue de carte mapextent brute, c'est l'étendue avant de l'adapter à la taille de fenêtre (séparée par des espaces). Dans les cas où l'entrée vient de la boîte image imgbox (via Java ou autre), rawext se réfère aux coordonnées imgbox transformées en unités de carte. Utile pour la construction de requête spatiale.

source: Also available as escaped version. (rawext_esc is deprecated in MapServer 5.2. You should use the "escape=" argument instead)
fr: Aussi disponible en version échappée. (rawext_esc est déprécié dans MapServer 5.2. Vous devriez utiliser l'argument "escape=" à la place)

source: The default template [rawext] returns coordinates in the format of: mixx miny maxx maxy
fr: Le modèle par défaut [rawext] retourne les coordonnées dans le format : mixx miny maxx maxy

source: Expand the bounds of the extents by a specific value. Specified in map coordinates. For example, [rawext] might return:
fr: Aggrandit les bornes des étendues d'une valeur spécifique. Spécifié dans les coordonnées de carte. Par exemple, [rawext] pourrait retourner :

source: and [rawext expand=1000] would therefore return:
fr: et [rawext expand=1000] retournera par conséquent :

source: Minimum / maximum X or Y coordinate of a raw map/search extent.
fr: Coordonnées X ou Y minimum / maximum de la carte brute / l'étendue de recherche.

source: The following substitutions are only available if the MapServer was compiled with PROJ support and a :ref:`PROJECTION` is defined in the :ref:`mapfile`.
fr: Les substitutions suivantes sont seulement disponibles si MapServer a été compilé avec le support de PROJ et qu'une :ref:`PROJECTION` est définie dans le :ref:`mapfile`.

source: Longitude / latitude value of mouse click. Available only when projection enabled.
fr: Valuer de longitude / latitude du clic de souris. Disponible seulement si la projection est activée.

source: Full mapextent (separated by spaces). Available only when projection enabled.
fr: Etendue complète "mapextent" (séparée par des espaces). Disponible seulement si la projection est activée.

source: Also available as escaped version. (mapext_latlon_esc is deprecated in MapServer 5.2. You should use the "escape=" argument instead)
fr: Aussi disponible comme une version échappée. (mapext_latlong_esc est dépréciée dans MapServer 5.2. Vous devriez utiliser l'argument "escape=" à la place)

source: The default template [mapext_latlon] returns coordinates in the format of: mixx miny maxx maxy
fr: Le modèle par défaut [mapext_latlon] retourne les coordonnées dans le format : mixx miny maxx maxy

source: Expand the bounds of the extents by a specific value. Specified in map coordinates. For example, [mapext_latlon] might return:
fr: Aggrandit les bornes des étendues d'une valeur spécifique. Spécifié dans les coordonnées de carte. Par exemple, [mapext_latlon] pourrait retourner :

source: and [mapext_latlon expand=1000] would therefore return:
fr: et [mapext_latlon expand=1000] retournera par conséquent :

source: Minimum / maximum longitude or latitude value of mapextent. Available only when projection enabled.
fr: Valuer de longitude ou latitude minimum / maximum de l'étendue de carte mapextent. Disponible seulement si la projection est activée.

source: Reference map extent (separated by spaces).
fr: Etendue de la carte de référence (séparée par des espaces)

source: This template has been added with version 4.6 on behalf of an enhancement request. See the thread in the `MapServer ticket#1102`_ for potential use cases.
fr: Ce modèle a été ajouté dans la version 4.6 suite à une demande d'amélioration. Voir le fil de discussion dans `ticket #1102 MapServer`_ pour des cas d'utilisation potentiels.

source: Also available as escaped version. (refext_esc is deprecated in MapServer 5.2. You should use the "escape=" argument instead)
fr: Aussi disponible comme une version échappée. (refext_esc est dépréciée dans MapServer 5.2. Vous devriez utiliser l'argument "escape=" à la place)

source: The default template [refext] returns coordinates in the format of: mixx miny maxx maxy
fr: Le modèle par défaut [refext] retourne les coordonnées dans le format : mixx miny maxx maxy

source: Expand the bounds of the extents by a specific value. Specified in map coordinates. For example, [refext] might return:
fr: Aggrandit les bornes des étendues d'une valeur spécifique. Spécifié dans les coordonnées de carte. Par exemple, [refext] pourrait retourner :

source: and [refext expand=1000] would therefore return:
fr: et [refext expand=1000] retournera par conséquent :

source: Layer
fr: Couche

source: All active layers space delimited. Used for a "POST" request.
fr: Toutes les couches actives délimitées avec un espace. Utilisé pour une requête "POST"

source: List of all layers that can be toggled, i.e. all layers defined in the :ref:`mapfile` which status is currently not default.
fr: Liste de toutes les couches qui peuvent être activées/désactivées, c'est à dire toutes les couches définies dans le :ref:`mapfile` dont le status n'est pas couramment à "default".

source: Used for making layers persistent across a map creation session. String is replaced with the keyword "checked", "selected" or "" if layername is on. Layername is the name of a layer as it appears in the :ref:`mapfile`. Does not work for default layers.
fr: Utilisé pour rendre les couches persistantes pendant une session de création de carte. La chaîne est remplacée avec le mot-clé "checked", "selected" ou "" si "layername" est activée. Layername estle nom de la couche tel qu'il apparaît dans le :ref:`mapfile`. Ne fonctionne pas pour les couches default.

source: Layer meta data access (e.g. [streets_build] the underscore is essential).
fr: Accès aux métadonnées de couche (c'est à dire [streets_build], le tiret bas est essentiel)

source: Used for making the zoom factor persistent. Zoom values can range from -25 to 25 by default. The string is replaced with the HTML keyword "checked", "selected" or "" depending on the current zoom value.
fr: Utilisé pour rendre le facteur de zoom persistant. Les valeurs de zoom peuvent prendre des valeurs entre -25 et 25 par défaut. La chaîne est remplacée avec le mot-clé HTML "checked", "selected" ou "" en fonction de la valeur de zoom courante.

source: E.g. if the zoom is 12, a [zoom_12_select] is replaced with "selected", while a [zoom_13_select] in the same HTML template file is not.
fr: C'est à dire si le zoom est 12, un [zoom_12_select] est remplacé avec "selected", tandis qu'un [zoom_13_select] dans le même fichier de modèle HTML ne l'est pas.
