Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapfile.po
Languages: fr

source: Template to use AFTER anything else is sent. Multiresult query modes only.
fr: Modèle à utiliser APRÈS que tout ait été envoyé. En mode requête de plusieurs résultats seulement.

source: Template to use BEFORE everything else has been sent. Multiresult query modes only.
fr: Modèle à utiliser AVANT que tout soit envoyé. En mode requête de plusieurs résultats seulement.

source: Path to the temporary directory fro writing temporary files and images. Must be writable by the user the web server is running as. Must end with a / or \ depending on your platform.
fr: Chemin vers le répertoire temporaire pour l'écriture des fichiers et images temporaires. L'écriture doit être possible par l'utilisateur du serveur web. Doit se terminer par un / ou \ en fonction de la plateforme.

source: Base URL for IMAGEPATH. This is the URL that will take the web browser to IMAGEPATH to get the images.
fr: URL de base pour IMAGEPATH. C'est l'URL qu'utilisera le navigateur web vers IMAGEPATH pour obtenir les images.

source: Format of the legend output, using MapServer CGI. *(added to MapServer 4.8.0)* The default value is "text/html". Example:
fr: Format de la sortie de la légende en utilisant le CGI de MapServer. *(ajouté à MapServer 4.8.0)* La valeur par défaut est "text/html". Exemple :

source: Since MapServer 5.0 the recommeded parameters to use for debugging are the :ref:`MAP` object's CONFIG and DEBUG parameters instead (see the :ref:`debugging` document).
fr: Depuis MapServer 5.0, les paramètres recommandés pour déboguer sont les paramètres CONFIG et DEBUG de l'objet :ref:`MAP` (voir le document :ref:`debugging`).

source: File to log MapServer activity in. Must be writable by the user the web server is running as.
fr: Fichier dans lequel loguer l'activité de MapServer. L'utilisateur de serveur web doit avoir les droits en écriture.

source: Minimum scale at which this interface is valid. When a user requests a map at a smaller scale, MapServer automatically returns the map at this scale. This effectively prevents user from zooming too far out. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000. Implemented in MapServer 5.0, to replace the deprecated MAXSCALE parameter.
fr: Échelle minimale pour laquelle cette interface est valide. Lorsqu'un utilisateur demande une carte pour une échelle plus petite, MapServer renvoie automatiquement la carte à cette échelle. Cela empêche effectivement l'utilisateur de zoomer trop en avant. L'échelle est définie par le dénominateur de la fraction de l'échelle, par exemple pour une carte à l'échelle de 1:24,000 utilisez 24000. Implémenté dans MapServer 5.0, pour remplacer le paramètre MINSCALE déprécié.

source: Since MapServer 5.0 the proper parameter to use is MAXSCALEDENOM instead. The deprecated MAXSCALE is the minimum scale at which this interface is valid. When a user requests a map at a smaller scale, MapServer automatically returns the map at this scale. This effectively prevents user from zooming too far out. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000.
fr: Depuis MapServer 5.0 le paramètre correct est MAXSCALEDENOM. Le paramètre MAXSCALE déprécié est l'échelle maximale pour laquelle l'interface est valide. Lorsqu'un utilisateur demande une carte pour une échelle plus grande, MapServer renvoie automatiquement la carte à cette échelle. Cela empêche effectivement l'utilisateur de zoomer trop en arrière. L'échelle est définie par la dénominateur de la fraction de l'échelle, par exemple pour une carte à l'échelle de 1:24,000 utilisez 24000.

source: Template to be used if below the minimum scale for the app (the denominator of the requested scale is larger than MAXSCALEDENOM), useful for nesting apps.
fr: Modèle à utiliser si on se trouve en-dessous de l'échelle minimale pour l'application (le dénominateur de l'échelle demandée est plus grand que MAXSCALEDENOM). Utile pour imbriquer des applications.

source: This keyword allows for arbitrary data to be stored as name value pairs. This is used with OGC WMS to define things such as layer title. It can also allow more flexibility in creating templates, as anything you put in here will be accessible via template tags. Example:
fr: Ce mot-clé permet d'ajouter des données arbitraires sous forme de paires nom-valeur. Cela est utilisé pour les WMS de l'OGC pour définir des informations comme le titre de la couche. Il permet aussi plus de flexibilité pour la création de modèle, puisque tout ce que vous placerez ici sera disponible via les balises du modèle. Exemple :

source: Maximum scale at which this interface is valid. When a user reqests a map at a larger scale, MapServer automatically returns the map at this scale. This effectively prevents the user from zooming in too far. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000. Implemented in MapServer 5.0, to replace the deprecated MINSCALE parameter.
fr: Échelle maximale pour laquelle cette interface est valide. Lorsqu'un utilisateur demande une carte pour une échelle plus grande, MapServer renvoie automatiquement la carte à cette échelle. Cela empêche effectivement l'utilisateur de zoomer trop en arrière. L'échelle est définie par la dénominateur de la fraction de l'échelle, par exemple pour une carte à l'échelle de 1:24,000 utilisez 24000. Implémenté dans MapServer 5.0, pour remplacer le paramètre MAXSCALE déprécié.

source: Since MapServer 5.0 the proper parameter to use is MINSCALEDENOM instead. The deprecated MINSCALE is the maximum scale at which this interface is valid. When a user reqests a map at a larger scale, MapServer automatically returns the map at this scale. This effectively prevents the user from zooming in too far. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000.
fr: Depuis MapServer 5.0 le paramètre correct est MINSCALEDENOM. Le paramètre MINSCALE déprécié est l'échelle minimale pour laquelle l'interface est valide. Lorsqu'un utilisateur demande une carte pour une échelle plus petite, MapServer renvoie automatiquement la carte à cette échelle. Cela empêche effectivement l'utilisateur de zoomer trop en avant. L'échelle est définie par la dénominateur de la fraction de l'échelle, par exemple pour une carte à l'échelle de 1:24,000 utilisez 24000.

source: Template to be used if above the maximum scale for the app (the denominator of the requested scale is smaller than MINSCALEDENOM), useful for nesting apps.
fr: Modèle à utiliser si on se trouve au-dessus de l'échelle minimale pour l'application (le dénominateur de l'échelle demandée est plus petit que MINSCALEDENOM). Utile pour imbriquer des applications.

source: Format of the query output. *(added to MapServer 4.8.0)* This works for mode=query (using query templates in CGI mode), but not for mode=browse. The default value is "text/html". Example:
fr: Format de la sortie de la requête. *(ajouté à MapServer 4.8.0)* Cela fonctionne pour mode=query (en utilisant les modèles de requête en mode CGI), mais pas pour mode=browse. La valeur par défaut est "text/html". Exemple :

source: Template file or URL to use in presenting the results to the user in an interactive mode (i.e. map generates map and so on ... ).
fr: Fichier modèle ou URL à utiliser en présentant les résultats à l'utilisateur en mode interactif

source: URL is not a remote file, rather a template. For example:
fr: URL n'est pas distant, plutôt un modèle. Par exemple:

source: Path for storing temporary files. If not set, the standard system temporary file path will be used (e.g. \tmp for unix). `TEMPPATH` can also be set using the environment variable `MS_TEMPPATH`.
fr: Chemin pour stocker les fichiers temporaires. Si il n'est pas défini, le chemin fu fichier temporaire standard sera utilisé (c'est à dire \tmp pour unix). `TEMPPATH` peut aussi être défini en utilisant la variable d'environnement `MS_TEMPPATH`.

source: `TEMPPATH` is used in many contexts (see rfc66).
fr: `TEMPPATH` est utilisé dans de nombreux contextes (voir rfc66).

source: Make sure that that Mapserver has sufficient rights to read and write files at the specified location.
fr: Assurez-vous que Mapserver à des droits suffisants en lecture et écriture sur les fichiers à l'emplacement donné.

source: XML Mapfile support
fr: Support du mapfile XML

source: MapServer is able to load XML mapfiles automatically, without user XSLT tranformations. Basicly, MapServer will simply do an XSLT transformation when the mapfile passed to it is an XML one, convert it to a text mapfile in a temporary file on disk, then process the mapfile normally.
fr: MapServer est capable de charger les mapfiles XML automatiquement, sans transformation XSLT de la part de l'utilisateur. De manière basique, MapServer fera simplement une transformation XSLT quand le mapfile passé est de type XML, le convertira dans un mapfile texte dans un fichier temporaire et ensuite traitera le mapfile normalement.

source: New Dependencies
fr: Nouvelles dépendances

source: Enabling the support
fr: Activation du support

source: You can enable the XML mapfile support by adding the following option: --with-xml-mapfile. This configure option will enable the libxslt and libexslt check up. If your libxslt/libexslt are not installed in /usr, you'll have to add the following options:
fr: Vous pouvez active le support du mapfile XML en ajoutant l'option suivante: --with-xml-mapfile. Cette option de configure activera la vérification de la présence des bibliothèques libxslt et libexslt. Si vos libxslt/libexslt ne sont pas installés dans /usr, vous aurez à ajouter les options suivantes:

source: Usage:
fr: Utilisation

source: In order to enable this feature, set the MS_XMLMAPFILE_XSLT environment variable to point to the location of the XSLT to use for the XML->text mapfile conversion. e.g. in Apache:
fr: Dans le but d'activer cette fonctionnalité, définir la variable d'environnement MS_XMLMAPFILE_XSLT pour qu'elle pointe vers l'emplacement du XSLT à utiliser pour la conversion XML->text mapfile c'est à dire dans Apache:

source: With this enabled, passing an .xml filename to the CGI `map` parameter will automatically trigger the conversion.
fr: Avec cela activé, le passage d'un nom de fichier .xml dans le paramètre CGI de `map` lancera automatiquement la conversion.

source: This is a first step to XML mapfile loading support. Obviously, there is a cost to parse and translate the XML mapfile, but this allows easier use of XML mapfiles.
fr: C'est la première étape pour le support du chargement d'un mapfile XML. Evidemment, cela a un coût de parser et traduire le mapfile, mais cela permet un usage plus simple des mapfiles XML.
