Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapfile.po
Languages: fr

source: Since MapServer 5.0 the proper parameter to use is LABELMAXSCALEDENOM instead. The deprecated LABELMAXSCALE is the minimum scale at which this LAYER is labeled. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000.
fr: Depuis MapServer 5.0, le bon paramètre à utiliser est LABELMAXSCALEDENOM. Le paramètre obsolète LABELMAXSCALE était l'échelle maximale à laquelle la couche était étiquetée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000.

source: Maximum scale at which this LAYER is labeled. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000. Implemented in MapServer 5.0, to replace the deprecated LABELMINSCALE parameter.
fr: Échelle minimale pour laquelle la couche est étiquetée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000. Implémenté dans MapServer 5.0 pour remplacer le paramètre obsolète LABELMINSCALE.

source: Since MapServer 5.0 the proper parameter to use is LABELMINSCALEDENOM instead. The deprecated LABELMINSCALE is the maximum scale at which this LAYER is labeled. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000.
fr: Depuis MapServer 5.0, le bon paramètre à utiliser est LABELMINSCALEDENOM. Le paramètre obsolète LABELMINSCALE était l'échelle minimale à laquelle la couche était étiquetée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000.

source: Sets context for labeling this layer, for example:
fr: Définit le contexte pour l'étiquetage de cette couche, par exemple :

source: means that this layer would NOT be labeled if a layer named "orthoquads" is on. The expression consists of a boolean expression based on the status of other layers, each [layer name] substring is replaced by a 0 or a 1 depending on that layer's STATUS_ and then evaluated as normal. Logical operators AND and OR can be used.
fr: ... signifie que cette couche ne sera pas étiquetée si la couche nommée "orthoquads" est visible ("on"). La syntaxe consiste en une expression booléenne basée sur le statut des autres couches, chaque sous-chaîne [layer name] est remplacée par un 0 ou un 1 selon le paramètre STATUS_ de la couche et ensuite évaluée normalement. Les opérateurs logiques AND et OR peuvent être utilisés.

source: (As of MapServer 5.0 this parameter is no longer available. Please see the :ref:`LABEL` object's SIZE parameter) For MapServer versions < 5.0, this is the item name in attribute table to use for class annotation sizes. Values should be in pixels.
fr: (À partir de MapServer 5.0 ce paramètre n'est plus disponible. Voyez le paramètre SIZE de l'objet :ref:`LABEL`) Pour les versions < 5.0 de MapServer, c'est le nom de l'élément de la table attributaire à utiliser comme classe des tailles d'annotation. Les valeurs doivent être en pixels.

source: Specifies the number of features that should be drawn for this layer in the CURRENT window. Has some interesting uses with annotation and with sorted data (i.e. lakes by area).
fr: Spécifie le nombre d'entités qui seront dessinées pour cette couche dans la fenêtre COURANTE. Utilisation intéressante avec les étiquettes et les données triées (par exemple les lacs par zone).

source: Maximum width, in the map's geographic units, at which this LAYER is drawn. If MAXSCALEDENOM is also specified then MAXSCALEDENOM will be used instead. *(added in MapServer 5.4.0)*
fr: Largeur maximum, dans l'unité géographique de la carte, pour laquelle la couche LAYER esr dessinée. Si MAXSCALEDENOM est aussi spécifié alors MAXSCALEDENOM sera utilisé à la place. *(ajouté dans MapServer 5.4.0)*

source: The width of a map in geographic units can be found by calculating the following from the extents::
fr: La largeur de la carte en unités géographiques peut être trouvées en calculant ce qui suit à partir de l'étendue::

source: Minimum scale at which this LAYER is drawn. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000. Implemented in MapServer 5.0, to replace the deprecated MAXSCALE parameter.
fr: Échelle maximale pour laquelle cette couche est dessinée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000. Implémenté dans MapServer 5.0 pour remplacer le paramètre obsolète MAXSCALE.

source: Since MapServer 5.0 the proper parameter to use is MAXSCALEDENOM instead. The deprecated MAXSCALE is the minimum scale at which this LAYER is drawn. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000.
fr: Depuis MapServer 5.0, le bon paramètre à utiliser est MAXSCALEDENOM. Le paramètre obsolète MAXSCALE était l'échelle maximale à laquelle la couche était dessinée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000.

source: This keyword allows for arbitrary data to be stored as name value pairs. This is used with :ref:`OGC WMS <wms_server>` to define things such as layer title. It can also allow more flexibility in creating templates, as anything you put in here will be accessible via template tags.
fr: Ce mot-clé permet d'enregistrer des données arbitraires comme un couple de valeurs. Ceci est utilisé avec :ref:`OGC WMS <wms_server>` pour définir des éléments comme le titre de la couche. Il peut aussi permettre plus de souplesse lors de la création des mises en forme ("template"), puisque tout ce que vous mettrez ici sera accessible via les balises du template.

source: Example:
fr: Exemple

source: Minimum width, in the map's geographic units, at which this LAYER is drawn. If MINSCALEDENOM is also specified then MINSCALEDENOM will be used instead. *(added in MapServer 5.4.0)*
fr: Largeur minimum, dans l'unité géographique de la carte, pour laquelle la couche LAYER esr dessinée. Si MAXSCALEDENOM est aussi spécifié alors MAXSCALEDENOM sera utilisé à la place. *(ajouté dans MapServer 5.4.0)*

source: Maximum scale at which this LAYER is drawn. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000. Implemented in MapServer 5.0, to replace the deprecated MINSCALE parameter.
fr: Echelle minimale pour laquelle cette couche est dessinée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000. Implémenté dans MapServer 5.0 pour remplacer le paramètre obsolète MINSCALE.

source: Since MapServer 5.0 the proper parameter to use is MINSCALEDENOM instead. The deprecated MINSCALE is the maximum scale at which this LAYER is drawn. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000.
fr: Depuis MapServer 5.0, le bon paramètre à utiliser est MINSCALEDENOM. Le paramètre obsolète MINSCALE était l'échelle minimale à laquelle la couche était dessinée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000.

source: Short name for this layer. This name is the link between the mapfile and web interfaces that refer to this name. They must be identical. The name should be unique, unless one layer replaces another at different scales. Use the GROUP option to associate layers with each other. It is recommended that the name not contain spaces, special characters, or begin with a number (which could cause problems through interfaces such as OGC services).
fr: Nom court de cette couche. Ce nom est le lien entre le mapfile et les interfaces web qui se réfèrent à ce nom. Ils doivent être identiques. Le nom doit être unique, sinon une couche en remplacera une autre à différentes échelles. Utilisez l'option GROUP pour associer les couches entre elles. Il est recommandé que le nom ne contienne pas d'espaces, de caractères spéciaux, ou commence avec un nombre (ce qui peut poser des problèmes lors du passage vers des interfaces comme les services OGC).

source: Sets the color index to treat as transparent for raster layers.
fr: Sélectionne l'index de couleur utilisé pour la transparence des couches raster.

source: Sets the opacity level (or the inability to see through the layer) of all classed pixels for a given layer. The value can either be an integer in the range (0-100) or the named symbol "ALPHA". A value of 100 is opaque and 0 is fully transparent. Implemented in MapServer 5.0, to replace the deprecated TRANSPARENCY parameter.
fr: Définit le niveau d'opacité (autrement dit l'incapacité de voir à travers la couche) de tous les pixels classés pour une couche donnée. La valeur peut être soit un entier compris entre 0 et 100 soit le mot-clé nommé "ALPHA". Une valeur de 100 est opaque et une valeur de 0 est complétement transparente. Implémenté dans MapServer 5.0 pour remplacer le paramètre obsolète TRANSPARENCY.

source: The "ALPHA" symbol directs the MapServer rendering code to honor the indexed or alpha transparency of pixmap symbols used to style a layer. This is only needed in the case of RGB output formats, and should be used only when necessary as it is expensive to render transparent pixmap symbols onto an RGB map image.
fr: Le mot-clé "ALPHA" indique au moteur de rendu de MapServer de prendre en compte la transparence indexée ou alpha des symboles pixmap utilisés pour styler une couche. C'est uniquement nécessaire en cas de formats de sortie RVB et ne devrait être utilisé que lorsque cela est nécessaire car il est coûteux de rendre transparents des symboles pixmap sur une image de carte RGB.

source: Additional library to load by MapServer, for this layer. This is commonly used to load specific support for SDE and Microsoft SQL Server layers, such as:
fr: Bibliothèque additionnelle à charger par Mapserver, pour cette couche. Elle est généralement utilisée pour charger le support spécifique pour des couches SDE ou Microsoft SQL Server, comme ceci :

source: Tells MapServer to render this layer after all labels in the cache have been drawn. Useful for adding neatlines and similar elements. Default is false.
fr: Indique à MapServer de dessiner cette couche après que toutes les étiquettes en cache auront été dessinées. Très utile pour ajouter une touche finale et d'autres éléments similaires. Désactivé par défaut.

source: Passes a processing directive to be used with this layer. The supported processing directives vary by layer type, and the underlying driver that processes them.
fr: Passe une directive de procédure à utiliser avec cette couche. Les directives de procédure reconnues varient en fonction du type de couche et du pilote sous-jacent qui les traitera.

source: **Attributes Directive** - The ITEMS processing option allows to specify the name of attributes for inline layers or specify the subset of the attributes to be used by the layer, such as:
fr: **Attributes Directive** - L'option ITEMS de PROCESSING permet de définir le nom des attributs pour les couches en ligne ou de spécifier le sous-ensemble des attributs à utiliser par la couche, par exemple :

source: **Connection Pooling Directive** - This is where you can enable connection pooling for certain layer layer types. Connection pooling will allow MapServer to share the handle to an open database or layer connection throughout a single map draw process. Additionally, if you have FastCGI enabled, the connection handle will stay open indefinitely, or according to the options specified in the :ref:`FastCGI <fastcgi>` configuration. :ref:`oci`, :ref:`arcsde`, :ref:`ogr` and :ref:`input_postgis` currently support this approach.
fr: **Connection Pooling Directive** - C'est également ici que vous pouvez activer le groupement de connexions pour certains types de couches. Le groupement de connexion permettra à MapServer de partager une connexion à une base de données ouverte ou à une couche via un seul processus de rendu de carte. De plus, si FastCGI est activé, la connexion sera maintenue ouverte indéfiniment ou selon les options spécifiées dans la configuration de :ref:`FastCGI <fastcgi>`. :ref:`oci`, :ref:`arcsde`, :ref:`ogr` et :ref:`input_postgis` gèrent actuellement cette approche.

source: **Label Directive** - The LABEL_NO_CLIP processing option can be used to skip clipping of shapes when determining associated label anchor points. This avoids changes in label position as extents change between map draws. It also avoids duplicate labels where features appear in multiple adjacent tiles when creating tiled maps.
fr: **Label Directive** - L'option LABEL_NO_CLIP de PROCESSING peut être utilisée pour éviter le découpage des formes quand on détermine les points d'ancrage associés des étiquettes. Cela évite des changements dans la position des étiquettes comme les étendues changent entre les dessins de carte. Cela évite aussi les étiquettes dupliquées quand les entités apparaissent dans de multiples tuiles adjacentes quand on créé des cartes tuilées.

source: **OGR Styles Directive** - This directive can be used for obtaining label styles through MapScript. For more information see the :ref:`MapServer's OGR document <styleitemauto-label-styles>`.
fr: **OGR Styles Directive - Cette directive peut être utilisée pour obtenir les styles de labels via MapScript. Pour plus d'information lisez :ref:`le document OGR avec MapServer <styleitemauto-label-styles>`.

source: **Raster Directives** - All raster processing options are described in :ref:`raster`. Here we see the SCALE and BANDs directives used to autoscale raster data and alter the band mapping.
fr: **Raster Directives** - Toutes les options des procédures raster sont décrites dans le HOWTO:ref:raster. Ici nous voyons les directives SCALE et BAND utilisées pour redimensionner les données raster et modifier le mappage des bandes.

source: Signals the start of a :ref:`PROJECTION` object.
fr: Indique le début d'un objet :ref:`PROJECTION`.

source: Sets context for displaying this layer (see LABELREQUIRES_).
fr: Définit le contexte pour l'affichage de cette couche (voir LABELREQUIRES_).

source: Sets the unit of :ref:`CLASS` object SIZE values (default is pixels). Useful for simulating buffering. `Nauticalmiles` was added in MapServer 5.6.
fr: Définit l'unité des valeurs SIZE de l'objet :ref:`CLASS` (en pixels par défaut). Très utile pour simuler des tampons (buffers). `Nauticalmiles` a été ajouté dans MapServer 5.6.

source: Sets the current status of the layer. Often modified by MapServer itself. Default turns the layer on permanently.
fr: Définit le statut actuel de la couche. Fréquemment modifié par MapServer lui-même. "Default" active la couche ("on") en permanence.

source: In :ref:`CGI <cgi>` mode, layers with STATUS DEFAULT cannot be turned off using normal mechanisms. It is recommended to set layers to STATUS DEFAULT while debugging a problem, but set them back to ON/OFF in normal use.
fr: En mode :ref:`CGI <cgi>`, les couches avec STATUS DEFAULT ne peuvent pas être désactivées par les mécanismes classiques. Il est recommandé de définir des couches en STATUS DEFAULT lorsque l'on souhaite débuguer un problème puis de les redéfinir à ON/OFF en utilisation normale.

source: For :ref:`WMS <wms_server>`, layers in the server mapfile with STATUS DEFAULT are always sent to the client.
fr: Pour le :ref:`WMS <wms_server>`, les couches dans le mapfile du serveur dont le paramètre STATUS vaut DEFAULT sont toujours envoyées au client.

source: The STATUS of the individual layers of a GROUP has no effect when the group name is present in the LAYERS parameter of a CGI request - all the layers of the group will be returned.
fr: Le STATUS des couches individuelles d'un GROUP n'a pas d'effet quand le nom du groupe est présent dans le paramètre LAYERS d'une requête CGI - toutes les couches seront retournées.

source: Item to use for feature specific styling. The style information may be represented by a separate attribute (style string) attached to the feature. MapServer supports the following style string representations:
fr: Elément à utiliser pour le style spécifiques à une entité. L'information de style pourra être représentée par un attribut séparé (chaîne de style) rattaché à l'entité. MapServer supporte les représentations de style suivant :

source: **MapServer STYLE definition** - The style string can be represented as a MapServer :ref:`STYLE` block according to the following example:
fr: **une définition de STYLE MapServer** - la chaîne de style peut être représentée comme un bloc de :ref:`STYLE` MapServer en suivant l'exemple suivant :

source: **MapServer CLASS definition** - By specifying the entire :ref:`CLASS` instead of a single style allows to use further options (like setting expressions, label attributes, multiple styles) on a per feature basis.
fr: **une définition de CLASS MapServer** - En spécifiant la :ref:`CLASS` complète à la place d'un seul style permet d'avoir plus d'options (comme la définition d'expressions, d'attributs d'étiquettes, de styles multiple) sur la base d'un fonctionnement par entité.

source: **OGR Style String** - MapServer support rendering the OGR style string format according to the `OGR - Feature Style Specification`_ documentation. Currently only a few data sources support storing the styles along with the features (like MapInfo, AutoCAD DXF, Microstation DGN), however those styles can easily be transferred to many other data sources as a separate attribute by using the `ogr2ogr`_ command line tool as follows::
fr: **une chaîne de style OGR** - MapServer supporte le rendu du format de chaînes de styles OGR en suivant la documentation `OGR - Feature Style Specification`_. Actuellement, seules quelles sources de données supportent des styles encapsulés avec les entités (comme pour MapInfo, les DXF AutoCAD, les DGN Microstation), cependant ces styles peuvent être facilement transférés vers de nombreuses autres sources comme un attribut séparé en utilisant l'outil de ligne de commande `ogr2ogr`_ comme ceci ::

source: The value: `AUTO` can be used for automatic styling.
fr: LA valeur : `AUTO` peut être utilisée pour le stylage automatique.

source: Automatic styling can be provided by the driver. Currently, only the OGR driver supports automatic styling.
fr: Le stylage automatique peut être fourni par le pilote. Actuellement, le pilote OGR supporte le stylage automatique

source: When used for a :ref:`union`, the styles from the source layers will be used.
fr: Quand ils sont utilisés pour une :ref:`union`, les styles des couches source seront utilisés.

source: The scale at which symbols and/or text appear full size. This allows for dynamic scaling of objects based on the scale of the map. If not set then this layer will always appear at the same size. Scaling only takes place within the limits of MINSIZE and MAXSIZE as described above. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000. Implemented in MapServer 5.0, to replace the deprecated SYMBOLSCALE parameter.
fr: L'échelle à laquelle les symboles et/ou les textes apparaissent à leur taille normale. Cela permet une échelle dynamique des objets en fonction de l'échelle de la carte. S'il n'est pas défini alors cette couche apparaitra toujours à la même taille. La mise à l'échelle a lieu seulement entre les limites comprises entre MINSIZE et MAXSIZE comme décrit plus haut. L'échelle est donnée comme le dénominateur de la fraction de l'échelle, par exemple, pour une carte à l'échelle de 1:24 000 utilisez 24000. Implémenté dans MapServer 5.0, pour remplacer le paramètre déprécié SYMBOLSCALE.

source: Since MapServer 5.0 the proper parameter to use is SYMBOLSCALEDENOM instead. The deprecated SYMBOLSCALE is the scale at which symbols and/or text appear full size. This allows for dynamic scaling of objects based on the scale of the map. If not set then this layer will always appear at the same size. Scaling only takes place within the limits of MINSIZE and MAXSIZE as described above. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000.
fr: Depuis MapServer 5.0 le paramètre correct à utiliser est SYMBOLSCALEDENOM. Le paramètre SYMBOLSCALE déprécié est l'échelle à laquelle les symboles et/ou les textes apparaissent à leur taille normale.Cela permet une échelle dynamique des objets en fonction de l'échelle de la carte. S'il n'est pas défini alors cette couche apparaitra toujours à la même taille. La mise à l'échelle a lieu seulement entre les limites comprises entre MINSIZE et MAXSIZE comme décrit plus haut. L'échelle est donnée comme le dénominateur de la fraction de l'échelle, par exemple, pour une carte à l'échelle de 1:24 000 utilisez 24000. Implémenté dans MapServer 5.0, pour remplacer le paramètre déprécié SYMBOLSCALE.

source: Used as a global alternative to :ref:`CLASS` `TEMPLATE`. See :ref:`template` for more info.
fr: Utilisé comme une alternative globale au `TEMPLATE` :ref:`CLASS`. Voir la partie :ref:`template` pour plus d'informations.

source: Name of the tileindex file or layer. A tileindex is similar to an ArcInfo library index. The tileindex contains polygon features for each tile. The item that contains the location of the tiled data is given using the TILEITEM parameter. When a file is used as the tileindex for shapefile or raster layers, the tileindex should be a shapefile. For CONNECTIONTYPE OGR layers, any OGR supported datasource can be a tileindex. Normally the location should contain the path to the tile file relative to the shapepath, not relative to the tileindex itself. If the DATA parameter contains a value then it is added to the end of the location. When a tileindex layer is used, it works similarly to directly referring to a file, but any supported feature source can be used (ie. postgres, oracle).
fr: Nom du fichier d'index de tuile ou de la couche. Un index de tuile est similaire à un index de bibliothèque d'ArcInfo. L'index de tuile contient des objets polygones pour chaque tuile. Le champ qui contient la localisation des données tuilées est données par le paramètre TILEITEM. Quand un fichier est utilisé comme index de tuile pour des couches shapefile ou raster, l'index de tuile doit être un shapefile. Pour les couches OGR avec CONNECTIONTYPE, n'importe quelle source de données gérée par OGR peut être un index de tuile. Normallement la localisation doit contenir le chemin vers le fichier tuile relatif au shapepath, non à l'index de tuile lui-même. Si le paramètre DATA contient une valeur alors il est ajouté à la fin de la localisation. Quand une couche d'index de tuile est utilisée, elle fonctionne de la même manière qu'en référençant directement un fichier, mais n'importe quel source de données peut être utilisé (ie. postgres, oracle).

source: All files in the tileindex should have the same coordinate system, and for vector files the same set of attributes in the same order.
fr: Tous les fichiers dans l'index de tuile doivent avoir le même système de coordonnées, et pour les fichiers vecteurs le même nombre d'attribut et dans le même ordre.

source: Item that contains the location of an individual tile, default is "location".
fr: Champ qui contient la localisation d'une tuile individuelle, "location" par défaut.
