Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapfile.po
Languages: fr

source: When the numerical operations above are used like logical operations, the following rule applies: values equal to zero will be taken as 'false' and everything else will be 'true'. That means the expression
fr: Quand les opérations numériques ci-dessus sont utilisées comme des opérations logiques, la régle suivante s'applique : les valeurs égales à zéro seront prises comme 'false' et tous les autres cas renvoierons 'true'. Ce qui signifie que l'expression

source: would return true, but
fr: devrait retourner vrai, mais

source: would return false.
fr: retournera en fait faux

source: Spatial functions that return a number (GEOS)
fr: Fonctions spatiales qui retournent un nombre (GEOS)

source: area ( shape1 )
fr: area ( forme1 )

source: returns the area of shape1
fr: retourne l'aire de forme1

source: Spatial functions that return a shape (GEOS)
fr: Fonctions spatiales qui retournent une forme (GEOS)

source: fromtext ( "String1" )
fr: fromtext ( "Chaine1" )

source: returns the shape corresponding to String1 (WKT - well known text)
fr: retourne la forme correspondante à la Chaine1 (WKT - well known text)

source: buffer (shape1 , n1 )
fr: buffer (forme1 , n1 )

source: returns the shape that results when shape1 is buffered with bufferdistance n1
fr: retourne la forme qui résulte quand on appliqué à la forme1 un tampon d'une distance n1

source: difference ( shape1 , shape2 )
fr: difference ( forme1 , forme2 )

source: returns the shape that results when the common area of shape1 and shape2 is subtracted from shape1
fr: retourne la forme qui résulte quand l'aire commune à la forme1 et à la forme2 est soustraite de la forme1

source: Temporal expressions
fr: Expressions temporelles

source: MapServer uses an internal time type to do comparison. To convert a string into this time type it will check the list below from the top and down to check if the specified time matches, and if so, it will do the conversion. The following are integer values: **YYYY** - year, **MM** - month, **DD** - date, **hh** - hours, **mm** - minutes, **ss** - seconds. The following are character elements of the format: **-** (dash) - date separator, **:** (colon) - time separator, **T** - marks the start of the time component (ISO 8601), space - marks the end of the date and start of the time component, **Z** - zulu time (0 UTC offset).
fr: MapServer utilise un type temps interne pour faire la comparaison. Pour convertir une chaîne dans ce type temps, Mapserver va vérifier dans la liste suivante du haut vers le bas si le temps spécifié correspond, et dans ce cas, il fera la conversion. Pour les valeurs entières, on utilise: **YYYY** - année, **MM** - mois, **DD** - jour, **hh** - heures, **mm** - minutes, **ss** - secondes. Lss caractères servant à renseigner les éléments de formatage sont : **-** (tiret) - séparateur de date, **:** (deux-points) - séparateur de temps, **T** - marque le début du composant temps (ISO 8601), espace - marque la fin de la date et le début du composant temps, **Z** - GMT (Ligne de temps du méridien de Greenwich).

source: For temporal values obtained this way, the following operations are supported:
fr: Pour les valeurs temporelles obtenues de cette manière, les opérations suivantes sont supportées :

source: ( t1 == t2 ) - deprecated since 6.0
fr: ( n1 == n2 ) - déprécié depuis la version 6.0

source: returns true when the times are equal.
fr: retourne vrai quand les deux temps sont égaux.

source: returns true when the times are not equal.
fr: retourne vrai quand les deux temps ne sont pas égaux.

source: returns true when t1 is earlier than t2
fr: retourne vrai quand t1 est plus tôt que t2.

source: returns true when t1 is later than t2.
fr: retourne vrai quand t1 est plus tard que t2.

source: returns true when t1 is earlier than or equal to t2
fr: retourne vrai quand t1 est plus tôt ou égal à t2.

source: returns true when t1 is later than or equal to t2.
fr: retourne vrai quand t1 est plus tard ou égal à t2.

source: A set of xy pairs terminated with an END, for example:
fr: Un ensemble de couples xy terminés par END, par exemple :

source: POLYGON/POLYLINE layers POINTS must start and end with the same point (i.e. close the feature).
fr: Les POINTS des couches POLYGON/POLYLINE doivent comemncer et finir avec le même point (pour fermer l'entité).

source: Comma separated list of the feature attributes:
fr: Liste séparée par des virgules d'attributs d'objets :

source: Specifying the same number of items is recommended for each features of the same layer. The item names should be specified as a PROCESSING option of the layer.
fr: Définir le même nombre d'items est recommandé pour chaque objet de la même couche. Les noms de l'item doivent être défini comme option PROCESSING d'une couche.

source: String to use for labeling this feature.
fr: Chaîne de caractères à utiliser pour étiqueter cette entité.

source: A geometry expressed in OpenGIS Well Known Text geometry format. This feature is only supported if MapServer is built with OGR or GEOS support.
fr: Une géométrie au format OpenGIS "Well Known Text". Cette entité est supportée uniquement si MapServer est compilé avec la gestion d'OGR ou de GEOS.

source: Inline features should be defined as their own layers in the mapfile. If another CONNECTIONTYPE is specified in the same layer, MapServer will always use the inline features to draw the layer and ignore the other CONNECTIONTYPEs.
fr: Les entités en ligne devraient être définies comme leurs propres couches dans le mapfile. Si une autre CONNECTIONTYPE est spécifiée dans la même couche, MapServer utilisera toujours les entités en ligne pour dessiner la couche et ignorera les autres CONNECTIONTYPE.

source: `FONTSET` is a :ref:`MAP` parameter. The syntax is:
fr: `FONTSET` est un paramètre :ref:`MAP`. La syntaxe est:

source: Where `filename` gives the location of the fontset file of the system. The location of the system fontset file could for instance be /usr/share/fonts/truetype/font.list (Debian). The location can be specified using a relative or absolute path.
fr: Où `filename` donne l'emplacement du fichier fontset du système. L'emplacement du fichier fontset système pourrait par exemple être /usr/share/fonts/truetype/font.list (Debian). L'emplacement peut être spécifié en utilisant un chemin relatif ou absolu.

source: Format of the fontset file
fr: Format du fichier fontset

source: The format of the fontset file is very simple. Each line contains 2 items: An alias and the name/path of the font separated by white space. The alias is simply the name you refer to the font as in your :ref:`mapfile` (eg. times-bold). The name is the actual name of the TrueType file. If not full path then it is interpreted as relative to the location of the fontset. Here's the fontset I use (the font.list file and all .ttf files are stored in the same sub-directory).
fr: Le format est très simple. Chaque ligne contient deux items : un alias et le nom/chemin vers la police séparé par un espace. L'alias est simplement le nom auquel vous vous référez dans votre :ref:`mapfile` (par exemple times-bold). Le nom est le nom réel du fichier TrueType. Si ce n'est pas un chemin complet alors il sera interprété comme relatif à la localisation du fontset. Voici le fontset que j'utilise (le fichier font.list et tous les fichiers .ttf sont stockés dans le même sous-répertoire).

source: Aliases are case sensitive. Excellent reference information about the TrueType format and online font resources is available from the `FreeType`_.
fr: Les alias sont sensible à la casse. Une très bonne référence sur le format TrueType et les polices est disponible sur le site `FreeType`_.

source: Format of the label. "DD" for degrees, "DDMM" for degrees minutes, and "DDMMSS" for degrees, minutes, seconds. A C-style formatting string is also allowed, such as "%g°" to show decimal degrees with a degree symbol. The default is decimal display of whatever SRS you're rendering the GRID with.
fr: Format de l'étiquette. "DD" pour des degrés, "DDMM" pour des degrés minutes et "DDMMSS" pour des degrés minutes secondes. Une chaîne formattée à la manière du C est également permise, par exemple "%g°" pour afficher des degrés décimaux avec un symbole "degré". La valeur par défaut est l'affichage des décimales quel que soit le rendu de GRID.

source: The minimum number of arcs to draw. Increase this parameter to get more lines. Optional.
fr: Le nombre minimal d'arcs à dessiner. Augmentez ce paramètre pour générer plus de lignes. Optionnel.

source: The maximum number of arcs to draw. Decrease this parameter to get fewer lines. Optional.
fr: Le nombre maximal d'arcs à dessiner. Diminuez ce paramètre pour générer moins de lignes. Optionnel.

source: The minimum number of intervals to try to use. The distance between the grid lines, in the units of the grid's coordinate system. Optional.
fr: Le nombre minimal d'intervalles à utiliser. Il s'agit de la distance entre les lignes de la grille, dans l'unité du système de coordonnées de la grille. Optionnel.

source: The maximum number of intervals to try to use. The distance between the grid lines, in the units of the grid's coordinate system. Optional.
fr: Le nombre maximal d'intervalles à utiliser. Il s'agit de la distance entre les lignes de la grille, dans l'unité du système de coordonnées de la grille. Optionnel.

source: The minimum number of segments to use when rendering an arc. If the lines should be very curved, use this to smooth the lines by adding more segments. Optional.
fr: Le nombre minimal de segments à utiliser pour générer un arc. Si les lignes doivent être très incurvées, utilisez cette option pour adoucir les lignes en ajoutant plus de segments. Optionnel.

source: The maximum number of segments to use when rendering an arc. If the graticule should be very straight, use this to minimize the number of points for faster rendering. Optional, default 256.
fr: Le nombre maximal de segments à utiliser pour générer un arc. Si le graticule doit être très droit, utilisez cette option pour diminuer le nombre de points et obtenir un rendu plus rapide. Optionnel, 256 par défaut.

source: The following is an example of a GRID object in use:
fr: Ci-dessous est un exemple d'objet GRID :

source: When this directive is encountered parsing switches to the included file immediately. As a result the included file can be comprised of any valid mapfile syntax. For example:
fr: Quand cette commande est rencontrée pendant la lecture du mapfile, le fichier inclus est immédiatement lu. En conséquence, le fichier inclus peut être composé d'une syntaxe de mapfile valide. Par exemple :

source: Performance does not seem to be seriously impacted with limited use, however in high performance instances you may want to use includes in a pre-processing step to build a production mapfile. The C pre-processor can also be used (albeit with a different syntax) and is far more powerful.
fr: Les performances ne semblent pas être très diminuées lors d'une utilisation limitée, cependant dans des sessions à haute charge vous devriez utiliser les INCLUDE dans une étape intermédiaire avant de construire le mapfile de production. Le pré-processeur C peut également être utilisé (mais avec une syntaxe différente) et est beaucoup plus puissant.

source: Notes
fr: Remarques

source: Supported in versions 4.10 and higher.
fr: Géré dans les versions 4.10 et supérieures.

source: The name of the file to be included **MUST be quoted** (single or double quotes).
fr: Le nom du fichier à inclure **DOIT être entre guillemets** (simples ou doubles).

source: Includes may be nested, up to 5 deep.
fr: Les inclusions peuvent être imbriquées, jusqu'à 5.

source: File location can be given as a full path to the file, or (in MapServer >= 4.10.1) as a path relative to the mapfile.
fr: L'emplacement du fichier peut être donné par un chemin complet vers le fichier ou (dans MapServer >= 4.10.1) par un chemin relatif au mapfile.

source: Debugging can be problematic because:
fr: Déboguer peut être problématique car :

source: the file an error occurs in does not get output to the user
fr: une erreur dans le fichier n'est pas renvoyée à l'utilisateur

source: the line number counter is not reset for each file. Here is one possible error that is thrown when the include file cannot be found:
fr: le compteur du nombre de lignes n'est pas remis à zéro pour chaque fichier. Ci-dessous une des erreurs possibles qui se produit quand le fichier à inclure ne peut pas être trouvé :

source: Example
fr: Exemple

source: where test_include_symbols.map contains:
fr: où test_include_symbols.map contient :

source: and test_include_layer.map contains:
fr: et où test_include_layer.map contient :

source: The Mapfile is the heart of MapServer. It defines the relationships between objects, points MapServer to where data are located and defines how things are to be drawn.
fr: Le mapfile est le coeur de MapServer. Il définit les relations entre les objets, indique à MapServer où se trouvent les données et définit la façon dont elles seront dessinées.

source: The Mapfile consists of a :ref:`MAP` object, which has to start with the word `MAP`.
fr: Le Mapfile consiste en un objet :ref:`MAP`, qui doit commencer avec le mot `MAP`.

source: There are some important concepts that you must understand before you can reliably use mapfiles to configure MapServer. First is the concept of a :ref:`LAYER`. A layer is the combination of data plus styling. Data, in the form of attributes plus geometry, are given styling using :ref:`CLASS` and :ref:`STYLE` directives.
fr: Il y a quelques concepts importants que vous devez comprendre avant de pouvoir utiliser les mapfiles efficacement pour configurer MapServer. Le premier concept est celui de :ref:`LAYER`. Une couche est une combinaison de données et de styles. Les données, composées d'attributs et d'une géométrie, sont stylées en utilisant les directives :ref:`CLASS` et :ref:`STYLE`.

source: The Mapfile is NOT case-sensitive.
fr: Le mapfile N'EST PAS sensible à la casse.

source: The ``Mapfile is read from top to bottom by MapServer``; this means that LAYERs near the top of your Mapfile will be drawn before those near the bottom. Therefore users commonly place background imagery and other background layer types near the top of their mapfile, and lines and points near the bottom of their mapfile.
fr: Le ``Mapfile est lu du haut vers le bas par MapServer``; cela signifie que les LAYERs proche du haut de votre Mapfile seront dessinées avant celles proches du bas. Par conséquent, les utilisateurs placeront communément les images raster et les autres types de couches de fond près du haut de leur mapfile, et les lignes et points près du bas de leur mapfile.

source: Strings containing non-alphanumeric characters or a MapServer keyword MUST be quoted. It is recommended to put ALL strings in double-quotes.
fr: Les chaînes de caractères contenant des caractères non alphanumériques ou un mot clé de MapServer DOIVENT être placées entre guillemets ("quotes"). Il est recommandé de placer TOUTES les chaînes de caractères entre doubles apostrophes (double-quotes).

source: For MapServer versions < 5, there was a default maximum of 200 layers per mapfile (there is no layer limit with MapServer >= 5). This can be changed by editing the map.h file to change the value of MS_MAXLAYERS to the desired number and recompiling. Here are other important default limits when using a MapServer version < 5:
fr: Pour les versions de MapServer < 5, il y a une limite par défaut de 200 couches maximum par mapfile (il n'y a pas de limite de couches avec MapServer >= 5). Cela peut être changé en éditant le fichier map.h, en modifiant la valeur de MS_MAXLAYERS puis en recompilant MapServer. Il y a d'autres limites importantes par défaut dans MapServer < 5 :

source: MAXCLASSES 250 (set in map.h)
fr: MAXCLASSES 250 (définie dans map.h)

source: MAXSTYLES 5 (set in map.h)
fr: MAXSTYLES 5 (définie dans map.h)

source: MAXSYMBOLS 64 (set in mapsymbol.h)
fr: MAXSYMBOLS 64 (définie dans mapsymbol.h)

source: MapServer versions >= 5 have no limits for classes, styles, symbols, or layers.
fr: Les versions de MapServer >= 5 n'ont pas de limites pour les classes, styles, symboles et couches.

source: File paths may be given as absolute paths, or as paths relative to the location of the mapfile. In addition, data files may be specified relative to the SHAPEPATH.
fr: Les chemins de fichier peuvent être donnés en chemins absolus, ou en chemins relatifs par rapport à l'emplacement du mapfile. De plus, les fichiers de données doivent être spécifiés relativement au SHAPEPATH.

source: The mapfile has a hierarchical structure, with the MAP object being the "root". All other objects fall under this one.
fr: Le mapfile a une structure hiérarchisée, avec l'objet Map constituant la racine ("root"). Tous les autres objets sont rattachés à celui-ci.

source: Comments are designated with a #.
fr: Les commentaires sont indiqués par le caractère #.

source: Attributes are named using the following syntax: [ATTRIBUTENAME].
fr: Les attributs sont désignés en utilisant la syntaxe suivante : [ATTRIBUTENAME]

source: that the name of the attribute included between the square brackets *IS CASE SENSITIVE*. Generally ESRI generated shape data sets have their attributes (.dbf column names) all in upper-case for instance, and for PostGIS, *ALWAYS* use lower-case.
fr: Le nom de l'attribut entre les crochets *EST* sensible à la casse. Généralement les fichiers shape ESRI ont leurs propres attributs (noms de colonnes .dbf) en majuscules, et pour PostGIS, les minuscules sont *TOUJOURS* utilisées.

source: MapServer Regular Expressions are used through the operating system's C Library. For information on how to use and write Regular Expressions on your system, you should read the documentation provided with your C Library. On Linux, this is GLibC, and you can read "man 7 regex" ... This man page is also available on most UNIX's. Since these RegEx's are POSIX compliant, they should be the same on Windows as well, so windows users can try searching the web for "man 7 regex" since man pages are available all over the web.
fr: Les expressions régulières dans MapServer sont utilisées à travers la bibliothèque C du système d'exploitation. Pour plus d'informations sur l'utilisation et la syntaxe de votre système, vous devriez lire la documentation fournie avec votre bibliothèque C. Sur Linux il s'agit de la GLibC et vous pouvez lire "man 7 regex"... Cette page d'aide est disponible sous différents systèmes UNIX. Comme ces expressions régulières sont conformes à POSIX, elles devraient être identiques sous Windows, aussi les utilisateurs Windows peuvent essayer de rechercher sur Internet "man 7 regex" puisque ces pages y sont disponibles.

source: Joins are defined within a :ref:`layer` object. It is important to understand that JOINs are *ONLY* available once a query has been processed. You cannot use joins to affect the look of a map. The primary purpose is to enable lookup tables for coded data (e.g. 1 => Forest) but there are other possible uses.
fr: Les jointures sont définies au sein d'un objet LAYER. Il est important de comprendre que les jointures sont *UNIQUEMENT* disponibles une fois qu'une requête a été exécutée. Vous ne pouvez pas utiliser les jointures pour modifier l'apparence d'une carte. L'objectif principal est de permettre de lier une table à des données codées (par exemple 1 => Forêt) mais d'autres utilisations sont possibles.

source: Supported Formats
fr: Formats gérés

source: DBF/XBase files
fr: fichiers DBF/XBase

source: CSV (comma delimited text file)
fr: CSV (Fichier texte délimité par des virgules)

source: PostgreSQL tables
fr: tables PostgreSQL et PostGIS

source: MySQL tables
fr: tables MySQL

source: Mapfile Parameters:
fr: Paramètres du Mapfile

source: Parameters required for the join table's database connection (not required for DBF or CSV joins). The following is an example connection for :ref:`PostgreSQL <input_postgis>`:
fr: Paramètres nécessaires pour effectuer la jointure sur une base de données (non nécessaires pour des jointures vers DBF ou CSV). L'exemple suivant est pour :ref:`PostgreSQL <input_postgis>` :

source: Type of connection (not required for DBF joins). For PostgreSQL use `postgresql`, for CSV use `csv`, for MySQL use `mysql`.
fr: Type de connexion (non nécessaire pour des jointures vers DBF). Pour PostgreSQL, utiliser `postgresql`, pour CSV, `csv`, pour MySQL, `mysql`.:

source: Template to use *after* a layer's set of results have been sent. In other words, this header HTML will be displayed after the contents of the `TEMPLATE` HTML.
fr: Modèle ("template") à utiliser *après* qu'un jeu de résultats de couche ait été envoyé. En d'autres termes, l'en-tête HTML sera affiché après le contenu du modèle `TEMPLATE` HTML.

source: Join item in the dataset. This is case sensitive.
fr: Objet de jointure dans les données. Sensible à la casse.

source: Template to use *before* a layer's set of results have been sent. In other words, this header HTML will be displayed before the contents of the `TEMPLATE` HTML.
fr: Modèle ("template") à utiliser *avant* qu'un jeu de résultats de couche ait été envoyé. En d'autres termes, l'en-tête HTML sera affiché après le contenu du modèle `TEMPLATE` HTML.

source: Unique name for this join. Required.
fr: Nom unique de cette jointure. Obligatoire.

source: For file-based joins this is the name of XBase or comma delimited file (relative to the location of the mapfile) to join TO. For PostgreSQL support this is the name of the PostgreSQL table to join TO.
fr: Pour les jointures basées sur des fichiers, c'est le nom du XBase ou du fichier délimité (relatif à l'emplacement du mapfile) à joindre avec (TO). Pour le support de PostgreSQL, c'est le nom de la table PostgreSQL à joindre avec (TO)

source: Template to use with one-to-many joins. The template is processed once for each record and can only contain substitutions for items in the joined table. Refer to the column in the joined table in your template like [joinname_columnname], where joinname is the NAME specified for the JOIN object.
fr: Modèle ("template") à utiliser pour les jointure 1-n (1 vers plusieurs). Le modèle est généré une fois pour chaque enregistrement et ne peut contenir que des substitutions pour les objets de la table jointe. Faites référence à la colonne de la table jointe dans votre modèle comme ceci : [joinname_columnname] où "joinname" est le NAME spécifié pour l'objet JOIN.

source: Join item in the table to be joined. This is case sensitive.
fr: Objet de jointure dans la table à joindre. Sensible à la casse.

source: The type of join. Default is one-to-one.
fr: Le type de jointure. Par défaut 1-1.

source: Example 1: Join from Shape dataset to DBF file
fr: Exemple 1 : jointure d'un fichier SHP et d'un fichier DBF

source: Template
fr: Modèle

source: Example 2: Join from Shape dataset to PostgreSQL table
fr: Exemple 2 : jointure d'un fichier SHP et d'une table PostgreSQL

source: Example 3: Join from Shape dataset to CSV file
fr: Exemple 3 : jointure d'un fichier SHP et d'un fichier CSV

source: CSV File Structure
fr: Structure du fichier CSV
