Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapfile.po
Languages: fr

source: Color to use for non-transparent symbols.
fr: Couleur à utiliser pour les symboles non transparents.

source: Color to use for drawing features.
fr: Couleur à utiliser pour dessiner les entités.

source: Enables debugging of the class object. Verbose output is generated and sent to the standard error output (STDERR) or the MapServer logfile if one is set using the `LOG` parameter in the :ref:`WEB` object.
fr: Active le débogage de l'objet classe. Une sortie verbeuse est générée et envoyée au canal de sortie standard des erreurs (STDERR) ou vers le fichier de trace de MapServer si celui-ci est précisé dans le paramètre `LOG` de l'objet :ref:`WEB`.

source: Four types of expressions are now supported to define which class a feature belongs to: String comparisons, regular expressions, logical expressions, and string functions (see :ref:`EXPRESSIONS`). If no expression is given, then all features are said to belong to this class.
fr: Quatre types d'expressions sont maintenant supportées pour définir l'appartenance à une classe. Les comparaisons de chaînes, les expressions régulières, les expressions logiques simples et les fonctions de chaînes. Si aucune expression n'est donnée, alors toutes les entités sont considérées comme appartenant à cette classe.

source: String comparisons are case sensitive and are the fastest to evaluate. No special delimiters are necessary although strings must be quoted if they contain special characters. (As a matter of good habit, it is recommended that you quote all strings). The attribute to use for comparison is defined in the :ref:`LAYER` `CLASSITEM` parameter.
fr: Les comparaisons de chaînes sont sensibles à la casse et sont les plus rapides à analyser. Il n'y a pas de caractère délimiteur à utiliser cependant la chaîne doit être entre quotes si elle contient des caractères spéciaux (Afin de prendre de bonnes habitudes, il est recommandé de mettre entre quotes toutes vos chaînes). L'attribut à utiliser pour comparaison est défini dans le paramètre `CLASSITEM` de la couche :ref:`LAYER`.

source: Regular expression are limited using slashes (/regex/). The attribute to use for comparison is defined in the :ref:`LAYER` `CLASSITEM` parameter.
fr: Les expressions régulières sont délimitées en utilisant les slashes (/regex/). L'attribut à utiliser pour comparaison est définidans le paramètre `CLASSITEM` de la couche :ref:`LAYER`.

source: Logical expressions allow the building of fairly complex tests based on one or more attributes and therefore are only available with shapefiles. Logical expressions are delimited by parentheses "(expression)". Attribute names are delimited by square brackets "[ATTRIBUTE]". Attribute names are case sensitive and must match the items in the shapefile. For example:
fr: Les expressions logiques vous permettent de construire des tests assez complexes basés sur un ou plusieurs attributs et sont donc seulement utilisables avec les fichiers Shape. Les expressions logiques sont délimitées par des parenthèses "(expression)". Les noms des attributs sont délimités par des crochets "[ATTRIBUT]". Ces noms sont sensibles à la casse et doivent correspondre aux objets dans le fichier Shape. Par exemple :

source: The following logical operators are supported: =, >, <, <=, >=, =, or, and, lt, gt, ge, le, eq, ne, in, ~, ~\*. As one might expect, this level of complexity is slower to process.
fr: Les opérateurs logiques suivants sont supportés : =, >, <, <=, >=, =, or, and, lt, gt, ge, le, eq, ne, in, ~, ~\*. Comme vous pouvez vous y attendre, ce niveau de complexité est plus lent à traiter.

source: One string function exists: length(). It computes the length of a string:
fr: Une fonction de chaînes existe : length(). Elle calcule évidemment la longueur d'une chaîne:

source: String comparisons and regular expressions work from the classitem defined at the layer level. You may mix expression types within the different classes of a layer.
fr: Les comparaisons de chaînes et les expressions régulières fonctionnent avec le "classitem" défini au niveau de la couche. Vous pouvez mélanger les types d'expressions avec les différentes classes d'une couche.

source: Allows for grouping of classes. It is only used when a `CLASSGROUP` at the :ref:`LAYER` level is set. If the `CLASSGROUP` parameter is set, only classes that have the same group name would be considered at rendering time. An example of a layer with grouped classes might contain:
fr: Permet de grouper des classes. C'est utilisé seulement si CLASSGROUP est défini au niveau de :ref:`LAYER`. Si le paramètre CLASSGROUP est défini, seules les classes qui ont le même nom de groupe seront considérées pour l'affichage. Voici un exemple de couche avec des classes groupées :

source: Full filename of the legend image for the :ref:`CLASS`. This image is used when building a legend (or requesting a legend icon via MapScript or the :ref:`CGI application <cgi>`).
fr: Nom complet du fichier image de la légende pour la :ref:`CLASS`. Cette image est utilisée lors de la construction de la légende (ou lors de la demande d'une icône de légende via MapScript ou :ref:`l'application CGI <cgi>`).

source: Signals the start of a :ref:`LABEL` object.
fr: Indique le commencement d'un objet :ref:`LABEL`.

source: Minimum scale at which this :ref:`CLASS` is drawn. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000. Implemented in MapServer 5.0, to replace the deprecated `MAXSCALE` parameter.
fr: Échelle maximale pour laquelle la :ref:`CLASS` est dessinée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000. Implémenté dans MapServer 5.0 pour remplacer le paramètre obsolète `MAXSCALE`.

source: Since MapServer 5.0 the proper parameter to use is `MAXSCALEDENOM` instead. The deprecated `MAXSCALE` is the minimum scale at which this class is drawn. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000.
fr: Depuis MapServer 5.0 le bon paramètre à utiliser à la place de celui-ci est `MAXSCALEDENOM`. `MAXSCALE` (obsolète) était l'échelle maximale pour laquelle la CLASS était dessinée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000.

source: Maximum size in pixels to draw a symbol. Default is 50. See :ref:`LAYER` :ref:`SYMBOLSCALEDENOM <symbolscaledenom>`.
fr: Taille maximale en pixels pour dessiner un symbole. Par défaut, elle est de 50.

source: Maximum scale at which this :ref:`CLASS` is drawn. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000. Implemented in MapServer 5.0, to replace the deprecated `MINSCALE` parameter.
fr: L'échelle minimale pour laquelle la :ref:`CLASS` est dessinée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000. Implémenté dans MapServer 5.0 pour remplacer le paramètre obsolète `MINSCALE`.

source: Since MapServer 5.0 the proper parameter to use is `MINSCALEDENOM` instead. The deprecated `MINSCALE` is the maximum scale at which this CLASS is drawn. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000.
fr: Depuis MapServer 5.0 le bon paramètre à utiliser à la place de celui-ci est `MINSCALEDENOM`. `MINSCALE` (obsolète) était l'échelle minimale pour laquelle la CLASS était dessinée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000.

source: Minimum size in pixels to draw a symbol. Default is 0. See :ref:`LAYER` :ref:`SYMBOLSCALEDENOM <symbolscaledenom>`.
fr: Taille minimale en pixels pour dessiner un symbole. Le défaut est de 0. Voir :ref:`SYMBOLSCALEDENOM <symbolscaledenom>` de la couche :ref:`LAYER`.

source: Name to use in legends for this class. If not set class won't show up in legend.
fr: Nom à utiliser dans les légendes pour cette CLASS. Si ce n'est pas défini, la CLASS n'apparaitra pas dans une légende.

source: Color to use for outlining polygons and certain marker symbols. Line symbols do not support outline colors.
fr: Couleur à utiliser pour les contours des polygones et certains symboles de marquage. Les symboles de ligne ne gèrent pas ce paramètre.

source: Height, in pixels, of the symbol/pattern to be used. Only useful with scalable symbols. For `vector` (and `ellipse`) :ref:`SYMBOL` `TYPE`\s the default size is based on the range of Y values in the `POINTS` defining the symbol. For symbols of type `pixmap`, the default is the vertical size of the image. Default size is 1 for TTF symbols.
fr: Hauteur, en pixels, du symbole/motif à utiliser. Seulement utile avec les symboles re-échantillonables. Pour les symboles de type vecteur (et ellipse), la taille par défaut est basée sur la gamme des valeurs de Y dans les POINTS définissant le symbole. Pour les rasters, le défaut est la taille verticale de l'image. La taille par défaut est de 1 pour les symboles TTF.

source: Sets the current display status of the class. Default turns the class on.
fr: Définit le statut d'affichage actuelle de la CLASS. Par défaut la CLASS est activée.

source: Signals the start of a :ref:`STYLE` object. A class can contain multiple styles. Multiple styles can be used create complex symbols (by overlay/stacking). See :ref:`sym_construction` for more information on advanced symbol construction.
fr: Indique le commencement d'un objet :ref:`STYLE`. Une CLASS peut contenir plusieurs styles. De multiple styles peuvent être utilisés pour créer des symboles complexes (en superposant/empilant). Voir :ref:`sym_construction` pour plus d'informations sur la construction des symboles avancés.

source: The symbol name or number to use for all features if attribute tables are not used. The number is the index of the symbol in the symbol file, starting at 1, the 5th symbol in the file is therefore symbol number 5. You can also give your symbols names using the `NAME` parameter in the symbol definition file, and use those to refer to them. Default is 0, which results in a single pixel, single width line, or solid polygon fill, depending on layer type.
fr: Le nom du symbole ou le numéro à utiliser pour toutes les entités si les tables d'attributs ne sont pas utilisées. Le numéro est l'index du symbole dans le fichier de symboles, celui-ci commence à 1, le 5ième symbole dans le fichier est donc le symbole numéro 5. Vous pouvez aussi donner des noms à vos symboles en utilisant le mot-clé NAME dans le fichier de définition des symboles puis l'utiliser pour y faire référence. 0 est la valeur par défaut ce qui produit un simple pixel, une ligne simple fine ou un polygone plein selon le type de la couche.

source: You can also specify a gif or png filename. The path is relative to the location of the mapfile.
fr: Vous pouvez aussi spécifier un fichier GIF ou PNG. Le chemin est relatif à l'emplacement du mapfile.

source: See :ref:`sym_construction` for more information on advanced symbol construction.
fr: Voir :ref:`sym_construction` pour plus d'informations sur la construction des symboles avancés.

source: Template file or URL to use in presenting query results to the user. See :ref:`template` for more info.
fr: Fichier template ou URL à utiliser pour présenter les résultats des requêtes à l'utilisateur. Voyez la référence :ref:`template` pour plus d'informations.

source: Text to label features in this class with. This overrides values obtained from the :ref:`layer` `LABELITEM`. The string can contain references to feature attributes. This allows you to concatenate multiple attributes into a single label. You can for example concatenate the attributes FIRSTNAME and LASTNAME like this::
fr: Texte fixe pour étiqueter les entités de cette classe. Ceci écrase les valeurs obtenues par LABELITEM. La chaîne de caractères peut être donnée comme une expression délimitée par des parenthèses. Ceci vous permet de concaténer plusieurs attributs en une seule étiquette. Par exemple, vous pouvez concaténer les attributs FIRSTNAME et LASTNAME comme ceci::

source: More advanced :ref:`EXPRESSIONS` can be used to specify the labels. Since version 6.0, there are functions available for formatting numbers::
fr: Des :ref:`EXPRESSIONS` plus avancées peuvent être utilisées pour spécifier les étiquettes. A partir de la version 6.0, il y a des fonctions disponibles pour le formatage des nombres::

source: Signals the start of a `VALIDATION` block.
fr: Indique lle commencement d'un bloc `VALIDATION`

source: As of MapServer 5.4.0, `VALIDATION` blocks are the preferred mechanism for specifying validation patterns for CGI param runtime substitutions. See :ref:`RUNSUB`.
fr: A partir de MapServer 5.4.0, les blocs `VALIDATION` sont le mécanisme préféré pour spécifier les patterns de validation pour les paramètres CGI de substitution de variables. Voir la :ref:`RUNSUB`.

source: Although the recommended way of making stacked symbols to achieve interesting effects is to use `STYLE`\s, you can also "stack" 2 symbols without using `STYLE`\s. You define the second symbol, which effectively sits "on top" of the first symbol (as defined above).
fr: Bien que la manière recommandée de construire des symboles superposés pour obtenir des effets intéressants soit d'utiliser les `STYLE`\s, vous pouvez aussi "empilés" 2 symboles sans utiliser les `STYLE`\s. Vous définissez le second symbole, qui est mis sur "le dessus" du premier symbole (comme défini ci-dessus).

source: The following parameters allow you to define the second symbol, and they are equivalent to their non-overlay counterparts:
fr: Les paramètres suivants vous permettent de définir le symbole. Ils sont équivalents à leurs contreparties non recouvrables :

source: Since version 6.0, MapServer has the ability to combine multiple features from a point layer into single (aggregated) features based on their relative positions. Only *POINT* layers are supported. This feature was added through :ref:`rfc69`.
fr: Depuis la version 6.0, Mapserver a la capcité de combiner plusieurs objets d'une couche ponctuelle en un seul (par aggrégation) à partir de leurs positions relatives. Seules les couches *POINT* sont supportées. Cette fonctionnalité a été ajoutée via la :ref:`rfc69`.

source: Supported Layer Types
fr: Types de couches supportés

source: Mapfile Parameters
fr: Paramètres du Mapfile

source: Specifies the distance of the search region (rectangle or ellipse) in pixel positions.
fr: Spécifier la distance de la région de recherche (rectangle ou ellipse) par la position en pixel

source: Defines the search region around a feature in which the neighbouring features are negotiated. Can be 'rectangle' or 'ellipse'.
fr: Définit la région de recherche autour d'un objet dans lequel les objets de voisins sont négociés. Cela peut être un 'rectangle' ou une 'ellipse'.

source: Defines a buffer region around the map extent in pixels. Default is 0. Using a buffer allows that the neighbouring shapes around the map are also considered during the cluster creation.
fr: Définit une région tampon autour de l'étendue de la carte en pixels. La valeur par défaut est 0. Utiliser un tampon permet que les formes avoisinantes de la carte soit aussi prises en compte pendant la création du cluster.

source: This expression evaluates to a string and only the features that have the same group value are negotiated. This parameter can be omitted. The evaluated group value is available in the 'Cluster:Group' feature attribute.
fr: Cette expression est évaluée comme une chaîne de caractères et seuls les objets qui ont la même valeur de groupe sont négociés. Ce paramètre peut être omis. La valeur du groupe évalué est disponible dans l'attribut de l'objet 'Cluster:Group'.

source: We can define the FILTER expression filter some of the features from the final output. This expression evaluates to a boolean value and if this value is false the corresponding shape is filtered out. This expression is evaluated after the the feature negotiation is completed, therefore the 'Cluster:FeatureCount' parameter can also be used, which provides the option to filter the shapes having too many or to few neighbors within the search region.
fr: Nous pouvons définir l'expression FILTER pour filtrer quelques objets du résultat final. Cette expression est évaluée comme un booléen et si cette valeur est fausse, la forme correspondante est enlevée de la sortie. Cette expression est évaluée après que la négociation de l'objet soit complétée, par conséquent le paramètre 'Cluster:FeatureCount' peut aussi être utilisé, ce qui fournit l'option de filtrer les formes ayant trop ou pas assez de voisins à l'intérieur de la région de recherche.

source: Mapfile Snippet
fr: Extrait de mapfile

source: Feature attributes
fr: Attributs des entités

source: The clustered layer itself provides the following aggregated attributes:
fr: La couche regroupée elle-même fournies les attributs agrégés suivants :

source: Cluster:FeatureCount - count of the features in the clustered shape
fr: Cluster:FeatureCount - nombre d'objets dans la forme regroupée

source: Cluster:Group - The group value of the cluster (to which the group expression is evaluated)
fr: Cluster:Group - La valeur du groupe du regroupement (pour laquelle l'expression group est évaluée)

source: These attributes (in addition to the attributes provided by the original data source) can be used to configure the labels of the features and can also be used in expressions. The ITEMS processing option can be used to specify a subset of the attributes from the original layer in the query operations according to the user's preference.
fr: Ces attributs (en plus de ceux forunis par la source de données originale) peuvent être utilisés pour configurer les étiquettes des objets et peuvent également être utilisés dans les expressions. L'option de traitement ITEMS peut être utilisée pour spécifier une sous-ensemble des attributs de la couche originale dans les opérations d'interrogation en fonction de la préférence utilisateur.

source: We can use simple aggregate functions (Min, Max, Sum, Count) to specify how the clustered attribute should be calculated from the original attributes. The aggregate function should be specified as a prefix separated by ':' in the attibute definition, like: [Max:itemname]. If we don't specify aggregate functions for the source layer attributes, then the actual value of the cluster attribute will be non-deterministic if the cluster contains multiple shapes with different values. The Count aggregate function in fact provides the same value as Cluster:FeatureCount.
fr: Nous pouvons utiliser les fonctions d'aggrégats simples (Min, Max, Sum, Count) pour spécifier comment l'attribut regroupé devrait être calculé à partir des attributs originaux. La fonction d'agrégat devrait être spécifiée avec un préfixe séparé par ':' dans la définition de l'attribut, comme: [Max:nomitem]. Si nous ne spécifions pas de fonctions d'aggrégat pour les attributs de la couche source, alors la valeur actuelle de de l'attribut regroupé ne sera pas significatif si le regroupement contient plusieurs formes avec différentes valeurs. La fonction d'agrégat Count fournit en fait la même valeur que Cluster:FeatureCount.

source: PHP MapScript Usage
fr: Usage avec PHP MapScript

source: The :ref:`CLUSTER object <phpclusterobj>` is exposed through PHP MapScript. An example follows:
fr: :ref:`L'objet CLUSTER <phpclusterobj>` est exposé via PHP MapScript. Un exemple suit:

source: Example: Clustering Railway Stations
fr: Exemple: regroupement des gares

source: The following example uses a point datasource, in this case in KML format, to display clusters of railway stations. Two classes are used: one to style and label the cluster, and one to style and label the single railway station.
fr: L'exemple suivant utilise une source ponctuelle, dans ce cas en format KML, pour afficher les regroupements de gares. Deux classes sont utilisées: une pour styler et étiqueter le regroupement, l'autre pour styler et étiqueter la gare simple.

source: Since we can't declare 2 labelitems, for the single railway class we use the *TEXT* parameter to label the station.
fr: Comme nous ne pouvons pas utiliser 2 "labelitems", pour la classe gare simple, nous utilisons le paramètre *TEXT* pour étiqueter la gare.

source: Mapfile Layer
fr: Couche de Mapfile

source: Map Image
fr: Image de carte

source: As of version 6.0, expressions are used in four places:
fr: A partir de la version 6.0, les expressions sont utilisées à quatre endroits :

source: In :ref:`LAYER` `FILTER` to specify the features of the dataset that are to be included in the layer.
fr: Dans le FILTER de l'objet :ref:`LAYER` pour spécifier les entités du jeu de de données qui doivent être inclus dans la couche.

source: In :ref:`CLASS` `EXPRESSION` to specify to which features of the dataset the `CLASS` applies to.
fr: Dans une `EXPRESSION` de l'objet :ref:`CLASS` spécifier à quelles entités du jeu de données la `CLASS` s'applique.

source: In :ref:`CLASS` `TEXT` to specify text for labeling features.
fr: Dans le `TEXT` de l'objet :ref:`CLASS` pour spécifier le texte pour l'étiquetage des entités.

source: In :ref:`STYLE` `GEOMTRANSFORM`.
fr: Dans `GEOMTRANSFORM` de l'objet :ref:`STYLE`.

source: String quotation
fr: Guillemets pour les chaînes de caractères

source: Stings can be quoted using single or double quotes:
fr: Les chaînes peuvent être entourées en utilisant des guillemets

source: Quotes escaping in strings
fr: Echappement des guillemets dans les chaînes

source: Quotes escaping is not supported in MapServer versions lower than 5.0.
fr: L'échappement des guillemets n'est pas supporté dans MapServer pour les versions inférieures à la version 5.0.

source: Starting with MapServer 5.0, if your dataset contains double-quotes, you can use a C-like escape sequence:
fr: A partir de MapServer 5.0, si votre jeu de données contient des guillemets doubles, vous pouvez utilisez une séquence d'échappement similaire à celle du langage C :

source: To escape a single quote use the following sequence instead:
fr: Pour échapper un guillemet simple, utilisez la séquence suivante à la place :

source: Starting with Mapserver 6.0 you don't need to escape single quotes within double qouted strings and you don't need to escape double quotes within single quoted strings. In 6.0 you can also write the string as follows:
fr: A partir de Mapserver 6.0, vous n'avez plus besoin d'échapper les guillemets simples dans les chaînes entourées de guillemets doubles et inversement. En version 6.0, vous pouvez aussi écrire la chaîne comme ceci :

source: Using attributes
fr: Utiliser les attributs

source: Attribute values can be referenced in the Map file and used in expressions. Attribute references are case sensitive and can be used in the following types of expressions:
fr: Des valeurs d'attributs peuvent être référencées dans le mapfile et utilisées dans les expressions. Les références d'attributs sont sensibles à la casse et peuvent être utilisées dans les types d'expressions suivants

source: In :ref:`LAYER` `FILTER`
fr: Dans le `FILTER` de l'objet :ref:`LAYER`

source: In :ref:`CLASS` `EXPRESSION`
fr: Dans l'\`EXPRESSION` de l'objet :ref:`CLASS`

source: In :ref:`CLASS` `TEXT`
fr: Dans le `TEXT` de l'objet :ref:`CLASS`
