Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapfile.po
Languages: fr

source: Sensitivity for point based queries (i.e. via mouse and/or map coordinates). Given in TOLERANCEUNITS. If the layer is a POINT or a LINE, the default is 3. For all other layer types, the default is 0. To restrict polygon searches so that the point must occur in the polygon set the tolerance to zero.
fr: Sensibilité pour les requêtes basées sur un point (i.e. via la souris et/ou les coordonnées de la carte). Donné en TOLERANCEUNITS. Si la couche est un POINT ou une LINE, 3 par défaut. Pour tous les autres types de couche, 0 est la valeur par défaut. Pour restreindre les recherches de polygone afin que le point doit tomber dans le polygone définissez la tolérance à zéro.

source: Units of the TOLERANCE value. Default is pixels. `Nauticalmiles` was added in MapServer 5.6.
fr: Unités de la valeur de la TOLERANCE. pixels est la valeur par défaut. `Nauticalmiles` a été ajouté dans MapServer 5.6.

source: Since MapServer 5.0 the proper parameter to use is OPACITY. The deprecated TRANSPARENCY parameter sets the transparency level of all classed pixels for a given layer. The value can either be an integer in the range (0-100) or the named symbol "ALPHA". Although this parameter is named "transparency", the integer values actually parameterize layer opacity. A value of 100 is opaque and 0 is fully transparent.
fr: Depuis MapServer 5.0, le paramètre correct à utiliser est OPACITY. Le paramètre TRANSPARENCY déprécié définit le niveau de transparence de tous les pixels des classes pour une couche donnée. La valeur peut être soit un entier dans le domaine (0-100) ou le terme "ALPHA". Bien que ce paramètre est nommée "transparency", les valeurs entières définissent en réalité l'opacité de la couche. Une valeur de 100 est opaque et 0 est complètement transparente.

source: Tells MapServer whether or not a particular layer needs to be transformed from some coordinate system to image coordinates. Default is true. This allows you to create shapefiles in image/graphics coordinates and therefore have features that will always be displayed in the same location on every map. Ideal for placing logos or text in maps. Remember that the graphics coordinate system has an origin in the upper left hand corner of the image, contrary to most map coordinate systems.
fr: Informe MapServer si une couche particulière nécessite ou non d'être transformée à partir d'un système de coordonnées vers des coordonnées image. True par défaut. Cela vous permet de créer des shapefiles en coordonnées image ou graphique et donc d'avoir des objets qui seront toujours affichées dans au même endroit pour chaque carte. L'idéal pour placer des logos ou du texte sur des cartes. Souvenez vous que le système de coordonnés graphique a une origine en haut à gauche de l'image, contrairement à la plupart des systèmes de coordonnées des cartes.

source: Version 4.10 introduces the ability to define features with coordinates given in pixels (or percentages, see UNITS), most often inline features, relative to something other than the UL corner of an image. That is what 'TRANSFORM FALSE' means. By setting an alternative origin it allows you to anchor something like a copyright statement to another portion of the image in a way that is independent of image size.
fr: La version 4.10 introduit la possibilité de définir des features avec des coordonnées données en pixel (ou en pourcentage, voir UNITS), la plupart du temps des features inline, relative à un autre endroit que le coin UL (haut, gauche) d'une image. C'est ce que signifie 'TRANSFORM FALSE'. En définissant une origine alternative cela vous permet d'ancrer quelque chose comme un copyright ou un autre morceau d'image d'une manière indépendante de la taille de l'image.

source: Specifies how the data should be drawn. Need not be the same as the shapefile type. For example, a polygon shapefile may be drawn as a point layer, but a point shapefile may not be drawn as a polygon layer. Common sense rules. Annotation means that a label point will be calculated for the features, but the feature itself will not be drawn although a marker symbol can be optionally drawn. this allows for advanced labeling like numbered highway shields. Points are labeled at that point. Polygons are labeled first using a centroid, and if that doesn't fall in the polygon a scanline approach is used to guarantee the label falls within the feature. Lines are labeled at the middle of the longest arc in the visible portion of the line. Query only means the layer can be queried but not drawn.
fr: Définie comme les données doivent être dessinées. Ne doit pas être nécessairement le même que celui du type du shapefile. Par exemple, un shapefile de type polygone peut être dessiné comme une couche point, mais un shapefile de type point ne peut pas être dessiner comme une couche polygone. Règle de bon sens. Annotation signifie qu'un point étiquette sera calculé pour les features, mais la feature en elle-même ne sera pas dessinée bien qu'un marqueur peut être optionnellement dessiné. Cela permet l'étiquetage avancé comme numéroter les autoroutes. Les points sont étiqueté de cette manière. Les polygone sont d'abord étiqueté en utilisant un centroïde, et s'il ne tombe pas dans le polygone une approche de “scan de ligne” est utilisée pour garantir que l'étiquette tombe dans la feature. Les lignes sont étiquetées au milieu de l'arc le plus long dans la portion visible de la ligne. query signifie seulement que la couche peut être interrogée mais pas dessinée.

source: In order to differentiate between POLYGONs and POLYLINEs (which do not exist as a type), simply respectively use or omit the COLOR keyword when classifying. If you use it, it's a polygon with a fill color, otherwise it's a polyline with only an OUTLINECOLOR.
fr: Dans le but de différencier les POLYGON et les POLYLINE (qui n'existe pas en tant que type), utilisez ou omettez simplement respectivement le mot-clé COLOR lors de la classification. Si vous l'utilisez, c'est un polygone avec une couleur de remplissage, sinon ce sera une polyligne avec seulement un OUTLINECOLOR.

source: A circle must be defined by a a minimum bounding rectangle. That is, two points that define the smallest square that can contain it. These two points are the two opposite corners of said box.
fr: Un cercle doit être définie par une limite rectangulaire minimale. Pour cela, deux points définissent le plus petit carré qui peut y être contenu. Ces deux points sont les deux coins opposés de cette boîte.

source: The following is an example using inline points to draw a circle:
fr: Ce qui suit est un exemple d'utilisation de points "en ligne" pour dessiner un cercle :

source: For CHART layers, see the :ref:`Dynamic Charting<dynamic_charting>` HowTo.
fr: Pour les couches CHART, voyez le howto Dynamic Charting.

source: Units of the layer. `percentages` (in this case a value between 0 and 1) was added in MapServer 4.10 and is mostly geared for inline features. `nauticalmiles` was added in MapServer 5.6.
fr: Unités de la couche. `Percentages` a été ajouté dans MapServer 4.10 (dans ce cas, une valeur entre 0 et 1) et est plutôt utilisé pour les entités "en ligne". `Nauticalmiles` a été ajouté dans MapServer 5.6.

source: The size of the legend image is NOT known prior to creation so be careful not to hard-code width and height in the <IMG> tag in the template file.
fr: La taille de l'image de la légende n'est pas connu avant sa création, soyez donc attentif de ne pas coder en dur la largeur et la hauteur dans la balise <img> du fichier modèle.

source: Color to initialize the legend with (i.e. the background).
fr: Couleur d'initialisation de la légende (i.e. l'arrière-plan).

source: Default is [on]. This keyword is now deprecated in favor of using the FORMATOPTION "INTERLACE=ON" line in the :ref:`OUTPUTFORMAT` declaration.
fr: [on] par défaut. Ce mot-clé est maintenant déprécié en faveur de l'utilisation de la ligne FORMATOPTION "INTERLACE=ON" dans la déclaration :ref:`OUTPUTFORMAT`.

source: Size of symbol key boxes in pixels. Default is 20 by 10.
fr: Taille des boîtes de symboles en pixels. 20 par 10 par défaut.

source: Spacing between symbol key boxes ([y]) and labels ([x]) in pixels. Default is 5 by 5.
fr: Espace entre les boîtes de symboles ([y]) et les étiquettes ([x]) en pixels. La valeur par défaut est 5 par 5.

source: Signals the start of a :ref:`LABEL` object
fr: Indique le début d'un objet :ref:`LABEL`.

source: Color to use for outlining symbol key boxes.
fr: Couleur à utiliser pour le contour de la boîte des symboles.

source: Where to place an embedded legend in the map. Default is lr.
fr: Où placer une légende incluse dans la carte. lr par défaut.

source: Tells MapServer to render this legend after all labels in the cache have been drawn. Useful for adding neatlines and similar elements. Default is false.
fr: Demande à MapServer de réaliser le rendu de cette légende après que toutes les étiquettes dans le cache aient été dessinées. Utile pour ajouter des bordures ou des éléments similaires. False par défaut.

source: Is the legend image to be created.
fr: Est ce que la légende doit être créée ?

source: HTML legend template file.
fr: Fichier modèle HTML de la légende.

source: Should the background color for the legend be transparent. This flag is now deprecated in favor of declaring transparency within :ref:`OUTPUTFORMAT` declarations. Default is off.
fr: Est ce que la couleur d'arrière-plan doit être transparente. Cette balise est maintenant dépréciée en faveur de la déclaration de la transparence dans les déclarations :ref:`OUTPUTFORMAT`. off par défaut.

source: Has no effect for WMS.
fr: N'a pas d'effet pour le WMS

source: Enables debugging of all of the layers in the current map.
fr: Active le débogage de toutes les couches dans la carte courante

source: Signals the start of a :ref:`LAYER` object.
fr: Indique le début d'un objet :ref:`LAYER` object.

source: Signals the start of a :ref:`LEGEND` object.
fr: Indique le début d'un objet :ref:`LEGEND`.

source: Signals the start of a :ref:`QUERYMAP` object.
fr: Indique le début d'un objet :ref:`QUERYMAP`.

source: Signals the start of a :ref:`REFERENCE` MAP object.
fr: Indique le début d'un objet carte de :ref:`REFERENCE`.

source: Signals the start of a :ref:`SCALEBAR` object.
fr: Indique le début d'un objet :ref:`SCALEBAR`.

source: Size in pixels of the output image (i.e. the map).
fr: Taille en pixels de l'image de sortie (c'est à dire, la carte)

source: Signals the start of a :ref:`SYMBOL` object.
fr: Indique le début d'un objet :ref:`SYMBOL`.

source: Signals the start of a :ref:`WEB` object.
fr: Indique le début d'un objet :ref:`WEB`.

source: **Example 2: EPSG Projection Use**
fr: **Exemple 2: Utilisation d'une projection EPSG**

source: See http://spatialreference.org/ref/epsg/26915 for more information on this coordinate system.
fr: Voir http://spatialreference.org/ref/epsg/26915 pour plus d'informations sur le système de coordonnées.

source: **Example 3: Inline Projection Parameters**
fr: **Exemple 3: Paramètres de projection "en ligne"**

source: **Example 4: epsg Projection Use**
fr: **Exemple 4: Utilisation d'une projection EPSG**

source: Important Notes
fr: Notes importantes

source: For More Information
fr: Pour plus d'informations

source: Color in which features are highlighted. Default is yellow.
fr: Couleur utilisé pour mettre en valeur les objets. Jaune par défaut.

source: Size of the map in pixels. Defaults to the size defined in the map object.
fr: Taille de la carte en pixels. Par défaut la taille définie dans l'objet :ref:`MAP`.

source: Is the query map to be drawn?
fr: Est ce que la carte de requête doit être dessinée ?

source: Sets how selected features are to be handled. Layers not queried are drawn as usual.
fr: Définit comment les features sélectionnées doivent être pris en charge. Les couches non interrogées sont dessinées habituellement.

source: Normal: Draws all features according to the settings for that layer.
fr: Normal : dessine toutes les features en fonction de la définition de cette couche.

source: Hilite: Draws selected features using COLOR. Non-selected features are drawn normally.
fr: Hilite : dessine les features sélectionnées en utilisant COLOR. Les features non sélectionnées sont dessinées normalement.

source: Selected: draws only the selected features normally.
fr: Selected : dessine normalement seulement les entités sélectionnées.

source: Three types of reference maps are supported. The most common would be one showing the extent of a map in an interactive interface. It is also possible to request reference maps as part of a query. Point queries will generate an image with a marker (see below) placed at the query point. Region based queries will depict the extent of the area of interest. Finally, feature based queries will display the selection feature(s) used.
fr: Trois types de cartes de référence sont gérés. La plus commune serait celle montrant l'étendue d'une carte dans une interface interactive. Il est également possible d'interroger des cartes de référence comme partie d'une requête. Les requêtes ponctuelles génèreront une image avec un marqueur (voir plus bas) placé sur le point de requête. Les requêtes basées sur nue région montreront l'étendue de la zone d'intérêt. Enfin, les requêtes basées sur les features afficheront la sélection des features utilisées.

source: Color in which the reference box is drawn. Set any component to -1 for no fill. Default is red.
fr: Couleur dans laquelle la boîte de référence est dessinée. Définissez tous les composant à -1 pour avoir une couleur transparente. Rouge par défaut.

source: The spatial extent of the base reference image.
fr: L'étendue spatial de l'image de base pour la référence.

source: Full filename of the base reference image. Must be a GIF image.
fr: Nom du fichier complet de l'image de base pour la référence. Ce doit être une image GIF.

source: Defines a symbol (from the symbol file) to use when the box becomes too small (see MINBOXSIZE and MAXBOXSIZE below). Uses a crosshair by default.
fr: Définit un symbole (à partir du fichier de symboles) à utiliser lorsque la boîte devient trop petite (voir :ref:`MINBOXSIZE` et :ref:`MAXBOXSIZE` plus bas). Utilise un croix par défaut.

source: Defines the size of the symbol to use instead of a box (see MARKER above).
fr: Définit la taille du symbole à utiliser au lieu de la boîte (voir :ref:`MARKER` plus haut).

source: If box is smaller than MINBOXSIZE (use box width or height) then use the symbol defined by MARKER and MARKERSIZE.
fr: Si la boîte est plus petite que MINBOXSIZE (utilise la largeur ou la hauteur de la boîte) alors utilise un symbole définie par :ref:`MARKER` et :ref:`MARKERSIZE`.

source: If box is greater than MAXBOXSIZE (use box width or height) then draw nothing (Often the whole map gets covered when zoomed way out and it's perfectly obvious where you are).
fr: Si la boîte est plus grande que MAXBOXSIZE (utilise la largeur ou la hauteur de la boîte) alors ne dessine rien (souvent l'ensemble de la carte est couverte lorsque vous zoomez en arrière et il est parfaitement évident de l'endroit où vous êtes).

source: Color to use for outlining the reference box. Set any component to -1 for no outline.
fr: Couleur à utiliser pour le contour de la boîte de référence. Définissez une valeur à -1 pour ne pas avoir de contour.

source: Size, in pixels, of the base reference image.
fr: Taille, en pixel, de l'image de base de la référence.

source: Is the reference map to be created? Default it off.
fr: Est ce que la carte de référence doit être créée ? off par défaut.

source: Cartographical Symbol Construction with MapServer
fr: Construction de symboles cartographiques avec Mapserver

source: Abstract
fr: Résumé

source: The document has been heavily revised for Mapserver 6.
fr: Ce document a été fortement revu pour Mapserver 6.

source: Symbol Scaling
fr: Mise à l'échelle des symboles'

source: :ref:`style` `MAXSIZE` and `MINSIZE` limits the scaling of symbols.
fr: :ref:`style` `MAXSIZE` et `MINSIZE` limitent la mise à l'échelle des symboles.

source: Mapserver and symbol specification
fr: Mapserver et les spécifications de symboles

source: :ref:`layer` section of the map file
fr: section :ref:`layer` du mapfile

source: Using Cartographical Symbols in MapServer
fr: Utiliser les symboles cartographiques dans MapServer

source: Output formats
fr: Formats de sortie

source: Symbol units
fr: Unités des symboles

source: Dimensions can be specified using decimals.
fr: Les dimensions peuvent être spécifiées en utilisant les décimales

source: Scaling of Symbols
fr: Mise à l'échelle des symboles

source: Construction of Point Symbols
fr: Construction des symboles Point

source: Symbols of `TYPE` `vector` and `ellipse`
fr: Symboles de `TYPE` `vector` et `ellipse`

source: Symbols of `TYPE` `truetype`
fr: Symboles de `TYPE` `truetype`

source: Trial and Error. :-)
fr: Tests et essais . :-)

source: Symbols of `TYPE` `pixmap`
fr: Symboles de `TYPE` `pixmap`

source: Combining symbols
fr: Combiner les symboles

source: Construction of Line Symbols
fr: Construction des symboles Lignes

source: Overlaying lines
fr: Superposer les lignes

source: Use of the `PATTERN` and `GAP` parameters
fr: Utilisation des paramètres `PATTERN` et `GAP`

source: **Styles and symbols for lines**
fr: **Styles et symboles pour les lignes**

source: Use of the `OFFSET` parameter
fr: Utilisation du paramètre `OFFSET`

source: Area Symbols
fr: Symboles surfaciques

source: :ref:`class` section
fr: section :ref:`class`

source: :ref:`symbol` definition
fr: définition :ref:`symbol`

source: Polygon fills with symbols of `TYPE` `vector`
fr: Polygone rempli avec des symboles de `TYPE` `vector`

source: First, the :ref:`layer`\s
fr: En premier, les couches :ref:`layer`

source: Then the :ref:`symbol`\s:
fr: Ensuite les :ref:`symbol`\es:

source: Polygon outlines
fr: Contours de polygones

source: Examples (Mapserver 4)
fr: Exemples (Mapserver 4)

source: The examples in this section were made for MapServer 4.
fr: Les exemples dans cette section ont été fait pour MapServer 4.

source: Basic Symbols
fr: Symboles basiques

source: Complex Symbols
fr: Symboles complexes

source: Tricks
fr: Trucs

source: Changing the center of a point symbol
fr: Changer le centre d'un symbole point

source: :ref:`symbol`\s
fr: :ref:`symbol`

source: :ref:`layer` :ref:`style`\s
fr: :ref:`style`\s de couche :ref:`layer`

source: Mapfile changes related to symbols
fr: Changements dans le mapfile liés aux symboles

source: The End
fr: Fin

source: Symbology Examples
fr: Exemples de symbologie

source: Example 1. Dashed Line
fr: Exemple 1. Ligne tiretée

source: This example creates a dashed line that is 5 `SIZEUNITS` wide, with 10 `SIZEUNITS` on, 5 off, 5 on, 10 off ...
fr: Cet exemple créé une ligne tiretée qui a 5 `SIZEUNITS` de large, avec 10 `SIZEUNITS` visibles, puis 5 non visibles, 5 visibles, 10 non visibles ...

source: Example 2. TrueType font marker symbol
fr: Exemple 2. Symbole avec un marqueur de police TrueType

source: This example symbol is a star, used to represent the national capital, hence the name. The font name in defined in the :ref:`FONTSET` file. The code number "114" varies, you can use MS Windows' character map to figure it out, or guestimate.
fr: Ce symbole exemple est une étoile, utilisée pour représenter la capitale nationale, d'où le nom. Le nom de police est défini dans le fichier :ref:`FONTSET`. Le numéro du code "114" varie, vous pouvez utiliser la correspondance des caractères MS Windows pour le déterminer, ou le déduire.

source: Example 3. Vector triangle marker symbol
fr: Exemple 3. Symbole avec un marqueur de triangle vecteur

source: This example is fairly straight forward. Note that to have 3 sides you need 4 points, hence the first and last points are identical. The triangle is not filled.
fr: Cet exemple est plutôt simple à comprendre. Notez que pour avoir trois côtés, vous aurez besoin de 4 points, où le premier et le dernier points sont identiques. Le triangle n'est pas rempli.

source: Example 4. Non-contiguous vector marker symbol (Cross)
fr: Exemple 4. symbole avec un marqueur vecteur non-continu (Croix)

source: This example draws a cross, that is 2 lines (vectors) that are not connected end-to-end (Like the triangle in the previous example). The negative values separate the two.
fr: Cet exemple dessine une croix, qui est 2 lignes (vecteurs) qui ne sont pas connectées de manière continue (comme le triangle dans l'exemple précédent). Les valeurs négatives séparent les deux.

source: Example 5. Circle vector symbol
fr: Exemple 5. Symbole de cercle vecteur

source: This example creates a simple filled circle. Using non-equal values for the point will give you an actual ellipse.
fr: Cet exemple créé un cercle simple rempli. En utilisant des valeurs non-égales pour le point vous donnera une vraie ellipse.

source: Example 6. Downward diagonal fill
fr: Exemple 6. Diagonale de remplissage descendante (pour les hachures)

source: This example creates a symbol that can be used to create a downward diagonal fill for polygons.
fr: Cet exemple créé un symbole qui peut être utilisé pour créer un remplissage hachuré en diagonale descendante pour les polygones.

source: Example 7. Using the Symbol Type HATCH (new in 4.6)
fr: Exemple 7. Utilisation du type de symbole HATCH (nouveau en version 4.6)

source: As of MapServer 4.6, you can use the symbol type HATCH to produce hatched lines. The following will display hatched lines at a 45 degree angle, 10 `SIZEUNITS` apart (center to center), and 3 `SIZEUNITS` wide.
fr: A partir MapServer 4.6, vous pouvez utiliser le type de symbole HATCH pour produire des lignes hachées. Ce qui suit affichera des lignes hachurées avec un angle de 45 degrés, avec un espacement de 10 `SIZEUNITS` entre elles (centre à centre), et avec 3 `SIZEUNITS` de large.

source: Symbol definition:
fr: Définition de symbole :

source: Layer definition:
fr: Définition de couche :

source: Other parameters available for HATCH are: MINSIZE, MAXSIZE, MINWIDTH, and MAXWIDTH.
fr: Les autres paramètres disponibles pour HATCH sont : MINSIZE, MAXSIZE, MINWIDTH, et MAXWIDTH.

source: Example 8. Styled lines using GAP
fr: Exemple 8. Lignes stylées en utilisant GAP

source: This example shows how to style lines with symbols.
fr: Cet exemple montre comment styler des lignes avec des symboles.

source: A 5 `SIZEUNITS` wide black line is decorated with ellipses that are 15 `SIZEUNITS` long (and 7.5 `SIZEUNITS`wide). The ellipses are placed 30 `SIZEUNITS` apart, and the negative `GAP` value ensures that the ellipses are oriented relative to the direction of the line. The ellipses are rotated 30 degrees counter clock-wise from their position along the line.
fr: Une ligne noire de 5 `SIZEUNITS` de large est décorée avec des ellipses qui ont 15 `SIZEUNITS` de long (et 7.5 `SIZEUNITS` de large). Les ellipses sont placées à 30 `SIZEUNITS` l'une de l'autre, et les valeurs négatives du `GAP` s'assurent que les ellipses sont orientées relativement à la direction de la ligne. Les ellipses sont pivotées de 30 degrés en sens inverse aux aiguilles d'une montre à partir de leur position le long de la ligne.

source: Templates are used:
fr: Les modèles (template) sont utilisés :

source: to define the look of a MapServer CGI application interface and
fr: pour définir l'aspect de l'interface d'une application CGI Mapserver et

source: to present the results of a query.
fr: pour présenter les résultats d'une requête.
