Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapfile.po
Languages: fr

source: Used for making the zoom direction persistent. Use check with a radio control or select with a selection list. See the demo for an example. The string is replaced with the HTML keyword "checked", "selected" or "" depending on the current value of zoomdir.
fr: Utilisé pour rendre la direction de zoom persistante. Utilise "check" avec un contrôle radio ou select avec une liste de sélection. Voir la démo pour un exemple. La chaîne est remplacée avec le mot-clé HTML "checked", "selected" ou "" en fonction de la valeur de zoomdir.

source: Query
fr: Requête

source: The following substitutions are only available when the template is processed as a result of a query.
fr: Les substitutions suivantes sont seulement disponibles quand on traite le modèle comme le résultat d'une requête.

source: Extent of current shape plus a 5 percent buffer. Available only when processing query results.
fr: Etendue de la forme courante avec un tampon de 5 pourcents. Disponible seulement quand on traite les résultats de requête.

source: The default template [shpext] returns coordinates in the format of: mixx miny maxx maxy
fr: Le modèle par défaut [shpext] retourne les coordonnées dans le format : mixx miny maxx maxy

source: Expand the bounds of the extents by a specific value. Specified in map coordinates. For example, [shpext] might return:
fr: Aggrandit les bornes des étendues d'une valeur spécifique. Spécifié dans les coordonnées de carte. Par exemple, [shpext] pourrait retourner :

source: and [shpext expand=1000] would therefore return:
fr: et [shpext expand=1000] retournera par conséquent :

source: Minimum / maximum X or Y coordinate of shape extent. Available only when processing query results.
fr: Coordonnées minimum / maximum X ou Y de l'étendue de la carte. Disponible seulement quand on traite les résultats de requête.

source: Middle of the extent of current shape. Available only when processing query results.
fr: Milieu de l'étendue de la forme courante. Disponible seulement quand on traite les résultats de requête.

source: X or Y coordinate of middle of the extent of the current shape. Available only when processing query results.
fr: Coordonnées X ou Y du milieu de l'étendue de la forme courante. Disponible seulement quand on traite les résultats de requête.

source: Index value of the current shape. Available only when processing query results.
fr: Valeur de l'index de la forme courante. Disponible seulement quand on traite les résultats de requête.

source: Classindex value of the current shape. Available only when processing query results.
fr: Valeur de l'index de classe "Classindex" de la forme courante. Disponible seulement quand on traite les résultats de requête.

source: The list of shape coordinates, with list formatting options, especially useful for SVG.
fr: La liste des coordonnées de la forme, avec options de formatage de liste, particulièrement utile pour le SVG.

source: The default template [shpxy] returns a comma separated list of space delimited of coordinates (i.e. x1 y1, x2 y2, x3 y3).
fr: Le modèle par défaut [shpxy] retourne une liste séparée par des virgules de coordonnées délimitée par des espaces (c'est à dire x1 y1, x2 y2, x3 y3).

source: Available only when processing query results.
fr: Disponible seulement quand on traite les résultats de requête.

source: Available attributes (h = header, f=footer, s=separator):
fr: Attributs disponibles (h = header (en-tête), f=footer (pied de page), s=separator (séparateur)):

source: Buffer size, currently the only unit available is pixels. Default is 0.
fr: Taille du tampon, actuellement la seule unité disponible est le pixel. Par défaut, sa valeur vaut 0.

source: Should only the centroid of the shape be used? true or false (case insensitive). Default is false.
fr: Est-ce que le centroide de la forme est utilisé? true ou false (insensible à la casse). Par défaut, la valeur est false.

source: Coordinate separator. Default is ",".
fr: Séparateur de coordonnées. Par défaut, c'est ",".

source: Characters to be put before (`irh`) and after (`irf`) inner rings, and before (`orh`) and after (`orf`) outer rings of polygons with holes. Defaults are "".
fr: Caractères à mettre avant les anneaux internes de (`irh`) et après ceux de (`irf`), et avant les anneaux externes (des polygones à trous) de (`orh`) et après ceux de (`orf`). Par défaut, leurs valeurs sont "".

source: Within each polygon, the outer ring is always output first, followed by the inner rings.
fr: A l'intérieur de chaque polygone, l'anneau externe est toujours envoyé en premier, suivi par les anneaux internes.

source: If neither `irh` nor `orh` are set, rings are output as "parts" using `ph`/`pf`/`ps`.
fr: Si ni `irh` ni `orh` ne sont définis, les anneaux sont renvoyées comme des "parties" en utilisant `ph`/`pf`/`ps`.

source: Characters to put before (`ph`) and after (`pf`) and separators between (`ps`) feature parts (e.g. rings of multigeometries). Defaults are ph="", pf="" and ps=" ".
fr: Caractères à mettre avant (`ph`) et après (`pf`) et séparateurs entre les morceaux d'entité (`ps`) (c'est à dire les anneaux des multigéométries). Par défaut, leurs valeurs sont ph="", pf="" et ps=" ".

source: The number of decimal places to output for coordinates. Default is 0.
fr: Le nombre de décimales pour la sortie des coordonnées. Par défaut, la valeur est 0.

source: The output projection definition for the coordinates, a special value of "image" will convert to image coordinates. Default is none.
fr: La définition de de laprojection en sortie pour les coordonnées, une valeur spéciale de l'"image" sera convertie en coordonnées image. Par défaut, la valeur est none.

source: Scaling factor for coordinates: Both axes (`scale`), x axis (`scale_x`) and y axis (`scale_y`). Defaults are 1.0.
fr: Facteur de mise à l'échelle pour les coordonnées : les deux axes (`scale`), l'axe x (`scale_x`) et l'axe y (`scale_y`). Par défaut, leurs valeurs sont 1.0.

source: Characters to put before (`sh`) and after (`sf`) a feature. Defaults are "".
fr: Caractères à mettre avant (`sh`) et après (`sf`) une entité. Par défaut, leurs valeurs sont "".

source: Characters to put before (`xh`) and after (`xf`) the x coordinates. Defaults are xh="" and xf=",").
fr: Caractères à mettre avant (`xh`) et après (`xf`) les coordonnées x. Leurs valeurs par défaut sont xh="" et xf=",").

source: Characters to put before (`yh`) and after (`yf`) the y coordinates. Defaults are "".
fr: Caractères à mettre avant (`yh`) et après (`yf`) les coordonnées y. Par défaut, leurs valeurs sont "".

source: As a simple example: ::
fr: Comme un exemple simple : ::

source: And a more complicated example of outputting KML for multipolygons which may potentially have holes (note that the parameters must all be on one line):
fr: et un exemple plus comliqué de sortie KML pour les multipolygones qui peuvent potentiellement avoir des trous (notez que les paramètres doivent tous être sur une seule ligne) :

source: Index value of the current tile. If no tiles used for the current shape this is replaced by \"-1\". Available only when processing query results.
fr: La valeur d'index de la tuile courante. Si aucune tuile n'est utilisée pour la forme courante, elle est remplacée par \"-1\". Disponible seulement quand on traite les résultats de requête.

source: An attribute table "item", with list formatting options. The "name" attribute is required.
fr: Un élément "item" de table attributaire, avec des options de formatage de liste. L'attribut de nom "name" est requis.

source: Available attributes:
fr: Attributs disponibles :

source: The name of an attribute, case insenstive. (required)
fr: Le nom d'un attribut, insensible à la casse. (requis)

source: The number of decimal places to use for numeric data. Use of this will force display as a number and will lead to unpredicable results with non-numeric data.
fr: Le nombre de décimales à utiliser pour les données numériques. L'utilisation de ce paramètre forcera l'affichage comme un nombre et pourra mener à des résultats imprévisibles avec des données non numériques.

source: Regular expression to compare the value of an item against. The tag is output only if there is a match.
fr: Expression régulière pour comparer la valeur d'un élément avec. La balise est renvoyée seulement s'il y a une correspondance.

source: Set this attribute to "true" to convert the attribute value to upper case.
fr: Définit cet attribut à "true" pour convertir la valeur de l'attribut en majuscule.

source: Set this attribute to "true" to convert the attribute value to lower case.
fr: Définit cet attribut à "true" pour convertir la valeur de l'attribut en minuscule.

source: Set this attribute to "true" to add commas to a numeric value. Again, only useful with numeric data.
fr: Définit cet attribut à "true" pour ajouter des virgules à une valeur numérique. A nouveau, seulement utile avec des données numériques.

source: Default escaping is for HTML, but you can escape for inclusion in a URL (=url), or not escape at all (=none).
fr: L'échappement par défaut est pour le HTML, mais vous pouvez échapper pour une inclusion dans une URL (=url), ou ne rien échapper du tout (=none).

source: A format string used to output the attribute value. The token "$value" is used to place the value in a more complex presentation. Default is to output only the value.
fr: Une chaîne formatée utilisée pour renvoyer la valeur d'attribut. Le jeton "$valeur" est utilisé pour placer la valeur dans une présentation plus complexe. Par défaut, il renvoie seulement la valeur.

source: String to output if the attribute value is NULL, empty or doesn't match the pattern (if defined). If not set and any of these conditions occur the item tag is replaced with an empty string.
fr: Chaîne à renvoyer si la valeur d'attribut est NULL, vide ou ne correspond pas au pattern (si défini). S'il n'est pas défini et qu'aucune de ces conditions est vérifiée, la balise de l'élément est remplacée avec une chaîne vide.

source: Attribute name from the data table of a queried layer. Only attributes for the active query layers are accessible. Case must be the same as what is stored in the data file. ArcView, for example, uses all caps for shapefile field names. Available only when processing query results.
fr: Nom d'attribut pour la table de données d'une couche interrogée. Seules les attributs pour les couches de requête active sont accessibles. La casse doit être la même que celle stocké dans le fichier de données. ArcView, par exemple, n'utilise que les majuscules sur les noms des champs shapefile. Disponible seulement quand on traite les résultats de requête.

source: By default the attributes are encoded especially for HTML representation. In addition the escaped version (for use in URLs) as well as the raw data is available.
fr: Par défaut, les attributs sont encodés spécialement pour la représentation HTML. En plus, la version échappée (pour l'usage dans les URL) comme celle brute est disponible.

source: [Join name_attribute name],[Join name_attribute name_esc], [Join name_attribute name_raw]
fr: [Join nom_attribut nom],[Join nom_attribut nom_echappee], [Join nom_attribut nom_brute]

source: One-to-one joins: First the join name (as specified in the :ref:`mapfile` has to be given, second the tables fields can be accessed similar to the layers attribute data. Available only when processing query results.
fr: Jointures une à une : en premier le nom de la jointure (comme spécifiée dans le :ref:`mapfile`) doit être donné, ensuite, les champs des tables peuvent être accédés de manière similaire aux données attributaires des couches. Disponible seulement quand on traite les résultats de requête.

source: By default the attributes are encoded especially for HTML representation. In addition the escaped version (for use in URLs) as well as the raw data is available.
fr: Par défaut, les attributs sont encodés spécialement pour la représentation HTML. En plus, la version échappée (pour l'usage dans les URL) comme celle brute est disponible.

source: One-to-many joins: The more complex variant. If the join type is multiple (one-to-many) the template is replaced by the set of header, template file and footer specified in the :ref:`mapfile`.
fr: Jointures une à plusieurs : la variante la plus complexe.Si lle type de jointure est multiple (une à plusieurs), le modèle est remplacé par le jeu d'en-tête, fichier de modèle et pied de page spécifié dans le :ref:`mapfile`.

source: Queried layer meta data access (e.g [metadata_projection]
fr: Accès aux métadonnées des couches interrogées (c'est à dire [metadata_projection])

source: For query modes that allow for multiple result sets, the following string substitutions are avai lable. For FEATURESELECT and FEATURENSELECT modes the totals a re adjusted so as not to include the selection layer. The selection layer results ARE available for display to the user.
fr: Pour les mode requête qui permettent le retour de plusieurs jeux de résultats, les chaînes de substitutions suivantes sont disponibles. Pour les modes FEATURESELECT et FEATURENSELECT, les totaux sont réajustés pour ne pas inclure la couche de sélection. Les résultats de la couche de résultat sont disponibles pour être affichés à l'utilisateur.

source: Total number of results. Useful in web header and footers. Available only when processing query results.
fr: Nombre total de résultats. Utile dans les en-têtes et les pieds de page. Disponible seulement quand on traite les résultats de requête.

source: Number of layers returning results. Useful in web header and footers. Available only when processing query results.
fr: Nombre de couches retournant des résultats. Utile dans les en-têtes et les pieds de page. Disponible seulement quand on traite les résultats de requête.

source: Total number of results within the current layer. Useful in web header and footers. Available only when processing query results.
fr: Nombre total de résultats dans la couche courante. Utile dans les en-têtes et les pieds de page. Disponible seulement quand on traite les résultats de requête.

source: Result number within all layers. Starts at 1. Useful in web header and footers. Available only when processing query results.
fr: Nombre résultat à l'intérieur de toutes les couches. Commence à 1. Utile dans les en-têtes et les pieds de page. Disponible seulement quand on traite les résultats de requête.

source: Result number within the current layer. Starts at 1. Useful in query templates. Available only when processing query results.
fr: Nombre résultat à l'intérieur de la couche courante. Commence à 1. Utile dans les modèles d'interrogation. Disponible seulement quand on traite les résultats de requête.

source: Current layer name. Useful in layer headers and footers. Available only when processing query results.
fr: Nom de couche courante. Utile dans les en-têtes et les pieds de page de couche. Disponible seulement quand on traite les résultats de requête.

source: Example Template
fr: Modèle exemple

source: A small example to give an idea how to work with templates. Note that it covers MapServer specific templates (e.g. the [map], [mapext]) and user defined templates (e.g. [htmlroot] or [program]) used to store application settings.
fr: Un petit exemple pour donner une idée de comment travailler avec des modèles. Notez qu'il couvre les modèles Mapserver spécifiques (c'est à dire le [map], [mapext]) et les modèles définis par l'utilisateur (c'est à dire [htmlroot] ou [program]) utilisé pour stocker les paramètres de l'application.

source: Union Layer
fr: Couche union

source: Since version 6.0, MapServer has the ability to display features from multiple layers (called *'source layers'*) in a single mapfile layer. This feature was added through :ref:`rfc68`.
fr: Depuis la version 6.0, MapServer a la capacité d'afficher les entités de multiples couches (appelées *'couches source'*) dans une couche mapfile seule. Cette fonctionnalité a été ajoutée via la :ref:`rfc68`.

source: This is a native MapServer option that doesn't use any external libraries to support it.
fr: C'est une option native de MapServer qui n'utilise aucun bibliothèque externe pour ce fonctionnement.

source: Mapfile Configuration
fr: Configuration du mapfile

source: The CONNECTIONTYPE parameter must be set to UNION.
fr: Le paramètre CONNECTIONTYPE doit être défini à UNION.

source: The CONNECTION parameter must contain a comma separated list of the source layer names.
fr: Le paramètre CONNECTION doit contenir un liste (séparée par un virgule) de noms de source de couches.

source: All of the source layers and the union layer must be the same TYPE (e.g. all must be TYPE POINT, or all TYPE POLYGON etc.)
fr: Tous les couches source et la couche union doivent être du même TYPE (par exemple, ils sont tous de TYPE POINT ou de TYPE POLYGON, etc.)

source: You may wish to disable the visibility (change their STATUS) of the source layers to avoid displaying the features twice.
fr: Vous souhaiterez peut être désactiver la visibilité (changer leur STATUS) des couches source pour éviter d'afficher les entités deux fois.

source: For example:
fr: Par exemple

source: In the LAYER definition you may refer to any attributes supported by each of the source layers. In addition to the source layer attributes the union layer provides the following additional attributes:
fr: Dans la définition de LAYER, vous pouvez faire référence à n'importe quel attribut supporté par chacune des couches source. En plus des attributs des couches source, la couche union fournit les attributs supplémentaires suivants:

source: Combine:SourceLayerName - The name of the source layer the feature belongs to
fr: Combine:NomCoucheSource - Le nom de la couche source auquel l'entité appartient

source: Combine:SourceLayerGroup - The group of the source layer the feature belongs to
fr: Combine:GroupeCoucheSource - Le groupe de la couche source auquel l'entité appartient

source: During the selection / feature query operations only the 'Combine:SourceLayerName' and 'Combine:SourceLayerGroup' attributes are provided by default. The set of the provided attributes can manually be overridden (and further attributes can be exposed) by using the ITEMS processing option (refer to the example above).
fr: Pendant les opérations de sélection / interrogation des entités, seuls les attributs 'Combine:NomCoucheSource' et 'Combine:GroupeCoucheSource' sont fournis par défaut. L'ensemble des attributs fournis peuvent être manuellement remplacés (et plus d'attributs peuvent être exposés) en utilisant l'option de traitement ITEMS (se référer à l'exemple ci-dessus).

source: Classes and Styles
fr: Classes et styles

source: We can define the symbology and labelling for the union layers in the same way as for any other layer by specifying the classes and styles. In addition the STYLEITEM AUTO option is also supported for the union layer, which provides to display the features as specified at the source layers. The source layers may also use the STYLEITEM AUTO setting if the underlying data source provides that.
fr: Nous pouvons définir la symbologie et l'étiquetage pour les couches union de le même manière que pour n'importe quelle autre couche en spécifiant les classes et les styles. En plus l'option STYLEITEM AUTO est aussi supportée par la couche union, qui fournit l'affichage des entités comme indiqué par les couches source. Les couches source pourront aussi utiliser la configuration STYLEITEM AUTO si la source de données indiquée fournit cet élément.

source: For speed, it is recommended to always use the same projection for the union layer and source layers. However MapServer will reproject the source layers to the union layer if requested. (for more information on projections in MapServer refer to :ref:`PROJECTION`)
fr: Pour la vitesse, il est recommandé de toujours utiliser la même projection pour la couche union et les couches source. Cependant MapServer reprojettera les couches source vers la la couche union si c'est demandé. (pour plus d'informations sur les projections dans MapServer, se référer à :ref:`PROJECTION`)

source: Examples
fr: Exemples

source: Mapfile Example
fr: Exemple de mapfile

source: The follow example contains 3 source layers in different formats, and one layer (yellow) in a different projection. The union layer uses the **STYLEITEM "AUTO"** parameter to draw the styles from the source layers. (in this case MapServer will reproject the yellow features, in EPSG:4326, for the union layer, which is in EPSG:3978).
fr: L'exemple suivant contient 3 couches source dans différents formats, et une couche (jaune) dans une projection différente. La couche union utilise le paramètre **STYLEITEM "AUTO"** pour dessiner les styles pour les couches source. (dans ce cas MapServer reprojettera les entités jaunes, en EPSG:4326, pour la couche union, qui est en code EPSG:3978).

source: PHP MapScript Example
fr: Exemple PHP MapScript

source: Variable Substitution
fr: Substitution de variable

source: Syntax: '%' + variable name + '%'
fr: Syntaxe : '%' + nom de variable + '%'

source: **Example 1**. Connecting securely to a Spatial Database
fr: **Exemple 1**. se connecter demanière sécurisée à une base de données spatiale

source: You want to map some senstitive data held in a PostGIS database. The username and password to be used for the database connection are held in 2 cookies previously set by a seperate authentication mechanism, "uid" and "passwd".
fr: Vous désirez cartographier des données contenues dans une base de données PostGIS. Le nom de l'utilisateur et le mot de passe associés à utiliser pour la connexion à la base sont contenus dans 2 cookies définis auparavant par un mécanisme d'authentification séparé, "uid" et "passwd".

source: **Example 2**. Handling temporary files
fr: **Exemple 2**. Gérer les fichiers temporaires

source: You have a user based discovery application that generates shapefiles and stores them in a user's home directory on the server. The "username" comes from a cookie, the "filename" comes from a request parameter.
fr: Vous avez une application de navigation basé sur les utilisateurs qui génère des shapefiles et les stocke dans le répertoire home de l'utilisateur sur le serveur. L'"username" vient d'un cookie, le "filename" vient du paramètre de la requête.

source: This feature is only available in the CGI version of MapServer through a mapfile pre-processor. If you are using MapScript, you will have to code the substitution logic into your application yourself (By writing your own pre-processor).
fr: Cette fonctionnalité est seulement possible avec la version CGI de MapServer via un pré-processeur de mapfile. Si vous utilisez MapScript, vous devrez vous même coder la logique de substitution dans votre application (en écrivant votre propre pré-processeur).

source: Format of the interface output, using MapServer CGI. *(added to MapServer 4.8.0)* The default value is "text/html". Example:
fr: Format de la sortie d'interface,en utilisant le CGI de MapServer. *(ajouté à MapServer 4.8.0)* La valeur par défaut est "text/html". Exemple :

source: URL to forward users to if a query fails. If not defined the value for ERROR is used.
fr: URL à renvoyer à l'utilisateur si une requête échoue. Si elle n'est pas définie la valeur du paramètre ERROR est utilisée.

source: URL to forward users to if an error occurs. Ugly old MapServer error messages will appear if this is not defined
fr: URL à renvoyer à l'utilisateur si une erreur arrive. Les vieux messages moches d'erreur de MapServer apparaitront si la valeur n'est pas définie.
