Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapfile.po
Languages: fr

source: The CSV driver currently doesn't read column names from the first row. It just uses indexes (1, 2, ... n) to reference the columns. It's ok to leave column names as the first row since they likely won't match anything but they aren't used. Typically you'd see something like TO "1" in the JOIN block. Then in the template you'd use [name_1], [name_2], etc...
fr: Le pilote CSV ne supporte pas pour le moment la lecture des noms de colonnes de la première ligne. Il utilise juste les index (1, 2, ... n) pour référencer les colonnes. C'est tout à fait possible de laisser les noms de colonnes dans la première ligne comme il y a peu de chances qu'elles correspondent à quoi que ce soit. Typiquement, vous verrez quelque chose du genre TO "1" dans le bloc JOIN. Alors dans le template, vous utiliserez [name_1], [name_2], etc...

source: Template (prov.html)
fr: Modèle (prov.html)

source: Ideally this the template should look like this::
fr: Idéalement c'est ce à quoi le modèle devrait ressembler::

source: But since attribute names are not supported for CSV files (see note above), the following will have to be used::
fr: Mais comme les noms d'attributs ne sont pas supportés par les fichiers CSV (voir note ci-dessus), il faudra utiliser ce qui suit::

source: Example 4: Join from Shape dataset to MySQL
fr: Exemple 4 : jointure d'un fichier SHP avec une table MySQL

source: Specifies text alignment for multiline labels (see WRAP_) Note that the alignment algorithm is far from precise, so don't expect fabulous results (especially for *right* alignment) if you're not using a fixed width font.
fr: Depuis la version 5.4. Définie l'alignement du texte pour les étiquettes de plusieurs lignes (voir WRAP_). Notez que l'algorithme pour l'alignement est loin d'être précis, n'espérez pas de résultats fabuleux (spécialement pour l'alignement à *droite*) si vous n'utilisez pas une police à taille fixe.

source: Angle, given in degrees, to draw the label.
fr: Angle, donné en degrés, pour dessiner l'étiquette.

source: AUTO allows MapServer to compute the angle. Valid for LINE layers only.
fr: AUTO permet à MapServer de calculer l'angle. Valide uniquement pour les couches de type ligne (LINE).

source: FOLLOW was introduced in version 4.10 and tells MapServer to compute a curved label for appropriate linear features (see :ref:`RFC11` for specifics).
fr: FOLLOW a été implémenté dans la version 4.10 et indique à MapServer de calculer une étiquette courbe appropriée aux entités linéaires (cf. la :ref:`RFC11` pour les détails).

source: [*Attribute*] was introduced in version 5.0, to specify the item name in the attribute table to use for angle values. The hard brackets [] are required. For example, if your shapefile's DBF has a field named "MYANGLE" that holds angle values for each record, your LABEL object might contain:
fr: [ATTRIBUTE] a été implémenté dans la version 5.0 pour spécifier le nom de l'attribut dans la table attributaire à utiliser pour les valeurs angulaires. Les crochets [] sont nécessaires. Par exemple, si le fichier DBF de votre fichier Shape contient un champ nommé "MONANGLE" qui indique la valeur de l'angle pour chaque enregistrement, votre objet LABEL doit contenir :

source: The associated RFC document for this feature is :ref:`RFC19`.
fr: le document RFC associé pour cette fonctionnalité est :ref:`RFC19`.

source: Should text be antialiased? Note that this requires more available colors, decreases drawing performance, and results in slightly larger output images. Only useful for GD (gif) rendering. Default is false. Has no effect for the other renderers (where anti-aliasing can not be turned off).
fr: Le texte devrait-il être anticrênelé? Notez que cela nécessite plus de couleurs disponibles, diminue les performances de rendu, et renvoie des images de sortie de taille un peu plus large. Seulement utile pour le rendu GD (gif). Par défaut, défini à "false". N'a pas d'effet sur les autres types de générateur de rendus (où l'anticrênelage ne peut pas être désactivé).

source: Color to draw a background rectangle (i.e. billboard). Off by default.
fr: Couleur à utiliser pour dessiner un rectangle d'arrière plan (panneau d'étiquette ("billboard"). Désactivé par défaut.

source: Removed in 6.0. Use a `LABEL STYLE`_ object with `GEOMTRANSFORM labelpoly` and `COLOR`.
fr: Enlevé dans la version 6.0. Utilise un objet `LABEL STYLE`_ avec un `GEOMTRANSFORM labelpoly` et une `COLOR`.

source: Color to draw a background rectangle (i.e. billboard) shadow. Off by default.
fr: Couleur à utiliser pour dessiner l'ombre d'un rectangle d'arrière plan (panneau d'étiquette ("billboard"). Désactivé par défaut.

source: Removed in 6.0. Use a `LABEL STYLE`_ object with `GEOMTRANSFORM labelpoly`, `COLOR` and `OFFSET`.
fr: Enlevé dans la version 6.0. Utilise un objet `LABEL STYLE`_ avec un `GEOMTRANSFORM labelpoly`, une `COLOR` et un `OFFSET`.

source: How far should the background rectangle be offset? Default is 1.
fr: Jusqu'où le rectangle d'arrière plan doit être décalé ? 1 par défaut.

source: Padding, in pixels, around labels. Useful for maintaining spacing around text to enhance readability. Available only for cached labels. Default is 0.
fr: Remplissage, en pixels, autour des étiquettes. Utile pour maintenir un espace autour du texte pour en améliorer sa lecture. Disponible seulement pour les étiquettes "cachables". 0 par défaut.

source: Color to draw text with.
fr: Couleur à utiliser pour dessiner le texte.

source: [*Attribute*] was introduced in version 5.0, to specify the item name in the attribute table to use for color values. The hard brackets [] are required. For example, if your shapefile's DBF has a field named "MYCOLOR" that holds color values for each record, your LABEL object might contain:
fr: [*ATTRIBUTE*] a été implémenté dans la version 5.0 pour spécifier le nom de l'attribut dans la table attributaire à utiliser pour les valeurs de couleur. Les crochets [] sont nécessaires. Par exemple, si le fichier DBF de votre fichier Shape contient un champ nommé "MACOULEUR" qui indique la valeur de la couleur pour chaque enregistrement, votre objet LABEL doit contenir :

source: Supported encoding format to be used for labels. If the format is not supported, the label will not be drawn. Requires the iconv library (present on most systems). The library is always detected if present on the system, but if not the label will not be drawn.
fr: Format d'encodage géré à utiliser pour les étiquettes. Si le format n'est pas géré, l'étiquette ne sera pas dessinée. Nécessite la bibliothèque iconv (présente sur la plupart des systèmes). La bibliothèque est toujours détectée si elle est présente sur le système mais si celle-ci n'est pas présente, l'étiquette ne sera pas dessinée.

source: Required for displaying international characters in MapServer. More information can be found in the :ref:`Label Encoding document <labelencoding>`.
fr: Nécessaire pour afficher des caractères internationaux dans MapServer. Plus d'informations sur le :ref:`document d'encodage des étiquettes <labelencoding>`.

source: Font alias (as defined in the FONTSET) to use for labeling.
fr: Nom de la police de caractères (comme défini dans le FONTSET) à utiliser pour les étiquettes.

source: [*Attribute*] was introduced in version 5.6 to specfify the font alias.
fr: [*Attribute*] a été introduit dans la version 5.6 pour définir l'alias de la police.

source: Forces labels for a particular class on, regardless of collisions. Available only for cached labels. Default is false. If `FORCE` is true and `PARTIALS` is false, `FORCE` takes precedence, and partial labels are drawn.
fr: Force l'affichage des étiquettes d'une classe particulière, sans s'occuper des superpositions (collisions). Disponible seulement pour les étiquettes en cache. Désactivé par défaut. Si `FORCE` est à true et `PARTIALS` est à false, `FORCE` prend la précédence, et les étiquettes partielles sont dessinées.

source: This keyword interacts with the WRAP_ keyword so that line breaks only occur after the defined number of characters.
fr: Introduit dans mapserver 5.4, ce mot clé interagit avec le mot clé WRAP_ afin que les retours à la lignes aient lieu seulement après un nombre défini de caractères.

source: always wrap at the WRAP_ character
fr: retour à la ligne au caractère WRAP_

source: newline at the first WRAP_ character after MAXLENGTH_ characters
fr: nouvelle ligne dès le premier caractère WRAP_ après MAXLENGTH_ caractères

source: hard wrap (always break at exactly MAXLENGTH_ characters)
fr: retour fixe (toujours exactement après MAXLENGTH_ caractères)

source: **no wrap**
fr: **pas de wrap**

source: no processing
fr: aucun traitement

source: skip label if it contains more than MAXLENGTH_ characters
fr: ignore l'étiquette s'il contient plus que MAXLENGTH_ caractères

source: The associated RFC document for this feature is :ref:`RFC40`.
fr: Le document RFC associé pour cette fonctionalité est :ref:`RFC40`.

source: Angle threshold to use in filtering out ANGLE FOLLOW labels in which characters overlap (floating point value in degrees). This filtering will be enabled by default starting with MapServer 6.0. The default MAXOVERLAPANGLE value will be 22.5 degrees, which also matches the default in GeoServer. Users will be free to tune the value up or down depending on the type of data they are dealing with and their tolerance to bad overlap in labels. As per RFC 60, if MAXOVERLAPANGLE is set to 0, then we fall back on pre-6.0 behavior which was to use maxoverlapangle = 0.4*MS_PI (40% of 180 degrees = 72degree).
fr: Seuil de l'angle à utiliser pour filtrer les étiquettes ANGLE FOLLOW dans lesquelles les caractères se superposent (valeur flottante en degrés). Ce filtrage sera activé par défaut avec MapServer 6.0. La valeur MAXOVERLAPANGLE par défaut sera 22.5 degrees, qui correspond aussi à celle par défaut de GeoServer. Les utilisateurs seront libres de personnaliser la valeur en plus ou en moins en fonction du type de données qu'ils gèrent et de leur tolérance à la mauvaise superposition des étiquettes. Selon la RFC 60, si MAXOVERLAPANGLE est défini à 0, alors on retombe sur le comportement antérieur à la version 6.0 qui était d'utiliser maxoverlapangle = 0.4*MS_PI (40% de 180 degrés = 72 degrés).

source: The associated RFC document for this feature is :ref:`RFC60`.
fr: Le document RFC associé pour cette fonctionalité est :ref:`RFC60`.

source: Maximum font size to use when scaling text (pixels). Default is 256. Starting from version 5.4, the value can also be a fractional value (and not only integer). See :ref:`LAYER` :ref:`SYMBOLSCALEDENOM <symbolscaledenom>`.
fr: Taille maximum de polices à utiliser quand on met à l'échelle le texte (pixels). Par défaut, la valeur est 256. A partir de la version 5.4, la valeur peut aussi être une valeur fractionnelle (et pas seulement un entier). Voir le :ref:`SYMBOLSCALEDENOM <symbolscaledenom>` de la :ref:`LAYER`.

source: Minimum distance between duplicate labels. Given in pixels.
fr: Distance minimale entre des étiquettes en double, en pixels.

source: Minimum size a feature must be to be labeled. Given in pixels. For line data the overall length of the displayed line is used, for polygons features the smallest dimension of the bounding box is used. "Auto" keyword tells MapServer to only label features that are larger than their corresponding label. Available for cached labels only.
fr: Taille minimale d'une entité devant être étiquettée, en pixels. Pour les données linéaires, la longueur totale de la ligne affichée est utilisée, pour les entités polygonales la taille du plus petit côté du rectangle englobant est utilisée. Le mot-clé "Auto" indique à MapServer d'étiqueter uniquement les entités plus grandes que leur propre étiquette. Disponible seulement pour les étiquettes en cache.

source: Minimum font size to use when scaling text (pixels). Default is 4. Starting from version 5.4, the value can also be a fractional value (and not only integer). See :ref:`LAYER` :ref:`SYMBOLSCALEDENOM <symbolscaledenom>`.
fr: Taille minimum de polices à utiliser quand on met à l'échelle le texte (pixels). Par défaut, la valeur est 4. A partir de la version 5.4, la valeur peut aussi être une valeur fractionnelle (et pas seulement un entier). Voir le :ref:`SYMBOLSCALEDENOM <symbolscaledenom>` de la :ref:`LAYER`.

source: Offset values for labels, relative to the lower left hand corner of the label and the label point. Given in pixels. In the case of rotated text specify the values as if all labels are horizontal and any rotation will be compensated for. See :ref:`LAYER` :ref:`SYMBOLSCALEDENOM <symbolscaledenom>`.
fr: Valeurs de décalage pour les étiquettes, relatif au coin bas gauche de l'étiquette et à l'étiquette point. Donné en pixels. Dans le cas d'un texte pivoté, spécifiez les valeurs comme si toutes les étiquettes étaient horizontales et n'importe quelle rotation sera compensée. Voir le :ref:`SYMBOLSCALEDENOM <symbolscaledenom>` de la :ref:`LAYER`.

source: Color to draw a one pixel outline around the characters in the text.
fr: Couleur utilisée pour dessiner une ligne d'un pixel autour du texte.

source: [*attribute*] was introduced in version 5.0, to specify the item name in the attribute table to use for color values. The hard brackets [] are required. For example, if your shapefile's DBF has a field named "MYOUTCOLOR" that holds color values for each record, your LABEL object might contain:
fr: [*ATTRIBUTE*] a été implémenté dans la version 5.0 pour spécifier le nom de l'attribut dans la table attributaire à utiliser pour les valeurs de couleur. Les crochets [] sont nécessaires. Par exemple, si le fichier DBF de votre fichier Shape contient un champ nommé "MACOULEUREXTERIEURE" qui indique la valeur de la couleur pour chaque enregistrement, votre objet LABEL doit contenir :

source: Width of the outline if OUTLINECOLOR_ has been set. Defaults to 1. Currently only the AGG renderer supports values greater than 1, and renders these as a 'halo' effect: recommended values are 3 or 5.
fr: Largeur du contour si OUTLINECOLOR_ a été définie. 1 par défaut. Pour l'instant sur le moteur de rendu AGG gère des valeurs supérieures à 1, et rend un contour avec un effet "d'halo" : valeurs recommendées : 3 ou 5.

source: Can text run off the edge of the map? Default is true. If `FORCE` is true and `PARTIALS` is false, `FORCE` takes precedence, and partial labels are drawn.
fr: Le text peut-il sortir de la carte? Par défaut, oui. Si `FORCE` est à "true" et `PARTIALS` est à "false", `FORCE` prend la précédence, et les étiquettes partielles sont alors dessinées.

source: Position of the label relative to the labeling point (layers only). First letter is "Y" position, second letter is "X" position. "Auto" tells MapServer to calculate a label position that will not interfere with other labels. With points, MapServer selects from the 8 outer positions (i.e. excluding cc). With polygons, MapServer selects from cc (added in MapServer 5.4), uc, lc, cl and cr as possible positions. With lines, it only uses lc or uc, until it finds a position that doesn't collide with labels that have already been drawn. If all positions cause a conflict, then the label is not drawn (Unless the label's FORCE_ a parameter is set to "true"). "Auto" placement is only available with cached labels.
fr: Position de l'étiquette relative au point d'insertion (couches seulement). La première lettre est la position en "Y", la seconde lettre est la position en "X". "Auto" indique à MapServer de calculer une position d'étiquette qui n'interférera pas avec d'autres étiquettes. Avec des points, MapServer sélectionne l'une des 8 positions extérieures (c'est à dire en excluant cc). Avec les polygones, MapServer sélectionne cc (ajouté dans MapServer 5.4), uc, lc, cl et cr comme positions possible. Avec des lignes, il utilise seulement lc ou uc, jusqu'à ce qu'il trouve une position qui n'entraîne pas de chevauchement (collision) avec des étiquettes déjà dessinées. Si toutes les positions entraînent un conflit, alors l'étiquette n'est pas dessinée (sauf si le paramètre d'étiquette FORCE_ est à "true"). "Auto" est seulement disponible avec les étiquettes en cache.

source: The priority parameter takes an integer value between 1 (lowest) and 10 (highest). The default value is 1. It is also possible to bind the priority to an attribute (item_name) using square brackets around the [item_name]. e.g. "PRIORITY [someattribute]"
fr: Le paramètre de priorité (ajouté dans la version 5.0) prend un chiffre entier entre 1 (la plus basse) et 10 (la plus haute). La valeur par défaut est de 1. Il est également possible d'affecter la priorité à un attribut (item_name) en utilisant des crochets autour de l'attribut. Par exemple "PRIORITY [monattribut]"

source: Labels are stored in the label cache and rendered in order of priority, with the highest priority levels rendered first. Specifying an out of range PRIORITY value inside a map file will result in a parsing error. An out of range value set via MapScript or coming from a shape attribute will be clamped to the min/max values at rendering time. There is no expected impact on performance for using label priorities.
fr: Les étiquettes sont stockées dans le cache des étiquettes et sont dessinées par ordre de priorité : les plus hauts niveaux de priorité sont dessinés en premier. Spécifier dans le mapfile une valeur en dehors de la plage correcte du paramètre PRIORITY entrainera une erreur ("parse error"). Une valeur en dehors de la plage correcte récupérée depuis MapScript ou depuis un attribut prendra la valeur minimale ou maximale de PRIORITY au moment du rendu. Il n'y a pas d'impact attendu sur les performances lors de l'utilisation des priorités des étiquettes.

source: [*Attribute*] was introduced in version 5.6.
fr: [*Attribute*] a été introduit dans la version 5.6.

source: The label will be repeated on every line of a multiline shape and will be repeated multiple times along a given line at an interval of REPEATDISTANCE pixels.
fr: L'étiquette sera répétée sur chaque ligne d'une géométrie multligne et sera répétée plusieurs fois le long d'une ligne donnée dans un interval de REPEATDISTANCE pixels.

source: The associated RFC document for this feature is :ref:`RFC57`.
fr: Le document RFC associé pour cette fonctionalité est :ref:`RFC57`.

source: Color of drop shadow. A label with the same text will be rendered in this color before the main label is drawn, resulting in a shadow effect on the the label characters. The offset of the renderered shadow is set with SHADOWSIZE.
fr: Couleur de l'ombre portée. Une étiquette avec le même texte sera rendu dans cette couleur avant le dessin de l'étiquette principale, donnant ainsi un effet d'ombrage sur les caractères de l'étiquette. Le décalage de l'ombre rendue est défini avec SHADOWSIZE.

source: Shadow offset in pixels, see SHADOWCOLOR.
fr: Décalage de l'ombre en pixels, voir SHADOWCOLOR.

source: [*Attribute*] was introduced in version 6.0, and can be used like:
fr: [*Attribut*] a été introduit dans la version 6.0, et peut être utilisé de cette manière :

source: Text size. Use a number to give the size in pixels of your TrueType font based label, or any of the other 5 listed keywords for bitmap fonts.
fr: Taille de texte. Utilise un nombre pour donner la taille en pixels de votre étiquette basée sur la police TrueType, ou n'importe quel des 5 mots-clés listés pour les polices bitmap.

source: When scaling is in effect (:ref:`SYMBOLSCALEDENOM <symbolscaledenom>` is specified for the :ref:`LAYER`), `SIZE` gives the size of the font to be used at the map scale 1:`SYMBOLSCALEDENOM`.
fr: Quand la mise à l'échelle est utilisée (:ref:`SYMBOLSCALEDENOM <symbolscaledenom>` est spécifié pour la :ref:`LAYER`), la `SIZE` donne la taille de la police qui doit être utilisée à l'échelle de carte 1:`SYMBOLSCALEDENOM`.

source: Starting from version 5.4, the value can also be a fractional value (and not only integer).
fr: A partir de la version 5.4, la valeur peut aussi être une valeur fractionnelle (et plus seulement un entier)

source: [*Attribute*] was introduced in version 5.0, to specify the item name in the attribute table to use for size values. The hard brackets [] are required. For example, if your shapefile's DBF has a field named "MYSIZE" that holds size values for each record, your LABEL object might contain:
fr: [*Attribut*] a été introduit dans la version 5.0, pour spécifier le nom de l'élément dans la table d'attribut pour utiliser les valeurs de taille. Les crochets [] sont requis. Par exemple, si le DBF de votre shapefile a un champ nommé "MYSIZE" qui porte des valeurs de taille pour chaque enregistrement, votre objet LABEL contiendra peut-être :

source: The start of a :ref:`STYLE` object.
fr: Le début d'un objet :ref:`STYLE`

source: Label specific mechanisms of the :ref:`STYLE` object are the GEOMTRANSFORM options:
fr: Les mécanisme spécifiques aux étiquettes de l'objet :ref:`STYLE` sont dans les options GEOMTRANSFORM :

source: Creates a geometry that can be used for styling the label.
fr: Créé une géométrie qui peut être utilisée pour styler l'étiquette

source: labelpnt draws a marker on the geographic position the label is attached to. This corresponds to the center of the label text only if the label is in position CC.
fr: labelpnt dessine un marqueur sur la position géographique à laquelle l'étiquette est attachée. Cela correspond au centre de l'étiquette texte seulement si l'étiquette est en position CC.

source: labelpoly generates the bounding rectangle for the text, with 1 pixel of padding added in all directions.
fr: labelpoly génère le rectangle englobant pour le texte, avec 1 pixel d'espacement ajouté dans toutes les directions.

source: The resulting geometries can be styled using the mechanisms available in the `STYLE` object.
fr: Les géométries résultantes peuvent être stylées en utilisant les mécanismes disponibles dans l'objet `STYLE`.

source: Example - draw a red background rectangle for the labels (i.e. billboard) with a "shadow" in gray:
fr: Exemple - dessine un rectangle de fond rouge pour les étiquettes avec un ombrage "shadow" en gris:

source: Type of font to use. Generally bitmap fonts are faster to draw then TrueType fonts. However, TrueType fonts are scalable and available in a variety of faces. Be sure to set the FONT parameter if you select TrueType.
fr: Type de polices à utiliser. Généralement, les polices bitmap sont plus rapides à dessiner que les polices TrueType. Cependant, les polices TrueType permettent le changement d'échelles et sont disponibles dans une variété de types de polices. Assurez-vous d'avoir défini le paramètre FONT si vous avez sélectionné TrueType.

source: Bitmap fonts are only supported with the AGG and GD renderers.
fr: Les polices Bitmap sont seulement supportées avec les moteurs de rendus AGG et GD

source: Character that represents an end-of-line condition in label text, thus resulting in a multi-line label. Interacts with MAXLENGTH_ for conditional line wrapping after a given number of characters
fr: Caractère qui représente une condition de fin de ligne dans le texte de l'étiquette, par conséquent, donnant une étiquette multi-ligne. Interagit avec MAXLENGTH_ pour les conditions de retour à la ligne des étiquettes en fonction d'un nombre de caractères donné

source: Display of International Characters in MapServer
fr: Affichage des caractères internationaux dans MapServer
