Repository: MapServer/MapServer-documentation
Catalog: translated/*/mapfile.po
Languages: fr

source: The following functionality was added to MapServer 4.4.0 as a part of a project sponsored by the Information-technology Promotion Agency (IPA), in Japan. Project members included: Venkatesh Raghavan, Masumoto Shinji, Nonogaki Susumu, Nemoto Tatsuya, Hirai Naoki (Osaka City University, Japan), Mario Basa, Hagiwara Akira, Niwa Makoto, Mori Toru (Orkney Inc., Japan), and Hattori Norihiro (E-Solution Service, Inc., Japan).
fr: La fonctionnalité suivante a été ajoutée à MapServer 4.4.0 dans le cadre d'une partie de projet sponsorisé par l'"Information-technology Promotion Agency" (IPA), au Japon. Les membres du projet incluaient : Venkatesh Raghavan, Masumoto Shinji, Nonogaki Susumu, Nemoto Tatsuya, Hirai Naoki (Université de la ville d'Osaka, Japon), Mario Basa, Hagiwara Akira, Niwa Makoto, Mori Toru (Orkney Inc., Japon), et Hattori Norihiro (E-Solution Service, Inc., Japon).

source: Related Links
fr: Liens associés

source: Requirements
fr: Prérequis

source: MapServer compiled with the libiconv library
fr: MapServer compilé avec la bibliothèque libiconv

source: How to Enable in Your Mapfile
fr: Comment l'activer dans votre mapfile

source: The mapfile :ref:`LABEL <label>` object's parameter named *ENCODING* can be used to convert strings from its original encoding system into one that can be understood by the True Type Fonts. The *ENCODING* parameter accepts the encoding name as its parameter.
fr: Le paramètre de l'objet :ref:`LABEL <label>` du mapfile nommé *ENCODING* peut être utilisé pour convertir les chaînes de leur système d'encodage original dans un qui puisse être compris par les polices de type True Type. Le paramètre *ENCODING* accepte le nom d'encodage comme étant son paramètre.

source: Mapserver uses GNU's libiconv library ( `http://www.gnu.org/software/libiconv/`_ ) to deal with encodings. The libiconv web site has a list of supported encodings. One can also use the "iconv -l" command on a system with libiconv installed to get the complete list of supported encodings on that specific system.
fr: Mapserver utilise la bibliothèque libiconv du projet GNU ( `http://www.gnu.org/software/libiconv/`_ ) pour gérer les encodages. Le site web de libiconv a une liste des encodages supportés. Vous pouvez aussi utiliser la commande "iconv -l" sur un système avec libiconv installé pour avoir la liste complète des encodages supportés sur le système d'exploitation.

source: So, theoretically, every string with an encoding system supported by libiconv can be displayed as labels in MapServer as long as it has a matching font-set.
fr: Ainsi, théoriquement, chaque chaîne avec un sytème d'encodage supporté par libiconv peut être affichée comme une étiquette dans MapServer aussi longtemps que le jeu de polices correspondant est disponible.

source: Step 1: Verify ICONV Support and MapServer Version
fr: Etape 1 : vérifier le support de ICONV et la version de MapServer

source: Execute ''mapserv -v' at the commandline, and verify that your MapServer version >= 4.4.0 and it includes ''SUPPORTS=ICONV'', such as:
fr: Exécuter 'mapserv -v' dans votre ligne de commande, et vérifier que votre version de Mapserver est >= 4.4.0 et inclut 'SUPPORTS=ICONV', comme ceci :

source: Step 2: Verify That Your Files' Encoding is Supported by ICONV
fr: Etape 2 : vérifier que vos encodages de fichiers sont supportés par ICONV

source: Since MapServer uses the libiconv library to handle encodings, you can check the list of supported encodings here: `http://www.gnu.org/software/libiconv/`_
fr: Comme MapServer utilise la bibliothèque libiconv pour gérer les encodages, vous pouvez vérifier la liste des encodages supportés ici : `http://www.gnu.org/software/libiconv/`_

source: Unix users can also use the *iconv -l* command on a system with libiconv installed to get the complete list of supported encodings on that specific system.
fr: Les utilisateurs Unix peuvent aussi utiliser la commande *iconv -l* sur un système avec libiconv installé pour obtenir la liste complète des encodages supportés sur ce système en particulier.

source: Step 3: Add ENCODING Parameter to your LABEL Object
fr: Etape 3 : ajouter le paramètre ENCODING à votre objet LABEL

source: Now you can simply add the ENCODING parameter to your mapfile LAYER object, such as:
fr: Maintenant, vous pouvez simplement ajouter le paramètre ENCODING dans votre objet de mapfile LAYER, comme ceci :

source: One of the benefits of having an "ENCODING" parameter within the LABEL object is that different LAYERS with different encoding systems can be combined together and display labels within a single map. For example, labels from a Layer using Shapefile as it source which contains attributes in SHIFT-JIS can be combined with a Layer from a PostGIS database server with EUC-JP attributes. A sample Mapfile can look like this:
fr: Un des bénéfices d'avoir un paramètre "ENCODING" à l'intérieur de l'objet LABEL est que des LAYERS différentes avec des systèmes d'encodage différents peuvent être combinées ensemble et affichées dans une seule et même carte. Par exemple, les étiquettes pour une couche utilisant un Shapefile comme source qui contient des attributs en SHIFT-JIS peuvent être combinéees avec une couche provenant d'un serveur de base de données PostGIS avec des attributs EUC-JP. Un mapfile type peut ressembler à ceci :

source: Step 4: Test with the shp2img utility
fr: Etape 4 : tester avec l'utilitaire shp2img

source: see :ref:`shp2img commandline utility <shp2img>`
fr: Voir :ref:`l'utilitaire en ligne de commande shp2img <shp2img>`

source: Example Using PHP MapScript
fr: Exemple utilisant PHP MapScript

source: For PHP Mapscript, the *Encoding* parameter is included in the LabelObj Class, so that the encoding parameter of a layer can be modified such as:
fr: Pour le PHP Mapscript, le paramètre *Encoding* est inclus dans la Class de l'objet LabelObj, ainsi le paramètre d'encodage d'une couche peut être modifié comme ceci :

source: During initial implementation, this functionality was tested using the different Japanese encoding systems: Shift-JIS, EUC-JP, UTF-8, as well as Thai's TIS-620 encoding system.
fr: Pendant l'implémentation initiale, cette fonctionnalité a été testée en utilisant les différents encodages systèmes japonais : Shift-JIS, EUC-JP, UTF-8, aussi bien le système d'encodage Thai TIS-620.

source: Examples of encodings for the Latin alphabet supported by libiconv are: ISO-8859-1 (Latin alphabet No. 1 - also known as LATIN-1 - western European languages), ISO-8859-2 (Latin alphabet No. 2 - also known as LATIN-2 - eastern European languages), CP1252 (Microsoft Windows Latin alphabet encoding - English and some other Western languages).
fr: Des exemples d'encodage pour l'alphabet latin supportés par libiconv sont : ISO-8859-1 (Alphabet Latin No. 1 - connu aussi sous le nom LATIN-1 - langages de l'Europe de l'Ouest), ISO-8859-2 (Alphabet Latin No. 2 - connu aussi comme LATIN-2 - langages de l'Europe de l'Est), CP1252 (encodage de l'alphabet Latin Microsoft Windows - Anglais et certains langages de l'Europe de l'Ouest).

source: Signals the start of a :ref:`CLASS` object.
fr: Indique le début d'un objet :ref:`CLASS`.

source: Inside a layer, only a single class will be used for the rendering of a feature. Each feature is tested against each class in the order in which they are defined in the mapfile. The first class that matches the its min/max scale constraints and its :ref:`EXPRESSION <expressions>` check for the current feature will be used for rendering.
fr: Dans une couche, une seule classe sera utilisé pour afficher une feature. Chaque feature est testée en fonction d'une classe dans l'ordre dans laquelle celles-ci apparaissent dans le mapfile. La première classe dont les contraintes d'échelle min/max et la vérification de l':ref:`EXPRESSION <expressions>` fonctionnent pour la feature en cours sera utilisée pour le rendu.

source: Specify the class's group that would be considered at rendering time. The :ref:`CLASS` object's GROUP parameter must be used in combination with CLASSGROUP.
fr: Spécifie le groupe de la classe qui sera pris en compte au moment du rendu. Le paramètre GROUP de l'objet :ref:`CLASS` doit être utilisé en combinaison avec CLASSGROUP.

source: Item name in attribute table to use for class lookups.
fr: Nom de l'élément dans la table attributaire à utiliser dans les correspondances de classe.

source: Signals the start of a :ref:`CLUSTER` object.
fr: Indique le début d'un objet :ref:`CLUSTER`.

source: The CLUSTER configuration option provides to combine multiple features from the layer into single (aggregated) features based on their relative positions. Supported only for POINT layers.
fr: L'option de configuration CLUSTER permet de combiner plusieurs entités de la couche en une seule (aggrégée) entité en fonction de leurs positions relatives. Supporté seulement par les couches POINT.

source: Database connection string to retrieve remote data.
fr: Chaîne de caractères pour une connexion distante à une base de données.

source: An SDE connection string consists of a hostname, instance name, database name, username and password separated by commas.
fr: Une chaîne de caractères pour une connexion SDE est composée d'un nom de serveur ("hostname"), d'un nom d'instance, d'un nom de base de données, d'un nom d'utilisateur et de son mot de passe séparés par des virgules.

source: A PostGIS connection string is basically a regular PostgreSQL connection string, it takes the form of "user=nobody password=****** dbname=dbname host=localhost port=5432"
fr: Une chaîne de caractères pour une connexion PostGIS est sensiblement identique à une connexion pour PostgreSQL, elle prend la forme "user=nomuser password=****** dbname=dbname host=localhost port=5432"

source: An Oracle connection string: user/pass[@db]
fr: Une chaîne de caractères pour une connexion Oracle s'écrit comme ceci : utilisateur/motdepasse[@basededonnees].

source: Type of connection. Default is local. See additional documentation for any other type.
fr: Type de connexion. Par défaut "local". Voir la documentation additionnelle pour les autres types.

source: *mygis* is another connectiontype, but it is deprecated; please see the :ref:`MySQL section <mysql>` of the Vector Data document for connection details.
fr: *mygis* est un autre type de connection, mais il est déprécié; merci de voir :ref:`la section MySQL <mysql>` du document sur les données vecteur pour les détails relatifs à la connexion.

source: Full filename of the spatial data to process. No file extension is necessary for shapefiles. Can be specified relative to the SHAPEPATH option from the Map Object.
fr: Nom complet du fichier de données spatiales à traiter. Aucune extension n'est nécessaire pour les fichiers Shape. Un chemin relatif par rapport à l'option SHAPEPATH de l'objet Map peut être utilisé.

source: If this is an SDE layer, the parameter should include the name of the layer as well as the geometry column, i.e. "mylayer,shape,myversion".
fr: S'il s'agit d'une couche SDE, le paramètre devrait inclure le nom de la couche ainsi que la colonne de géométrie, par exemple "mylayer,shape,myversion".

source: If this is a PostGIS layer, the parameter should be in the form of "<columnname> from <tablename>", where "columnname" is the name of the column containing the geometry objects and "tablename" is the name of the table from which the geometry data will be read.
fr: S'il s'agit d'une couche PostGIS, le paramètre devrait être de la forme "<columnname> from <tablename>", où "columnname" est le nom de la colonne contenant les objets géométriques et où "tablename" est le nom de la table depuis laquelle les données géométriques seront lues.

source: For Oracle, use "shape FROM table" or "shape FROM (SELECT statement)" or even more complex Oracle compliant queries! Note that there are important performance impacts when using spatial subqueries however. Try using MapServer's FILTER_ whenever possible instead. You can also see the SQL submitted by forcing an error, for instance by submitting a DATA parameter you know won't work, using for example a bad column name.
fr: Pour Oracle, utilisez "shape FROM table" ou "shape FROM (SELECT statement)" ou n'importe quelle autre requête complexe conforme à Oracle! Notez que l'impact sur les performances est toujours important lors de l'utilisation de sous-requêtes spatiales. Essayez plutôt d'utiliser l'option FILTER de MapServer aussi souvent que possible. Vous pouvez aussi voir les requêtes SQL soumises en forçant une erreur, par exemple en soumettant un paramètre DATA invalide, en utilisant par exemple un mauvais nom de colonne.

source: Enables debugging of a layer in the current map.
fr: Active le débogage de la couche dans la carte courante.

source: *Debugging with MapServer versions >= 5.0:*
fr: *Débogage avec les versions de MapServer >= 5.0 :*

source: Verbose output is generated and sent to the standard error output (STDERR) or the MapServer errorfile if one is set using the "MS_ERRORFILE" environment variable. You can set the environment variable by using the CONFIG parameter at the MAP level of the mapfile, such as:
fr: Une sortie "verbeuse" est générée et envoyée dans la sortie standard des erreurs (STDERR) ou dans le fichier d'erreurs de MapServer si celui-ci est défini via la variable d'environnement "MS_ERRORFILE". Vous pouvez définir la variable d'environnement en utilisant le paramètre CONFIG au niveau MAP du mapfile, comme ceci :

source: You can also set the environment variable in Apache by adding the following to your httpd.conf:
fr: Vous pouvez également définir la variable d'environnement dans Apache en ajoutant la ligne suivante à votre fichier httpd.conf :

source: Once the environment variable is set, the DEBUG mapfile parameter can be used to control the level of debugging output. Here is a description of the possible DEBUG values:
fr: Une fois que la variable d'environnement est définie, le paramètre DEBUG du mapfile peut être utilisé pour contrôler le niveau de débugage en sortie. Voici une description des valeurs possibles de DEBUG :

source: **DEBUG O or OFF** - only msSetError() calls are logged to MS_ERRORFILE. No msDebug() output at all. This is the default and corresponds to the original behavior of MS_ERRORFILE in MapServer 4.x
fr: **DEBUG O or OFF** - Seuls les appels msSetError() sont enregistrés dans MS_ERRORFILE. Aucune sortie msDebug(). C'est la valeur par défaut et correspond au comportement d'origine de MS_ERRORFILE dans MapServer 4.x.

source: **DEBUG 1 or ON** - includes all output from DEBUG 0 plus msDebug() warnings about common pitfalls, failed assertions or non-fatal error situations (e.g. missing or invalid values for some parameters, missing shapefiles in tileindex, timeout error from remote WMS/WFS servers, etc.)
fr: **DEBUG 1 or ON** - Inclut toutes les sorties de DEBUG 0 plus les avertissements msDebug() au sujet des erreurs communes, des affirmations fausses et de situations d'erreur non fatale (par exemple des valeurs manquantes ou invalides pour certains paramètres, des fichiers Shape manquants dans un "tileindex", des erreurs de délai dépassé depuis un serveur WMS/WFS distant, ...).

source: **DEBUG 2** - includes all output from DEBUG 1 plus notices and timing information useful for tuning mapfiles and applications
fr: **DEBUG 2** - Inclut toutes les sorties de DEBUG 1 plus des avis et une information temporelle utiles pour la modification des mapfiles et des applications.

source: **DEBUG 3** - all of DEBUG 2 plus some debug output useful in troubleshooting problems such as WMS connection URLs being called, database connection calls, etc. This is the recommended level for debugging mapfiles.
fr: **DEBUG 3** - Toutes les sorties de DEBUG 2 plus quelques sorties de débugage utiles dans les problèmes de fonctionnement comme les URLs appelées pour les connexions WMS, les appels à une base de données distante, ... C'est le niveau recommandé pour déboguer les mapfiles.

source: **DEBUG 4** - DEBUG 3 plus even more details...
fr: **DEBUG 4** - DEBUG 3 plus quelques détails supplémentaires ...

source: **DEBUG 5** - DEBUG 4 plus any msDebug() output that might be more useful to the developers than to the users.
fr: **DEBUG 5** - DEBUG 4 plus les sorties msDebug() plus utiles aux développeurs qu'aux utilisateurs.

source: You can also set the debug level by using the "MS_DEBUGLEVEL" environment variable.
fr: Vous pouvez également définir le niveau de débugage en utilisant la variable d'environnement "MS_DEBUGLEVEL".

source: The DEBUG setting can also be specified for the entire map, by setting the DEBUG parameter in the :ref:`MAP` object.
fr: Le paramètre DEBUG peut également être spécifié pour toute la carte, en définissant ce paramètre DEBUG dans l'objet :ref:`MAP`.

source: For more details on this debugging mechanism, please see :ref:`RFC28`.
fr: Pour plus de détails sur le mécanisme de débogage, consultez la :ref:`RFC28`.

source: *Debugging with MapServer versions < 5:*
fr: *Débogage avec les versions de MapServer < 5.0 :*

source: Verbose output is generated and sent to the standard error output (STDERR) or the MapServer logfile if one is set using the LOG parameter in the WEB object. Apache users will see timing details for drawing in Apache's error_log file. Requires MapServer to be built with the DEBUG=MSDEBUG option (--with-debug configure option).
fr: Une sortie "verbeuse" est générée et envoyée dans la sortie standard des erreurs (STDERR) ou dans le fichier d'erreurs de MapServer si celui-ci est défini par le paramètre LOG dans l'objet WEB. Les utilisateurs Apache verront les temps de traitement du rendu dans le fichier error_log d'Apache. MapServer doit être compilé avec l'option DEBUG=MSDEBUG (option du "configure" : –with-debug).

source: Switch to allow MapServer to return data in GML format. Useful when used with WMS GetFeatureInfo operations. "false" by default.
fr: Commutateur permettant à MapServer de retourner les données au format GML. Très utile quand vous utilisez les opérations "GetFeatureInfo" de WMS. Désactivé par défaut.

source: The spatial extent of the data. In most cases you will not need to specify this, but it can be used to avoid the speed cost of having MapServer compute the extents of the data. An application can also possibly use this value to override the extents of the map.
fr: L'étendue spatiale des données. Dans la plupart des cas vous n'avez pas besoin de définir ceci, mais il peut être utilisé pour éviter le coût sur la vitesse lorsque MapServer calcul l'étendue des données. Une application peut également utiliser cette valeur pour écraser l'étendue de la carte.

source: Signals the start of a :ref:`FEATURE` object.
fr: Indique le commencement d'un objet :ref:`FEATURE`

source: This parameter allows for data specific attribute filtering that is done at the same time spatial filtering is done, but before any CLASS expressions are evaluated. For OGR and shapefiles the string is simply a mapserver regular expression. For spatial databases the string is a SQL WHERE clause that is valid with respect to the underlying database.
fr: Ce paramètre permet de filtrer les données selon un attribut particulier en même temps que le filtrage spatial, mais avant que toute expression de CLASS soit évaluée. Pour OGR et les fichiers Shape, la chaîne de caractères est simplement une expression régulière MapServer. Pour les bases de données spatiales, la chaîne de caractères est une requête SQL "WHERE" adaptée à la base de données concernée.

source: For example: FILTER ([type]='road' and [size]<2)
fr: Par exemple : FILTER ([type]='road' and [size]<2)

source: Item to use with simple FILTER_ expressions. OGR and shapefiles only.
fr: Élément à utiliser avec des expressions FILTER_ simples. OGR et fichiers Shape seulement.

source: Template to use *after* a layer's set of results have been sent. Multiresult query modes only.
fr: Mise en forme ("template") à utiliser après qu'un jeu de résultats d'une couche ait été envoyé. Modes de requête "multirésultat" seulement.

source: Signals the start of a :ref:`GRID` object.
fr: Indique le commencement d'un objet :ref:`GRID`.

source: Name of a group that this layer belongs to. The group name can then be reference as a regular layer name in the template files, allowing to do things like turning on and off a group of layers at once.
fr: Nom d'un groupe auquel la couche appartient. Le nom de groupe peut ensuite être référencé comme un nom normal de couche dans les fichiers de mise en forme ("template"), ce qui permet de faire certaines opérations comme afficher ou cacher un groupe de plusieurs couches en une seule opération.

source: If a group name is present in the LAYERS parameter of a CGI request, all the layers of the group are returned (the `STATUS` of the `LAYER`\s have no effect).
fr: Si un nom de groupe est présent dans les paramètres LAYERS de la requête CGI, toutes les couches de ce groupe sont alors retournées (le `STATUS` de(s) couche(s) `LAYER` n'a pas d'effet).

source: Template to use *before* a layer's set of results have been sent. Multiresult query modes only.
fr: Mise en forme ("template") à utiliser *avant* qu'un jeu de résultats d'une couche ait été envoyé. Mode de requête "multirésultat" seulement.

source: Signals the start of a :ref:`JOIN` object.
fr: Indique le commencement d'un objet :ref:`JOIN`.

source: (As of MapServer 5.0 this parameter is no longer available. Please see the :ref:`LABEL` object's ANGLE parameter) For MapServer versions < 5.0, this is the item name in attribute table to use for class annotation angles. Values should be in degrees.
fr: (À partir de MapServer 5.0 ce paramètre n'est plus disponible. Voyez le paramètre ANGLE de l'objet :ref:`LABEL`) Pour les versions < 5.0 de MapServer c'est le nom de l'élément dans la table attributaire à utiliser pour la valeur des angles de la classe d'annotation. Les valeurs doivent être exprimées en degrés.

source: Specifies whether labels should be drawn as the features for this layer are drawn, or whether they should be cached and drawn after all layers have been drawn. Default is on. Label overlap removal, auto placement etc... are only available when the label cache is active.
fr: Spécifie si les étiquettes doivent être dessinées comme des entités de la couche en cours de dessin, ou si elles doivent être cachées et dessinées après que toutes les couches aient été dessinées. Activé par défaut. La suppression des superpositions d'étiquettes, le placement automatique etc... ne sont disponibles que lorsque le cache d'étiquette est actif.

source: Item name in attribute table to use for class annotation (i.e. labeling).
fr: Nom de l'élément dans la table attributaire à utiliser comme classe d'annotation (par exemple pour l'étiquetage).

source: Minimum scale at which this LAYER is labeled. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000. Implemented in MapServer 5.0, to replace the deprecated LABELMAXSCALE parameter.
fr: Échelle maximale pour laquelle la couche est étiquetée. L'échelle est donnée comme dénominateur de la fraction de l'échelle actuelle. Par exemple pour une carte à l'échelle de 1:24000, il s'agit de 24000. Implémenté dans MapServer 5.0 pour remplacer le paramètre obsolète LABELMAXSCALE.
